[
    [
        {
            "title": "Brilliant read 📚 👏 very good insight into the life of hass",
            "rating": "5.0 out of 5 stars",
            "body": "Brilliant book 📖 👏 plenty of nice details and insights into hass. Listened to the audio book also read by the man himself 😁"
        },
        {
            "title": "Surviving to Drive",
            "rating": "5.0 out of 5 stars",
            "body": "A great book, amusing, honest, full of insights and easy to read, I thoroughly enjoyed it"
        },
        {
            "title": "The fun, ups and downs of F1 warts and all - with real honesty",
            "rating": "5.0 out of 5 stars",
            "body": "Gunther tells it how it is, warts and all and the reality, ups and downs, and real day to day in his teams. This is an honest account in the year in the life of a genuine hard working team boss who loves, hates, laughs and cried F1. And wants to share it. Shame more of the bosses can't be so open and honest and non politically correct!!"
        },
        {
            "title": "Brilliant read",
            "rating": "5.0 out of 5 stars",
            "body": "Couldn’t put it down brilliant easy interesting and funny. Honestly I’d recommend this book to F1 fans"
        },
        {
            "title": "brilliant boom",
            "rating": "5.0 out of 5 stars",
            "body": "This book is truly inspiring and wonderful. it gives you a real insight as to what people have to go through behind the scenes and if you are a formula one fan, it really makes you sympathise with the team principles. delivery was impeccable and the quality is excellent. i recommend this buy"
        },
        {
            "title": "Funny and I think I read it all in his accent 😂",
            "rating": "5.0 out of 5 stars",
            "body": "Loved it from start to finish. I knew it was diary entries so got what I expected and if you Guenther, Hass or just f1 in general it’s a good way read"
        },
        {
            "title": "A great book for a F1 fan",
            "rating": "5.0 out of 5 stars",
            "body": "A birthday present for my F1 fan husband"
        },
        {
            "title": "Only GS could write a memoir like this, thoughtful, clever and most entertaining",
            "rating": "5.0 out of 5 stars",
            "body": "After enjoying Drive to Survive it was interesting to see what the real GS is like.He’s just as he seems on TV."
        }
    ],
    [
        {
            "title": "Cracker of a book - please write one every year.",
            "rating": "5.0 out of 5 stars",
            "body": "Absolutely love Gunther, his honesty, humour and genuine warmth and passion for F1 come across in this book. Please write one every year !"
        },
        {
            "title": "Great book, couldn’t put it down",
            "rating": "5.0 out of 5 stars",
            "body": "This is a very interesting and informative and at times very foking funny read. Guenther seems to have a great life but he must have ran over about a million cats with all that bad luck.Great book I couldn’t put it down, my wife glued it to my hands"
        },
        {
            "title": "Very funny",
            "rating": "5.0 out of 5 stars",
            "body": "Excellent book. Very funny in places. Very well written and gives a fantastic insight into the day to day of an f1 principal. Love the stories about his early years in motor racing."
        },
        {
            "title": "Great",
            "rating": "5.0 out of 5 stars",
            "body": "Bought as a gift was well liked ."
        },
        {
            "title": "Thrilling read but dries up",
            "rating": "4.0 out of 5 stars",
            "body": "The stories that Guenther tells are really funny and fascinating, his story-telling is excellent. Reading it in Guenthers voice makes it so much better.Up to the middle of the book is most interesting because it’s new and untold, however as the book progresses it seems to dry up and less is said in each diary entry. I think the diary format really downplays the book.Overall, the book is fascinating, funny and touching. Definitely worth the read, but does dry out towards the end"
        },
        {
            "title": "What a ride!",
            "rating": "5.0 out of 5 stars",
            "body": "The book was a present from someone who knows I am a massive fan of F1 and especially some of its main characters like Guenther, who is somewhat different to more reserved people in his position. Anyway, despite the profanity, which there is a lot of, it is an excellent read and insight into his life and other notables within the sport and, in my view, a terrific read, and certainly not for the faint-hearted. But if you want a non-glamorous approach with a gritty edge to the F1 landscape, then definitely get this and be transported to a side of the sport not normally seen."
        },
        {
            "title": "unbelievable fantastic book",
            "rating": "5.0 out of 5 stars",
            "body": "What a book absolutely loved it, I would not like to be a F1 team boss at all. Definitely should be Sport Autobiography of the year"
        },
        {
            "title": "Enjoyable",
            "rating": "5.0 out of 5 stars",
            "body": "Really enjoyed the book. You can't help but read it in Guenther's voice!Gives. really good insight to the mentality required to operate on a level of an F1 team principal."
        }
    ]
]