[
    [
        {
            "title": "Battery charge in use limited, best to have a spare battery, otherwise this a great Vblog camera.",
            "rating": "4.0 out of 5 stars",
            "body": "Only gripe is battery life in use, not really long enough, but that doesn't detract from the fact that this is a very worthy camera. Only gave it four stars because of battery life, otherwise five stars for the camera performance and ease of use. A good buy."
        },
        {
            "title": "Good",
            "rating": "3.0 out of 5 stars",
            "body": "Good"
        },
        {
            "title": "Zoom",
            "rating": "4.0 out of 5 stars",
            "body": "The Zoom is not quite long enough."
        },
        {
            "title": "Very happy",
            "rating": "5.0 out of 5 stars",
            "body": "Took a leap of faith,after reading many many reviews of many many cameras and have to say been very impressed"
        },
        {
            "title": "A good camera to have handy",
            "rating": "4.0 out of 5 stars",
            "body": "A bit fiddly to use. Once you get used to the viewfinder it's good to use. A bit pricey for what it is."
        },
        {
            "title": "Great investment. Simple, Effective, Durable 100% satisfied.",
            "rating": "5.0 out of 5 stars",
            "body": "Camera solved all my needs on my recent holidays and honeymoon. Small enough to put on my belt and pull out for a quick snap but always takes amazing shots. Mountain ranges, Night time dance floors, selfies with the Mrs on the riverside.Im not a photographer and couldn't tell you what 90% of the setting do but with this little camera ive managed to take some really breathtaking shots that will be going up on my wall that i would of never been able to do with my phone.Took it up a glacier, on boats, to tango festivals and weddings and its a rock solid bit of kit with the case.Being able to charge it with the USB was a life saver, And uploading all my photos to my laptop was a breeze. Id recommend getting a 64gb card if you are planning on doing any videos. And getting the case with it is a 100% must if your the adventurous sort.This camera will be coming with me all over the world :D"
        },
        {
            "title": "A great compact camera",
            "rating": "5.0 out of 5 stars",
            "body": "A very good Cannon compact camera but unfortunately I needed to send it back because of a change of plan I decided to buy an upgraded model . The seller and Amazon returns were absolutely brilliant and returned my money promptly and efficiently and I could not ask for better service !"
        },
        {
            "title": "Solid camera",
            "rating": "5.0 out of 5 stars",
            "body": "I am extremely pleased with this camera. I haven't even tried out half the features yet but it takes crisp, clear photos and the battery lasts for ages."
        }
    ],
    [
        {
            "title": "Bought this as a gift - 5 stars from us",
            "rating": "5.0 out of 5 stars",
            "body": "Love this product, we get some good use out of these for the family holiday."
        },
        {
            "title": "AMazing camera and functions",
            "rating": "5.0 out of 5 stars",
            "body": "Absolutely love this little camera. Primary use is as a vlogging camera however when used for taking holiday snaps the zoom and other options gave us some great photo memories."
        },
        {
            "title": "it breaks every two weeks don't bother. When it works its great but i've spent hundreds fixing it.",
            "rating": "1.0 out of 5 stars",
            "body": "Dont bother"
        },
        {
            "title": "Great little camera",
            "rating": "5.0 out of 5 stars",
            "body": "I use a DSLR for shooting videos on YouTube but needed a pocket sized point and shot with depth of field for longer trips where I wanted to be more lightweight.This suits me fine. Very happy with it.Auto focus is a bit slow and ponderous but I can live with it.It’s a decent “cheaper” option. No 4K but I’m not bothered about that personally.Picture quality is good, sound quality is very good. In built mic only but it’s of a decent standard.Very happy overall."
        },
        {
            "title": "don't buy no camera inside",
            "rating": "1.0 out of 5 stars",
            "body": "everything but the camera came i would like a full refund and im sending the box with the other stuff back"
        },
        {
            "title": "MISSING CAMERA, UNHELPFUL ASSISTANCE. SCAMMED",
            "rating": "1.0 out of 5 stars",
            "body": "MISSING CAMERA! I have been scammed. Do not buy! The product include an empty box no camera! I am in disbelief"
        },
        {
            "title": "Good camera",
            "rating": "5.0 out of 5 stars",
            "body": "I have now become disabled after 4 years I used a DSLR before hand I am right handed but due to the stroke i suffered i am unable to use the right only the left. The canon g7x mk2 is outstanding for me now everything is close at hand for me. I use a tripod infront of the wheelchair. I can now use my left hand without having to hold the camera. Because its touchscreen you can move the viewfinder up and down makes it easier for me. The most important things for me are apature depth of field and iso.evething the camera has to offer me!"
        },
        {
            "title": "The best camera 👍",
            "rating": "5.0 out of 5 stars",
            "body": "Really good quality I love it, thank you 👍"
        }
    ]
]