[
    [
        {
            "title": "Canon EOS2000D",
            "rating": "5.0 out of 5 stars",
            "body": "Arrived on time and well packaged. The item was as described by seller (returned with minor damage to box - camera/contents as new). Really happy to get what I'd been after for less money and would definitely recommend!"
        },
        {
            "title": "for hobby very nice",
            "rating": "5.0 out of 5 stars",
            "body": "easy to use and nice photos"
        },
        {
            "title": "Brilliant camera",
            "rating": "5.0 out of 5 stars",
            "body": "Brought this camera to upgrade from an older make and model. Feels robust camera, settings seem easy enough to navigate. Battery charged pretty quick on a first charge. Added benefit of using the canon app to transfer pictures to my iPhone rather then the PC. Hopefully capture some great shots with this camera."
        },
        {
            "title": "Perfect for the beginner photographers",
            "rating": "5.0 out of 5 stars",
            "body": ""
        },
        {
            "title": "DO NOT WASTE YOUR MONEY",
            "rating": "1.0 out of 5 stars",
            "body": "I had an olympus for many many years, loved it and took great photos, then it died and we couldnt afford to replace it so I didnt have one for 4years and missed it dreadfullybut my husband, for our 30th anniversary, bought this as a surprise present (from the reviews probably-goodness knows whos writing them)what a nightmare camera(I havent told him how rubbishly designed this is btw I'm not heartless)1. it's massive, for no apparent reason, with the kit lens attached -why the lens cant go in and out of the body like other cameras am not sure??2.the auto focus abilities of it are just plain rubbish, if anything moves it doesnt follow it and it has to be held still to auto focus again(and its not quick so good luck shooting anything that moves)3.the auto focus lighting is appalling, sunrise is washed out and low level lighting is dark4.its not weatherproof at all (tho in the box was some sort of plastic shower cap, didnt know if it was for me or the camera??)5. you have to press many buttons, many times for it just to let you use the camera...eg: yes I know its on AF I dont need telling every time , how do I get rid of these screens, press the picture button, god it's off auto focus again, waiting waiting ok green box, press the button, o god its off auto focus ...\" you get the picture or dontIf we still had the box I would have sent this back so fast-an absolute waste of £350 (and thats without case/HDMI cable and card obvs!)"
        },
        {
            "title": "Buyer beware!",
            "rating": "3.0 out of 5 stars",
            "body": "This Canon camera has no external microphone port and therefore may not be suitable for some users."
        },
        {
            "title": "Nice item",
            "rating": "5.0 out of 5 stars",
            "body": "Great for beginners"
        },
        {
            "title": "Great camera for beginners and casual users",
            "rating": "5.0 out of 5 stars",
            "body": "Bought this camera to improve my car photography on social media. When editing the photos the difference between this and a smartphone camera is night and day. This camera offers you so much whilst being so easy to use. Definitely would recommend"
        }
    ],
    [
        {
            "title": "Easy to use and lovely image quality",
            "rating": "5.0 out of 5 stars",
            "body": "I purchased this camera as a gift to myself, I saved up all year for it and I wanted to get myself something for my birthday. I always love taking photos on my phone, and I wanted to expand on that with this purchase.As someone who has never really held a camera like this, it feels weird to hold, I always feel like I have to be careful with it, even when I have it in it’s lovely little bag/case I got for it. I will say however, having it in my hands also feels great and it feels just right. It’s an odd feeling, really! It probably helps that theres the addition of the straps, but I wish there was some sort of tutorial of how to place it on in the getting started book. It baffled me for a moment or two.The quality of the images are on a whole different level compared to my phone, so thats a good thing. I love how detailed the images looked. I took practice shots and being able to see literally everything on the plushies was weird at first, but it was a good experience!In short, I am happy with the camera. The quality is great, I love having it around, and it feels quite nice to use!"
        },
        {
            "title": "For first camere is nice to start",
            "rating": "5.0 out of 5 stars",
            "body": "Really easy for start to mace your first shot and Learn how is working all machine"
        },
        {
            "title": "Great for photography beginner",
            "rating": "5.0 out of 5 stars",
            "body": "This is the first camera I’ve used other than on a mobile phone. I found it easy to use as a beginner. Photo quality is VERY good would highly recommend this camera"
        },
        {
            "title": "Camera it doesnt work",
            "rating": "1.0 out of 5 stars",
            "body": "Please the camera it doesn work, what can i do?"
        },
        {
            "title": "Gift.",
            "rating": "5.0 out of 5 stars",
            "body": "I purchased this as a gift for my girlfriend and the feedback she has given is pretty good so far.A super dslr for beginners, intermediate and more."
        },
        {
            "title": "Excellent DSLR.",
            "rating": "5.0 out of 5 stars",
            "body": "My first dive in to Canon SLR's was a 1000F.Many years of use, but it had Drawbacks.The biggest was the 35mm film format.Always seemed to be waiting for the Pics to be Developed.Plus a duff shot was there forever.Usually identified by a sticker applied by the Photo process Co'.Into the Digital Age with a 2000D.Bought on a Warehouse deal. The box was open, sealed with Tape.Lens had a Smudge on it and needed a clean but I also bought a comprehensive camera care Kit so not a Prob'.Bit of a bargain price too.Online Instructions (Aren't they all?).Many Functions available. Many setings available too.Handles well in use and Buttons and Switches not to Fiddly.Going to take a while to get the hang of it, but I'm getting there.Certainly Recommend it.Very happy with my Purchase.BTW Takes Excellent Digital Photo's.As I seem to do as well."
        },
        {
            "title": "Brilliant Camera",
            "rating": "5.0 out of 5 stars",
            "body": "I am well impressed with this camera. I have had Canon Powershot cameras in the past and even though I am only an ametuer I wanted to upgrade with being able to attach different lenses and also stick with canon. So after chatting to a friend who knows a lot about Cameras and told me the differences of this one and my Canon Powershot SX430 this was the idea choice"
        },
        {
            "title": "Amazing camera comes with everything needed",
            "rating": "5.0 out of 5 stars",
            "body": "Brand new camera, absolutely amazing comes with battery and battery charger. Not a single complaint I highly recommend, amazing for beginners and professionals. If you are thinking about purchasing I say go for it with no doubt about it"
        }
    ]
]