[
    [
        {
            "title": "Microwave fault",
            "rating": "1.0 out of 5 stars",
            "body": "I purchased this microwave on 9/4/23 for my elderly mother it has started to make sparking noises and she has been told it’s faulty and not to use it. I would appreciate customer service email to advise next steps as it appears the month’s warranty has ran out!"
        },
        {
            "title": "El-cheapo option",
            "rating": "3.0 out of 5 stars",
            "body": "Timer is inadequate for seconds measurement - e.g. not accurate enough to time the 30 seconds I need to warm my coffee.Somehow the plastic in the centre of the driving mechanism - that grips the glass dish - melted ! I have not bothered to apply for a refund because I JUST KNOW that \"they\" will say it is my fault.Next time I will pay the extra bucks for a decent timer."
        },
        {
            "title": "Great Microwave",
            "rating": "5.0 out of 5 stars",
            "body": "Bought this microwave for my brother he is chuffed to bits with it just the right size and wattage for what he needs!"
        },
        {
            "title": "Basic microwave oven",
            "rating": "5.0 out of 5 stars",
            "body": "Purchased to replace a similar oven we had bought many years ago. It is simple to use and is small enough to fit in our utility room. Working well so far."
        },
        {
            "title": "Good for its price",
            "rating": "4.0 out of 5 stars",
            "body": "Simple dials. Easy to use. Can get very steamed up inside for no obvious reason"
        },
        {
            "title": "best quality with affordable cost",
            "rating": "5.0 out of 5 stars",
            "body": "best quality with affordable cost"
        },
        {
            "title": "Useful item",
            "rating": "5.0 out of 5 stars",
            "body": "Delivered quickly but damaged when opened box. Return was arranged but you have to take it to a post office yourself. Replacement received before date stated. Easy to use and looks stylish. No issues with the product itself."
        },
        {
            "title": "Toshiba -the very best make",
            "rating": "5.0 out of 5 stars",
            "body": "Very good value. Does the job well and efficiently. good to see Toshiba back in the market place for basic cooking/ warming up etc..had a Toshiba microwave which lasted for 28 years without losing power but gave it away for one which fitted into my new kitchen. Toshiba used to cook with no cold spots meaning some microwaves cooked unevenly even expensive makes so not suitable for cooking a sponge cake I am looking forward to trying this one. It is so easy to use."
        }
    ],
    [
        {
            "title": "Delivered earlier than expected",
            "rating": "5.0 out of 5 stars",
            "body": "Happy I received a day before expected delivery. Immediately unboxed it and startwd using it. Very easy to use, not complicated at all. Perfect size and perfect design."
        },
        {
            "title": "A microwave oven is very simple, nothing but power and time.",
            "rating": "4.0 out of 5 stars",
            "body": ""
        },
        {
            "title": "Do not buy this",
            "rating": "1.0 out of 5 stars",
            "body": "I bought this while ago but since day one I could hear and see sparks inside the microwave when I turned it and now it's completely dead."
        },
        {
            "title": "Brought as New but obviously not!",
            "rating": "1.0 out of 5 stars",
            "body": "Microwave turned up with clear signs of food inside,"
        },
        {
            "title": "It does what it says",
            "rating": "5.0 out of 5 stars",
            "body": "What do you think we use it for ?"
        },
        {
            "title": "It worked well",
            "rating": "4.0 out of 5 stars",
            "body": "But......I had to put my glasses on to be able to read what was written on the knobs"
        },
        {
            "title": "The absolute best",
            "rating": "5.0 out of 5 stars",
            "body": "I have had mine for over a year and it still works great"
        },
        {
            "title": "Good microwave",
            "rating": "5.0 out of 5 stars",
            "body": "This microwave is small but a great size for a caravan, really easy to use."
        }
    ]
]