[
    [
        {
            "title": "I’m no expert",
            "rating": "5.0 out of 5 stars",
            "body": "Not a big gamer but i’ve always had a playstation since the original PS1.Console is very big! Not the easiest to hide or mount on a wall.Graphics are great, sound quality is also really good and I like that you can get audio through the controller.Classic controller style,Only played RE4 Remake so far on it and it was a very enjoyable experience."
        },
        {
            "title": "Playstation 5",
            "rating": "5.0 out of 5 stars",
            "body": "Great console. Waited until well after launch to get one, partly due to high demand and low stock. Glad I waited, no issues with any games. Moved over from PS4 no issue with saves etc. Only thing is the PSN premium service isn't as good as Microsoft's Xbox pass ultimate and they cost the same.. take note Sony!"
        },
        {
            "title": "One of my best buys so far this year…",
            "rating": "5.0 out of 5 stars",
            "body": "Very very good, lost for words, simply brilliant"
        },
        {
            "title": "Top Quality",
            "rating": "5.0 out of 5 stars",
            "body": "The best console, exclusive graphics, enjoy the experience.Very recommended"
        },
        {
            "title": "Perfect for our needs",
            "rating": "5.0 out of 5 stars",
            "body": "Yes, it's a little on the large size. But still a great product."
        },
        {
            "title": "Graphics",
            "rating": "2.0 out of 5 stars",
            "body": "Love the ps5 looks nice in white I find this a bit expensive for what it is"
        },
        {
            "title": "Unit defective ....",
            "rating": "1.0 out of 5 stars",
            "body": "shipping went well, and the PS5 is a great product. but after 3 months ps5 died. can no longer turn on. it stays with the blue light, and you can't restart it even in safe mode. it has now been sent to Sony service. let's hope so..."
        },
        {
            "title": "Xbox user for 20 years giving the Playstation a try.",
            "rating": "5.0 out of 5 stars",
            "body": "Honestly, love the controller. That cute little Astro game that comes bundled in with it as a tech demo for said controller was so impressive for what it was. It's very quite and really big, like this is the most ridiculous sized console I've seen so far and the storage isn't that impressive compared to the Series X. However two things i do appreciate though is the complete lack of advertisements on the home screen, which Xbox is riddled with and third party NVME support. Meaning you don't have to spend a ridiculous amount of money on the Series X/S Seagate one.Now that's not to say i like everything about it, Microsoft went through quite a lot of effort to make as many 360 and original Xbox games backwards compatible with One X enhancements or FPS boost available for both Series consoles and well Sony has only focused on it's last gen games which is extremely disappointing.Onto gaming it plays games at way higher resolution than my Series S and is really silent whilst doing so. Playing God of war (first one) 4k 60fps is something to behold and whilst there's a few other games that I'm going to try out out i think I'm going to have fun.Now would i recommend this? yes. First party offerings are miles ahead of Xbox at this current moment in time. As Xbox offerings have been lacking, disappointing or whatever the hell Redfall is for the last 10 years. Also the always online DRM...Yeah. However Series X/S is better value for money and you can actually emulate PS1/2 games with dev mode on the series consoles.The PlayStation is better value for gaming in my honest opinion. PSVR is also an option to have an entirely different experience that's completely none existent over at Xbox. Great selection of first party games, much nicer less marketized home screen and a something i found humorous, it's own version of game pass with a lot of Bethesda games on XD.I haven't really played all that much on it at the moment but i have a few games downloaded from their version of the play pass."
        }
    ],
    [
        {
            "title": "Fantastic",
            "rating": "5.0 out of 5 stars",
            "body": "Love this console, sleek, great gaming and graphics"
        },
        {
            "title": "Amazing",
            "rating": "5.0 out of 5 stars",
            "body": "Been pondering on whether to get a PS5 since it's release. I'm primarily a PC gamer and have been for a long time. Owned Xbox's and Playstations in the past but mainly used my PC for gaming. So bit the bullet and bought one. Very happy that I did. It's such a great console with many exclusive titles. The controller is next level with the feedback you get in games. Always preferred the Xbox controller but since using the PS5 one this is not my preferred controller."
        },
        {
            "title": "Definitely worth the money",
            "rating": "5.0 out of 5 stars",
            "body": "I had waited years to get myself one of these, it was well worth the wait. The console is faster, far quieter and plays all my favourite games to a fantastic quality. Upgraded due to my original ps4 dieing should have upgraded sooner though."
        },
        {
            "title": "bloody fantastic 👏 👌",
            "rating": "5.0 out of 5 stars",
            "body": "10 out 10"
        },
        {
            "title": "97% perfect",
            "rating": "5.0 out of 5 stars",
            "body": "Simple and sweet, if you love PlayStation you’ll love this too. Graphics, processing speed everything is so much better!! My only complaint is when a system error happens. There are fixes for most of them now, i know to fix mine I had disconnect it from the PS4, so no remote gaming for me until this gets fixed in an update.Otherwise I’m happy with the system😁😁😁"
        },
        {
            "title": "Perfect.",
            "rating": "5.0 out of 5 stars",
            "body": "Got this as a suprise birthday present for my boyfriend, he's very happy with it. No complaints."
        },
        {
            "title": "Arrived with faulty controller",
            "rating": "1.0 out of 5 stars",
            "body": "This is a brand new console but the controller it came with has a loose charging port and won't receive charge. Not sure what's gone on with the quality control but I need a replacement under warranty ASAP!"
        },
        {
            "title": "No screw to stand it up",
            "rating": "1.0 out of 5 stars",
            "body": "I unpacked it an there was no screw in there so I can't stand it up and I don't know what size or thread the screw is in there"
        }
    ]
]