[
    [
        {
            "title": "Correct seller",
            "rating": "5.0 out of 5 stars",
            "body": "Fast and perfect 👌"
        },
        {
            "title": "Died after a few short months.",
            "rating": "1.0 out of 5 stars",
            "body": "After 3-4 months, of moderate usage in my Steamdeck, went to play a game one morning and the SD card just wasn’t being recognised in Windows or SteamOS, tried putting it in my DLSR, same thing, didn’t work, same with my laptop. Seems to be quite hit and miss experience wise though."
        },
        {
            "title": "great buy",
            "rating": "5.0 out of 5 stars",
            "body": "bought for a camera easy to use, fast delivery and very good value for money, really cant complain"
        },
        {
            "title": "Good",
            "rating": "5.0 out of 5 stars",
            "body": "Good"
        },
        {
            "title": "Love it",
            "rating": "5.0 out of 5 stars",
            "body": "Good product! Working."
        },
        {
            "title": "Didn’t work",
            "rating": "1.0 out of 5 stars",
            "body": "Returned item as it didn’t work in my dash cam. Never had issues with other Amazon basic products"
        },
        {
            "title": "Large capacity reasonable price.",
            "rating": "5.0 out of 5 stars",
            "body": "Thought id give amazon brand a go as opposed to my usual scandisk micro cards.Excellent price,work geat"
        },
        {
            "title": "Exactly as described",
            "rating": "5.0 out of 5 stars",
            "body": "Works perfect"
        }
    ],
    [
        {
            "title": "Great value and works brilliant on my dash cam",
            "rating": "5.0 out of 5 stars",
            "body": "My dash cam was working fine and then prompted me with “memory card error”. I tried reviving the memory card and I gave that up and bought this product.I required a minimum of class 10 (which this is) and I wanted a good size gb to store plenty of footage in.The memory card installed in the dash cam and worked straight out the box without anything extra required. It also came with a full size sd card adapter so you can plug this into a device now like a laptop with an SD card reader to transfer your data.It comes well packaged and protected and the price was not bad at all.I would certainly buy another."
        },
        {
            "title": "Very good",
            "rating": "5.0 out of 5 stars",
            "body": "Very good"
        },
        {
            "title": "It works really well",
            "rating": "5.0 out of 5 stars",
            "body": "Thank you, 128 Gigabites is a lit of space."
        },
        {
            "title": "Does it's job",
            "rating": "5.0 out of 5 stars",
            "body": "Perfect"
        },
        {
            "title": "Arrived quickly",
            "rating": "3.0 out of 5 stars",
            "body": "Got here on time and does what it is supposed to do."
        },
        {
            "title": "Perfect!",
            "rating": "5.0 out of 5 stars",
            "body": "Reads and writes quickly. 👍. Using in ASUS ZenBook"
        },
        {
            "title": "The card is good for everyday task",
            "rating": "1.0 out of 5 stars",
            "body": "The card is good for storage, but very poor for high demand task like video abd music. Change twice and still getting glitches while listening music or watching videos"
        },
        {
            "title": "Tight fit",
            "rating": "4.0 out of 5 stars",
            "body": "Works great after formatting was a tight fit in my phone Motorola G7 but I won't be taking it out for a few years ."
        }
    ]
]