[
    [
        {
            "title": "Strong and long battery life",
            "rating": "5.0 out of 5 stars",
            "body": "I so much like this because it is really strong and the battery can last the whole day, compared to the previous one I bought.I would highly recommend."
        },
        {
            "title": "Brilliant 🤩",
            "rating": "5.0 out of 5 stars",
            "body": "Brilliant for happy shopping & mealtimes!Also for fractious moments & car journeys whilst on the move !"
        },
        {
            "title": "I got the right one so can you 😁 highly recommended",
            "rating": "5.0 out of 5 stars",
            "body": "Great choice I made for my little one . Best present she said. Tbh Am really happy thatI choose the riOne as I was not sure how will turn outBut is been nearly 6 month and the battery is lasting so long and is charging so fast . What I love it is child safe to watch so as a parent is important to know what my child is watching and this do the perfect job 🤩"
        },
        {
            "title": "Simple and easy",
            "rating": "5.0 out of 5 stars",
            "body": "Simple and easy to use for my little ones"
        },
        {
            "title": "The case is great but not enough control",
            "rating": "2.0 out of 5 stars",
            "body": "This is the first item I’ve returned in about 600 orders of the years. 10/10 for how the product looks and the case is brilliant. However, you can not control or customise the kids home screen anyway near enough. It’s soooo cluttered and full of 100’s of videos and app recommendations for kids. I wanted a ‘blank slate’ I could hand pick apps and videos. There’s also no YouTube app so I can’t download videos for offline viewing. Also there’s no Apple TV app which is a bit crazy. The screen on the 7” in terms of size is fine but it’s not very sharp and everything looks a bit soft. So with all this I returned the item and bought a strong kids case for my wife’s iPad Mini and will use the Guided Access feature to control navigation."
        },
        {
            "title": "Buffer buffer buffer!!!!!",
            "rating": "2.0 out of 5 stars",
            "body": "When i first got this for kids it was good but after so long when kids are watching something on either Netflix or Disney+ or whatever it buffers every couple of seconds. Everything in my house connected to WIFI runs great no issues but this is terrible. When kids now want to watch anything i have to download it. It still buffers even with it downloaded but at least things are watchable"
        },
        {
            "title": "Very good",
            "rating": "5.0 out of 5 stars",
            "body": "Very good product, ideal for my 4 years old child"
        },
        {
            "title": "The best",
            "rating": "5.0 out of 5 stars",
            "body": "Kids love it"
        }
    ],
    [
        {
            "title": "Suitable play and learning gadget",
            "rating": "4.0 out of 5 stars",
            "body": "rugged protective back, ideal for learning and playing, good value for money"
        },
        {
            "title": "Happiest",
            "rating": "5.0 out of 5 stars",
            "body": "My Granddaughter loves her new Tablet she got for her birthday 🥳🤩"
        },
        {
            "title": "Be careful of the charging port",
            "rating": "1.0 out of 5 stars",
            "body": "I bought this for my son and the charging port has broken so there’s no way of charging it and it’s completely broken. So unfortunately it’s now useless and can’t be used anymore"
        },
        {
            "title": "Great for kids",
            "rating": "5.0 out of 5 stars",
            "body": "Bought this for our son, wide range of things to do with Amazon kids, keeps him occupied and has definitely n help with his learning, speech ect ! Comes with warranty.... Must buy for anyone."
        },
        {
            "title": "Don’t waste your money",
            "rating": "1.0 out of 5 stars",
            "body": "Honestly don’t waste ur money not even a month old and stopped responding and won’t work at all"
        },
        {
            "title": "Kids Fire Stick",
            "rating": "5.0 out of 5 stars",
            "body": "Excellent value for money"
        },
        {
            "title": "Disappointed",
            "rating": "1.0 out of 5 stars",
            "body": "This item worked for just under an hour we had to send back"
        },
        {
            "title": "Not bad but not good",
            "rating": "3.0 out of 5 stars",
            "body": "Returned as this isn't the best. It's slow. Can't download YouTube either"
        }
    ]
]