[
    [
        {
            "title": "Great phone, let down by poor battery life",
            "rating": "4.0 out of 5 stars",
            "body": "For those of us who will not, or can not, pay for the top of the range iPhones, this iPhone SE is a great phone. The camera isn't the best, but it's good enough for me. Everything else is great, with the exception of the battery life. Yes, I use my phone a lot, but I'd hope the battery would last 24 hours. It doesn't. I usually find myself putting mine on charge by the evening. I do have a second iPhone SE which gets a lot less use. That one does easily last 24 hours, so it is down to usage.Recommended."
        },
        {
            "title": "Actually iPhone 7",
            "rating": "2.0 out of 5 stars",
            "body": "It is a lovely phone but feel the wording is slightly miss leading if you are not an iPhone pro . It reads as 2023 phone but is actually an iPhone 7 so I have in fact downgraded!"
        },
        {
            "title": "Versatile phone which integrates well other Apple products",
            "rating": "5.0 out of 5 stars",
            "body": "After years of avoiding smart phones I decided to buy one. I should have bought one sooner, it’s so versatile. Links well with my car’s entertainment system."
        },
        {
            "title": "Quickest way to get an iPhone",
            "rating": "5.0 out of 5 stars",
            "body": "Needed a phone quickly and was amazed to find that all the local shops that advertise them don’t actually keep any in stock. This included Curry’s.Getting this next day was fastest option.Phone itself is great and smaller than most new phones so fits into your pocket easily.Only downside was battery life was disappointing. If you put it in battery saver mode it’s ok otherwise it doesn’t last a day and I’m not a heavy user."
        },
        {
            "title": "Easy to use and much clearer than my earlier SE. Recommended by teenage grand children!",
            "rating": "5.0 out of 5 stars",
            "body": "Only had phone for a week and so far can find no fault. Used for messages, WhatsApp, emails, phone, banking and other Apps."
        },
        {
            "title": "Broke",
            "rating": "1.0 out of 5 stars",
            "body": "This phone was ‘ flimsy’ from the get go, dodgy buttons that weren’t quite responsive as other phones- then it stopped working completely . Amazon has sent be a return label to fix it but I’ve not had this happen to any other phone. We’ll see if they can fix or replace ??"
        },
        {
            "title": "Replacement for iPhone 7",
            "rating": "5.0 out of 5 stars",
            "body": "I needed to replace my iPhone 7 as they’ve now stopped the updatesThe iPhone SE 2022 looks identical to my iPhone 7 but is 5G and has an a15 bionic chipIt’s a lot faster than my old phone and allowed me to keep the Touch ID function which I prefer to facial recognitionI also like the wireless charging function"
        },
        {
            "title": "I’m loving my new iPhone SE! 📱",
            "rating": "5.0 out of 5 stars",
            "body": "First of all, here’s what you get in the box: 1x iPhone SE (3rd generation 2022), 1x USB-C lightning cable, 1x small tool (for opening SIM card drawer), 1x Apple leaflet.You know, I’m one of those guy’s who is reluctant to let go of something that still functions perfectly well - which was the case when it came my iPhone 5s, which I’d been happily using for over nine years. However, it did eventually have two distinct drawbacks when compared to this 3rd generation iPhone SE in that (a) I couldn’t install the latest version of iOS and (b) that onscreen small keyboard was fiddly to use. So, I decided to treat myself to a suitable iPhone upgrade. All I wanted was an iPhone that was slightly larger than my old one, which incorporated the latest technology, had a very good camera, DID NOT have face recognition, would sync with my iPad, and which had functions that were familiar to me - the iPhone SE ticked all those boxes. I’m a bit of a technophobe, so I initially got myself all worked up and stressed out about setting this new phone up, if you’re of a similar mindset, then please don’t panic because it really is a straight forward process. The Apple website has a quick and easy set-up guide, or you can refer to the many online videos demonstrating how to do so. From the point of taking my IPhone SE out of its box to the stage where I had my new phone working as it should took me in the region of 30 minutes. I’m not going to outline the full procedure for setting this phone up, but based on my experience, I thought I’d highlight a few things for those like me who are upgrading their iPhone. So here goes…Make sure your old and new phone are connected to a power source, and that they’re obviously both switched on. Have the phones sitting side by side, and connected to Wi-Fi and Bluetooth. Follow the instructions on your phone. Have your Apple ID code and your credit card 3-digit security code at hand. Choose how to transfer your data (via iCloud or direct from your old phone - I went for the second option). When transfer process is complete you can take the SIM card out of your old phone and slide it into the new one (this will place your mobile network, your telephone number and your contact numbers within your new phone). I’m well impressed with mine because it’s user-friendly, not too bulky to carry around on my person, takes beautiful photos, and syncs perfectly with my iPad (this is particularly important to me because I need the flexibility of writing/updating my daily notes on either device). Given my positive experiences of using this product, this is a mobile phone I have no hesitation recommending."
        }
    ],
    [
        {
            "title": "Not for me not fit for purpose",
            "rating": "1.0 out of 5 stars",
            "body": "Has not been working properly sent back for repair. Sent back to me saying could not find anything wrong just needed update must think I don’t know that. Tried when sent back to me still same problem when making and receiving calls crackles so sent back again this time for a full refund but heard nothing even though they have received it back no phone and no refund."
        },
        {
            "title": "iPhone XS",
            "rating": "5.0 out of 5 stars",
            "body": "Came next day with prime no hassle and phone perfect"
        },
        {
            "title": "iphone se2022",
            "rating": "5.0 out of 5 stars",
            "body": "good value for the specs in comparison to all other available iphones…"
        },
        {
            "title": "Great phone, volume is great, screen bright, lots of storage, lovely colour.",
            "rating": "5.0 out of 5 stars",
            "body": "I researched lots of iPhones, and decided this was the best one for my needs, with 128gb storage, great volume for listening to music, bright screen, home button, handy size, lovely red colour, had it for couple of months and works perfectly."
        },
        {
            "title": "Fantastic phone",
            "rating": "5.0 out of 5 stars",
            "body": "I had iPhone eight and did not want to go bigger, so when SE came out, I was very pleased.The phone is fast, ideal to put in your handbag or pocket without it sticking out.I would recommend."
        },
        {
            "title": "Good price",
            "rating": "5.0 out of 5 stars",
            "body": "Needed a replacement phone and this ticked all the boxes. Have other Apple products so they compliment each other"
        },
        {
            "title": "Great for my elderly parents",
            "rating": "5.0 out of 5 stars",
            "body": "iPhones are great and simple to useI purchased this for my elderly parents as they have difficulty with the gesture swipes on the newer iPhonesMain difference with the se and other iPhones is the home button which makes their life so much easier for them to use"
        },
        {
            "title": "This is a refurb, be aware - AVOID",
            "rating": "1.0 out of 5 stars",
            "body": "We ordered this phone thinking it was a new phone, it is apparently a refurb and has a restarting issue. Broken and had to get a refund. Awful business"
        }
    ]
]