[
    [
        {
            "title": "Dynamic island ne fonctionne pas.",
            "rating": "3.0 out of 5 stars",
            "body": "Good morningI have some problems with Dynamic islandit does not work.The Pro and Pro Max versions were the first Apple smartphones to feature a new notch called Dynamic Island instead of the familiar \"bangs\". This is a software solution, now part of the UI, but it still works with glitches.It is also reported that when you hold your finger down on Dynamic Island, the clipped area expands but remains empty. Another issue is that Dynamic Island may not respond to touch if no apps are running in the background. Also, not everyone appreciates that the cutout remains visible in screenshots.Thanks in advance.Mr Butot"
        },
        {
            "title": "Phone is excellent",
            "rating": "5.0 out of 5 stars",
            "body": "Phone is great. Only issue I had is needing to order it from Argos as Amazon charged me for a phone but sent me a cheap powerbank which I have returned but need to wait 30 from a refund."
        },
        {
            "title": "Iphone 14 pro",
            "rating": "1.0 out of 5 stars",
            "body": "Wouldn't buy from here again. Phone screen was flickering on and off called them they said can't replace the phone only can repair it. only had the phone for about 4 days so It was under the 14 days return and replace product but they wouldn't let me return it only option I had was to get a brand new phone repaired. So if anyone wants a iPhone best go to apple direct not like these places."
        },
        {
            "title": "G8 phone",
            "rating": "5.0 out of 5 stars",
            "body": "Amazing"
        },
        {
            "title": "No phone in the package",
            "rating": "1.0 out of 5 stars",
            "body": "Package received, opened and no phone. Just the power cord and instructions. Shocked."
        },
        {
            "title": "Brilliant",
            "rating": "5.0 out of 5 stars",
            "body": "Definitely recommend to anyone out there"
        },
        {
            "title": "Better quality than my pixel",
            "rating": "4.0 out of 5 stars",
            "body": "Ok apples and oranges used to be heavy apple user until software update bricked my phone. After going to android for around 8 years now coming back to iOS. I’m finding a few good and a few bad things not with the device just getting used to operating system"
        },
        {
            "title": "0.8 mm",
            "rating": "1.0 out of 5 stars",
            "body": "The iPhone 14 Pro is just 0.8 mm bigger than the 13 Pro.0.8 mm!!!! Just enough to force customers to buy a new case if they upgrade from the 13 to the 14. They will also have to buy a new charger if theirs is not working anymore as Apple doesn't care to supply chargers with its phones anymore.It is bad for the environment. It's bad for customers. Yet , Apple claims that \"Behind every product is a plan for the environment\" .Who they think they are fooling?Well, all the people who rated the phone 5 stars to begin with..."
        }
    ],
    [
        {
            "title": "Brilliant phone",
            "rating": "5.0 out of 5 stars",
            "body": "I love the iPhone 14 pro. It’s so easy to use and the camera is fantastic. It’s not too heavy and dynamic island is an interesting feature. Definitely recommend."
        },
        {
            "title": "Decent upgrade over 12pro",
            "rating": "4.0 out of 5 stars",
            "body": "Think if I had a 13pro I would have been slightly disappointed"
        },
        {
            "title": "On time delivery",
            "rating": "5.0 out of 5 stars",
            "body": "Excellent Product and meet all requirements, best I liked easy monthly payment options, so you no need to pay upfront"
        },
        {
            "title": "Problem",
            "rating": "3.0 out of 5 stars",
            "body": "Problem with ship, but im enjoy…"
        },
        {
            "title": "Great phone.",
            "rating": "4.0 out of 5 stars",
            "body": "Great phone, just wish Apple products were not so expensive."
        },
        {
            "title": "10/10",
            "rating": "5.0 out of 5 stars",
            "body": "10/10"
        },
        {
            "title": "Amazing product.",
            "rating": "5.0 out of 5 stars",
            "body": "I like everything in this brand of smartphone 😍😍😍"
        },
        {
            "title": "Love my iPhone pro",
            "rating": "5.0 out of 5 stars",
            "body": "It was a hassle and a few months before I gotMy iPhone but now that it’s here I truly love it. The camera and new features above the iPhone 13 are really amazing.It operates with high speed and increased efficiency relative to the iPhone 12/13 and so definitely worth the upgrade.Battery life is fairly okay - it’s an iPhone so doesn’t last super long in general but it’s good for an iPhone!Face recognition works as it should and I have no complaints there.The size works well for me, I decided against the pro max as I didn’t want a huge phone but the pro is the perfect size and oh my the colour! The purple is magnificent I adore it!Overall, just get it."
        }
    ]
]