[
    [
        {
            "title": "Works really well for price",
            "rating": "5.0 out of 5 stars",
            "body": "Simple to use, easy to get on with. Found it great for calls messages and steps. Would definitely recommend it to anyone not wanting to fork out on brand names"
        },
        {
            "title": "Just what I wanted without emptying my wallet",
            "rating": "5.0 out of 5 stars",
            "body": "I have wanted a smart watch for a while but could not justify spending out for a fit bit, Apple or similar. When I found this watch I thought it looked really smart and after reading all the information and the reviews I ordered it. I have only had it 5 days and I am delighted. It was easy to download the App and then pair the watch. I only had one slight query and emailed Customer Service who were brilliant and told me what I needed to do. If you want a smart watch but don’t want to spend a lot then go for this one and you wont be disappointed."
        },
        {
            "title": "Great smartwatch",
            "rating": "5.0 out of 5 stars",
            "body": "Does everything I need: answer calls, voice is clear, count my steps and has a clear big screen and the best thing is Alexa"
        },
        {
            "title": "Keeping the momentum going",
            "rating": "5.0 out of 5 stars",
            "body": "I bought this watch as it had everything I needed, Phone , steps, heart rate and much more, it is easy to wear and so easy to read, a very reasonable price as well and can tell you very quickly the results you are looking for. Came neatly packaged was easy to set up and easy to charge. A good buy indeed."
        },
        {
            "title": "Disappointing",
            "rating": "2.0 out of 5 stars",
            "body": "Does not come with a sensible manual. Phone functions/notifications do not work as described"
        },
        {
            "title": "Great product",
            "rating": "5.0 out of 5 stars",
            "body": "Great watch..alexa built in. Well worth the money.answwr calls ."
        },
        {
            "title": "Great watch at an amazing price!",
            "rating": "5.0 out of 5 stars",
            "body": ""
        },
        {
            "title": "My opinion",
            "rating": "5.0 out of 5 stars",
            "body": ""
        }
    ],
    [
        {
            "title": "Impressive",
            "rating": "5.0 out of 5 stars",
            "body": "Very pleased with this watch so far! Easy to set-up and plent of good features for the price."
        },
        {
            "title": "A great buy!!",
            "rating": "5.0 out of 5 stars",
            "body": ""
        },
        {
            "title": "Wow",
            "rating": "5.0 out of 5 stars",
            "body": "Well , what can I say , I've been looking for this type of watch but didn't want the expense , saw the reviews and gave it ago, and must say I can't fault it, I absolutely live it , only thing it doesn't do is Google pay but hey for the price , you xant grumble , now my daughter wants 1 haha 😉"
        },
        {
            "title": "Excellent smart watch",
            "rating": "5.0 out of 5 stars",
            "body": "I decided to change my 5 years old Garmin watch but didn't want to spend hundreds of ££. Bought this and I am very satisfied with it. Looks absolutely beautiful (got lots of compliments), very well made and has got all the features what I need. Arrived very quickly, well packaged, the set up was easy and straightforward, works very well with the app. Phonecalls (in and out) are brilliant (crystal clear sounds). The battery lasts for at least 6 days (I'll review this after few months). Overall I am very happy with my purchase, very good value for the money."
        },
        {
            "title": "Brilliant",
            "rating": "5.0 out of 5 stars",
            "body": "Love it. For the price its excellent"
        },
        {
            "title": "Looks not everything",
            "rating": "2.0 out of 5 stars",
            "body": "Looks nice. Step counter is inaccurate. Can't get alexa to work."
        },
        {
            "title": "Love my new smart watch",
            "rating": "5.0 out of 5 stars",
            "body": "A brilliant replacement for my broken Fitbit. Love so many features including how I can brighten the screen to see it better when outside, the link to Alexa, love the speaker linked to my phone. My mum is hard of hearing and has no issues when I call her via the watch. Step counter is so accurate, love how the food record works and I set the alarm to remind me to drink water and this has really helped me manage that. Honestly have no complaints!"
        },
        {
            "title": "Excellent customer service",
            "rating": "5.0 out of 5 stars",
            "body": "They were swift in resolving my issues and even compensated me for the inconvenience. Will definitely recommend. I will be buying again soon"
        }
    ]
]