[
    [
        {
            "title": "Good",
            "rating": "5.0 out of 5 stars",
            "body": "Love the colour and great for small hands"
        },
        {
            "title": "Vibrant and Reliable Controller for PS4",
            "rating": "5.0 out of 5 stars",
            "body": "I recently picked up the Sony PlayStation DualShock 4 Controller in red, and I have to say, it's been a fantastic addition to my gaming setup. The color is absolutely stunning and really stands out among my other controllers. It's like a cherry on top of my gaming experience!Functionality-wise, this controller is a dream. The buttons and sticks feel responsive and durable, and I haven't experienced any lag or connection issues during my gaming sessions. The touchpad and the built-in speaker are a nice touch too – they add an extra layer of immersion to my games.The battery life is pretty decent, although I've found that it tends to drain a bit faster than my other DualShock 4 controllers. It's not a huge issue, though – just something to keep in mind if you're planning on having marathon gaming sessions. The controller charges quickly, so it's usually not a problem for me.The only real downside I can think of is the price. It's a bit on the expensive side, but I think the quality and performance more than justify it. Plus, the eye-catching red color makes it feel like a special edition or something, which is a nice bonus.Overall, I'm very happy with my purchase of the Sony PlayStation DualShock 4 Controller in red. It's a reliable and stylish controller that has added some extra excitement to my gaming experience. If you're in the market for a new controller, definitely consider picking this one up – you won't be disappointed!"
        },
        {
            "title": "Not working",
            "rating": "1.0 out of 5 stars",
            "body": "We didn't use this controller frequently ,since we didn't have two player game . Now it seems like it's not charging .I thought it's problem with charger.. but no.the same charger is working well with other controller that I have with my PS4. This one doesn't work and I couldn't use. How do return this. ?"
        },
        {
            "title": "Brilliant",
            "rating": "5.0 out of 5 stars",
            "body": "Don't waste your time with unofficial controllers. This is the best. Works exactly as designed. Top price = top quality"
        },
        {
            "title": "Works perfectly",
            "rating": "5.0 out of 5 stars",
            "body": "Works perfectly, has a long battery life, wireless so can play from anywhere, with comfortable buttons and fits perfectly in the hand. Nice vibrant red colour too."
        },
        {
            "title": "R1 not working properly",
            "rating": "1.0 out of 5 stars",
            "body": "If i push the r1 button it stays in which is annoying and make it impossible to play, i get it in a bubble envelope without anything no cable just controller ripped off for money"
        },
        {
            "title": "Bad quality",
            "rating": "1.0 out of 5 stars",
            "body": "D pad down button doesn't work and it has stick drift after not even a month of use. You expect better quality from an official product. I will be returning and not sure what to do about a replacement, can't even trust the official seller."
        },
        {
            "title": "Good remote",
            "rating": "5.0 out of 5 stars",
            "body": "not a lot to say. if you buy a playstation remote you expect good quality and this is just that. lovely feel and good response while playing"
        }
    ],
    [
        {
            "title": "Ps4 controller",
            "rating": "5.0 out of 5 stars",
            "body": "Came in perfect condition uncharged and not used before as should be the box and packaging were both undamaged and makes me feel better because the price was a little expensive"
        },
        {
            "title": "Works fine",
            "rating": "5.0 out of 5 stars",
            "body": "Item worked fine. Fully charged it and it was good to go. Used on Playstation 4"
        },
        {
            "title": "No longer charges",
            "rating": "1.0 out of 5 stars",
            "body": "I got this ages ago and it no longer charges"
        },
        {
            "title": "Exactly the same as the one you broke, probably",
            "rating": "3.0 out of 5 stars",
            "body": "I got this to replace a DualShock 4 Controller that broke. This was, indeed, a DualShock 4 Controller. It worked fine. After a while it, too, will probably break. Then I'll get a new one. And so life goes on.Ideally, though, Sony would get whoever actually makes them to build them in such a way that they break less."
        },
        {
            "title": "Replace this for free surely ??",
            "rating": "1.0 out of 5 stars",
            "body": "Not doing too well as it presses up by itself and drains its own battery doing so 🤯🤯🤯🤯"
        },
        {
            "title": "Awful",
            "rating": "1.0 out of 5 stars",
            "body": "Stickbdrift within a few weeks. Unusable within a few months."
        },
        {
            "title": "Highly recommended",
            "rating": "5.0 out of 5 stars",
            "body": "It works amazingly"
        },
        {
            "title": "As described",
            "rating": "5.0 out of 5 stars",
            "body": "Fast delivery and as described"
        }
    ]
]