[
    [
        {
            "title": "Healthy",
            "rating": "5.0 out of 5 stars",
            "body": "Will never use a chip pan again. Food cooked perfectly. The best thing I cooked in it was a whole chicken. Cooked to perfection I sprayed some olive oil on it & sprinkled with spices…delicious."
        },
        {
            "title": "That it’s easy to use.",
            "rating": "5.0 out of 5 stars",
            "body": "Love this air fryer, so easy to use, easy to clean"
        },
        {
            "title": "Air fryer",
            "rating": "5.0 out of 5 stars",
            "body": "Really good 👍"
        },
        {
            "title": "Brilliant Machine - Huge drawer, easy to use controls",
            "rating": "5.0 out of 5 stars",
            "body": "What can I say about this Air Fryer?? Well I've probably not used half of it's features yet! But it's a great machine. Really easy to clean. Has a huge drawer that can fit in multiple items. Cooks from the top and bottom, so no opening it up and turning stuff around. It's brilliant!"
        },
        {
            "title": "Does exactly what it says on the box?",
            "rating": "5.0 out of 5 stars",
            "body": "This is my go to means of cooking now,being on my own my main oven is virtually redundant?"
        },
        {
            "title": "Good size for 4 portions",
            "rating": "5.0 out of 5 stars",
            "body": "Handy to have the recipe book as guidance to get started. Quick and easy to use."
        },
        {
            "title": "A very useful addition to the kitchen",
            "rating": "4.0 out of 5 stars",
            "body": "I thought long and hard about investing in an air fryer and did a fair amount of research. Based on Which, and family recommendations, I decided to purchase this Cosori air fryer.I have always been a keen cook regularly preparing new dishes and entertaining family and friends. Since the increased cost of electricity it seemed to be the right moment to go ahead and so far I have been very pleased with it. The instructions and recipes are very clear and simplified using it for the first time, but now I am having fun adapting my own recipes I have hardly used my oven for roasting since purchasing the air fryerand feel confident that it will inevitably save us money in the long term. The only reason I havent awarded 5 stars is because I would rather like to have had a griddle incorporated, but other than that, I am well satisfied with the ease of cooking. In addition the lack of many dishes to wash afterwards and the simplicity of cleaning the air fryer components after preparing a meal is a bonus."
        },
        {
            "title": "Fan Failed",
            "rating": "3.0 out of 5 stars",
            "body": "Good for 9 months, then fan motor failed. Now at recyling centre!"
        }
    ],
    [
        {
            "title": "Great product & customer service",
            "rating": "5.0 out of 5 stars",
            "body": "Love this product, so quick & easy to use. Cosori customer service have been great too when I required a replacement part after accidental damage. Would definitely purchase more items from them."
        },
        {
            "title": "An excellent customer service",
            "rating": "5.0 out of 5 stars",
            "body": "I usually do not leave a comment before using the thing for a while and this one is another long-term usage review. My wife loves it so much that she was extremely upset when we encountered an issue. I was amazed by the prompt resolution of our issue by Cosori's customer service. Having support for a product is crucial. Again, thank you very much."
        },
        {
            "title": "Delivery",
            "rating": "5.0 out of 5 stars",
            "body": "Haven’t used my oven since getting this and have cooked lots of different things"
        },
        {
            "title": "Great airfryer",
            "rating": "5.0 out of 5 stars",
            "body": "Have had two airfryers before but this is the best. Had this for quite a while now, does a great job of everything the manufacturer claims it can do."
        },
        {
            "title": "THE best gadget you didn’t know you needed!",
            "rating": "5.0 out of 5 stars",
            "body": "Wow! I’d seen all the hype about airfryers but was worried that it would become a white elephant in the kitchen once the novelty had worn off…how wrong!Since this arrived into my life I have switched my oven on once! Everything I have wanted to cook is quick and easy in the airfryer and smells are mostly contained too! Sausages under the grill with all the smell/smoke/and fat flare ups are a thing of the past. Quick and easy in the airfryer and no mess…hallelujah!! Bacon cooked to perfection 👌Thank you Cosori for revolutionising my cooking and halving my electricity bill 👏👏"
        },
        {
            "title": "ok",
            "rating": "4.0 out of 5 stars",
            "body": "first air fryer and it is a bit too small but would struggle with a heavier one, as I have issues with both wrists. love using the pre heat to reheat burgers etc....so far so good -- takes more space than I thought as it has to be away from the wall --"
        },
        {
            "title": "Very pleased with this",
            "rating": "5.0 out of 5 stars",
            "body": "I've had this around a month now and I'm overall very pleased. I have yet to use all the various functions/presets, but it all seems to work as intended. I think the most remarkable part for me is just how easy it is to clean the basket, it really is a dream."
        },
        {
            "title": "Game changer",
            "rating": "5.0 out of 5 stars",
            "body": "Read lots of reviews before opting for this air fryer. The dual heating elements make all the difference and Cosori customer support is excellent. would definitely recommend."
        }
    ]
]