[
    [
        {
            "title": "It did not measure my steps.",
            "rating": "1.0 out of 5 stars",
            "body": "The product was not fit for purpose, readings were inaccurate."
        },
        {
            "title": "Dead on arrival",
            "rating": "1.0 out of 5 stars",
            "body": "Disappointing."
        },
        {
            "title": "Simple And Effective",
            "rating": "5.0 out of 5 stars",
            "body": "Does exactly what I needed it to do. A good cheap alternative to spending big on an Apple Watch ect. Yes you don’t get all the bells and whistles with this but it does track activity which is all you need really."
        },
        {
            "title": "Lasted 4 months",
            "rating": "1.0 out of 5 stars",
            "body": "Screen came loose and popped off while on my wrist. Potentially fixable but not worthwhile."
        },
        {
            "title": "This is a good watch",
            "rating": "4.0 out of 5 stars",
            "body": "This is a very good watch"
        },
        {
            "title": "Great product for the price",
            "rating": "5.0 out of 5 stars",
            "body": "The battery life is very good and it's a great product for the price"
        },
        {
            "title": "Good",
            "rating": "5.0 out of 5 stars",
            "body": "Easy to use only problem I had was the app but got that sorted"
        },
        {
            "title": "It was great to get the information about my sleep",
            "rating": "5.0 out of 5 stars",
            "body": "Durable battery"
        }
    ],
    [
        {
            "title": "Very nice",
            "rating": "5.0 out of 5 stars",
            "body": "Were bought for a child, band fit nicely on the hand, easy to operate. Recommended"
        },
        {
            "title": "A couple of things I didn't like",
            "rating": "3.0 out of 5 stars",
            "body": "First of all beware, that it does not count overall kcal burnt per 24h, and it only tracks them when you move. description is not very clear stating that.Another thing, I fell asleep for a midday nap.. for an hour, and it failed to track that I was sleeping at all."
        },
        {
            "title": "Great",
            "rating": "5.0 out of 5 stars",
            "body": "Amazing battery and does what it says. Very good product for the price. I love it."
        },
        {
            "title": "Great piece of kit",
            "rating": "5.0 out of 5 stars",
            "body": "Perfect size not too bulky. Good screen display and for the money what's not to like👍"
        },
        {
            "title": "The band has a short life",
            "rating": "3.0 out of 5 stars",
            "body": "Love the watch, disappointed with the band - cracked and the loop splits. See photo"
        },
        {
            "title": "great",
            "rating": "5.0 out of 5 stars",
            "body": "watch excellent value for money"
        },
        {
            "title": "Nice gift with good battery",
            "rating": "5.0 out of 5 stars",
            "body": "Display OK,readable little small but you can always go with 6 if 5 is to small for you.Battery is up from 10 days.Easy to wear all the time."
        },
        {
            "title": "Fantastic fitness tracker for a great price",
            "rating": "5.0 out of 5 stars",
            "body": "When my old tracker gave up, I was looking for a new one that would be reputable but not make me go bankrupt - I do a high-contact sport and sometimes the trackers just break down in a sudden and brutal manner. ;) After plenty of research, I decided to go with the Mi Band.First impressions - lovely packed, and the watch just feels nice regarding the quality of materials and dial proportions. The band fastening system is very handy and no need to worry it will suddenly come loose in the middle of training. Charging is lightning-fast (the magnetic charging port is so convenient compared to the trackers charging via the USB!) and the battery lasts for ages.It's surprisingly accurate - out of sheer curiosity I tested it when also being rigged to the heart monitor. ;) If you use the PAI, it vibrates when you hit the milestone, which is a nice, rewarding tidbit. Lots of workout types to chose from, the walking / running modes also have a great feature - when you're waiting at the stop lights, the workout pauses itself and then resumes when you move again.Highly water-resistant.Very easy to connect to the phone and GPS, albeit sometimes it doesn't \"catch\" elevation changes for some reason (but I'd blame it more on hiking through the spots without cell phone coverage). You can also use it with apps other than the dedicated one - it's always nice to have some choice.My only complaint is that the touch screen is a bit TOO sensitive - training gloves or even heavy rainfall can pause your workout without you noticing, or mess with some settings. It would be nice to have some sort of a lock / unlock screen feature to aid that.Overally though - a great budget fitness tracker!"
        }
    ]
]