[
    [
        {
            "title": "Meh",
            "rating": "3.0 out of 5 stars",
            "body": "It’s very hard to get your head around for people who have never built a pc before"
        },
        {
            "title": "contents missing",
            "rating": "1.0 out of 5 stars",
            "body": "Arrived without the installation booklet and driver disc ?"
        },
        {
            "title": "it is alive",
            "rating": "5.0 out of 5 stars",
            "body": "Ryzen 5 5600 - no need to update bios"
        },
        {
            "title": "They’ve done it again",
            "rating": "5.0 out of 5 stars",
            "body": "One of the best b550s to build with has amazing layout with great vrms"
        },
        {
            "title": "Just amazing",
            "rating": "5.0 out of 5 stars",
            "body": "It works really well, perfect for my RTX 2060 + Ryzen 5 4600g!"
        },
        {
            "title": "Faulty part",
            "rating": "1.0 out of 5 stars",
            "body": "Part came faulty , I got this as a Christmas present and only got around to fitting it now and it's faulty, led and fan headers don't work and I can't get a display output. Brought it to a local pc shop and they confirmed it was the motherboard! I'm gone over my refund period too so not happy at all !"
        },
        {
            "title": "very good",
            "rating": "5.0 out of 5 stars",
            "body": "easy install works great"
        },
        {
            "title": "new to pc and think i have bought a motherboard that doesnt work",
            "rating": "1.0 out of 5 stars",
            "body": "i was wondering if this motherboard is compatable to run memory speed of 3600"
        }
    ],
    [
        {
            "title": "Very satisfied",
            "rating": "5.0 out of 5 stars",
            "body": "Thankfully the board supported Ryzen 5 5600 straight out of the box with no bios update required. Small sticker on the bottom specified 5000 series ready. I'd guess most of the boards have been updated for 5000 series CPUs at this point now so if you get one that isn't I'd imagine it would be older stock. So keep that in mind as there's a lot of boards that require updates if you want to run 5000 CPUs. Overall great board had no real issues I'll definitely get gigabyte boards again. Very happy"
        },
        {
            "title": "Great.",
            "rating": "5.0 out of 5 stars",
            "body": "Performs well and easy to install."
        },
        {
            "title": "Great",
            "rating": "5.0 out of 5 stars",
            "body": "Fast delivery, item as described"
        },
        {
            "title": "Brilliant Motherboard",
            "rating": "5.0 out of 5 stars",
            "body": "Great motherboard for my Ryzen 3600, worked perfectly out of the box. Even came preloaded with Bios F14 which means it hasn't been sat on a shelf for months, its almost fresh from the factory. Very Happy, especially for £108! What a bargin!"
        },
        {
            "title": "Dead on arrival",
            "rating": "2.0 out of 5 stars",
            "body": "I ended up getting one of the few bad boards that was dead on arrival I will be buying a replacement board from the same seller and will revise my review accordingly"
        },
        {
            "title": "Very easy to install.",
            "rating": "5.0 out of 5 stars",
            "body": "The thing I love about this it has only 8 screws which you need to unscrew and then screw back which holds the motherboard in place and everything is very easy to do."
        },
        {
            "title": "Good outta the box for 5600x",
            "rating": "5.0 out of 5 stars",
            "body": "Works fine, came with 5600x compatible bios. I aslo bought patriot viper steel 2x8gb 3600mhz ram but I can't get it to boot in xmp just black screens requiring me to remove the cmos to get it to boot again. The ram is on the qvl aswel. Works fine with my older patriot viper 3000mhz kit xmp"
        },
        {
            "title": "Software Sucks",
            "rating": "4.0 out of 5 stars",
            "body": ""
        }
    ]
]