[
    [
        {
            "title": "Androids everybody loves good androids...",
            "rating": "5.0 out of 5 stars",
            "body": "wow this phone has got me out of so many problems since i had it, i actually use all its features, Directions feature is amazing seeing your route as a little car while you move, helped us get unlost a lot, screen is beautiful, camaera is good, everyone else is amazed but quality of quick sanps editing software options are cool. This phone helped me catch up with phone culture without any learning or effeort. i really can do things that anyone without a pixel 7 cant. ha ha ha."
        },
        {
            "title": "Just ripped off the screen protector",
            "rating": "1.0 out of 5 stars",
            "body": "I have just ripped off my screen protector because the screen is so unresponsive.I am in my mother's lounge and I have just reverted to my other phone because the reception / internet is so bad. I realise that could be a problem with the provider.It was getting warm. I have rarely experienced this with any other phone."
        },
        {
            "title": "Amazing phone!",
            "rating": "5.0 out of 5 stars",
            "body": "This is my first Google phone as i have previously had iPhones and Samsung phones so i was a bit worried about switching to a brand i knew little about. This phone is amazing! The camera is the best i have seen so far and the battery life is 5 hours longer than my previous Samsung S22. This phone is a bargain compared to the iphones and Samsungs."
        },
        {
            "title": "Bought the like new version",
            "rating": "5.0 out of 5 stars",
            "body": "Google Pixel 7 has an amazing camera, the best I've seen on a phone.Battery is fantastic but it takes hours and I'm talking around 3 hours for the phone to charge.The software is really good and responsive with all apps and it's impressive.You do not get a charger in the box. Only a wire to do the transfer of everything from your old phone, which I recommend as it's 4 times faster than using Bluetooth.The fingerprint scanner is on the screen and its performance is mediocre at best. It reads the print 1 out of every 3/4 times on average.You get all your usual apps that are great.The calling performance is good like most phones at this price point.The absolute shining light of this phone is the camera and that's the main reason you would purchase it. It's fantastic."
        },
        {
            "title": "Could of great if it didn't use the useless tensor 2 chip",
            "rating": "2.0 out of 5 stars",
            "body": "This phone could be brilliant but mine overheated or got really hot when just playing music while in my pocket. I later found out if you don't use the Google themes that's change the look of the icons ect ... it's less warm when in use. The standard looking android software works more efficiently. This also effected battery life a lot ,only having 9 hours use (i.e ,music with Bluetooth earphones and the odd interneting).The tensor2 chip isn't good either. It doesnt compete with the snapdragon chips that are in most phones nowadays. Also the screen in direct sunlight was quite hard to see . It's strange as the ranges off brightness are good statwise.Camera is decent and the build quality is nice but that's about it .A massive disappointment"
        },
        {
            "title": "Great phone but has drawbacks.",
            "rating": "5.0 out of 5 stars",
            "body": "Took me a while to get used to it but now I wouldn't be without it. The biggest problem is that you don't get a charging cable or charger, no instructions either. 5g is a great addition especially when using the hotspot function."
        },
        {
            "title": "Great device and battery life",
            "rating": "5.0 out of 5 stars",
            "body": "Having to update my phone recently I looked at a few devices but I am so pleased I choose the Google pixel .Fantastic camera quality for great pictures , I like taken snaps and saves carrying the camera around .Battery life was a must as my old phone a Motorola could easily withstand the likes of the well known brands and put them to shame . I have just tried it out on my pixel and got a full day and more without having to charge up . The only downside for me was the charger plug as one wasn't provided but found one online no problem and scrolling back if you come from a phone that has a button like my old one did . To take you back it takes you a little to get use to .All in all I'm so happy with my pixel device and definitely recommend if your looking for a phone that looks stylish sleek and compete to the most well known brands on the market"
        },
        {
            "title": "Brings the Fun back to Phones",
            "rating": "4.0 out of 5 stars",
            "body": "As soon as you boot up the Pixel 7 you can feel the quality of it, from the keyboard to the camera. The phone has been designed with lots of fun little quirks which vary from the usual standard fare you get from the homogeneity of smartphones these days. The camera is as good as advertised and takes crystal clear pictures with plenty of functionality for more advanced video and picture taking. I've really enjoyed using the Pixel 7 after moving over from my OnePlus 6.I deduct a star from my rating due to 2 reasons. The first being that the battery life I have found to be rather disappointing for a new phone. It will easily get you through the day if not overtaxed, but struggles if gaming, playing music via Bluetooth headphones or extensively using Google maps. No fast charge adaptability also seems like a strange omission in these days.My second issue is the fingerprint scanner which is very unreliable. I've added the thumbprint in with 3 different versions and the phone still fails to pick it up a lot of the time. Compared to the OnePlus 6 fingerprint scanner on the back of the phone which always picked up my fingerprint, this has been pretty disappointing."
        }
    ],
    [
        {
            "title": "Regret buying it",
            "rating": "2.0 out of 5 stars",
            "body": "The camera is the best one I have seen on a phone. The night pictures are amazing (thanks to the software enhancements). Other than most of the other features are disappointing. While some are very user friendly others are nightmare to deal with. The fingerprint scanner is slow and doesn't work well when too much sunlight. I often end up having to use the pattern to unlock the phone.Turns out lots of the pixels are having serious battery problems. Support are nice but after speaking to them you get a refurbished replacement."
        },
        {
            "title": "Very disappointing even at the sale price.",
            "rating": "2.0 out of 5 stars",
            "body": "Battery life is awful. Signal strength is awful. WiFi antenna is awful. Fingerprint scanner is hit and miss.Positives are the wireless charging, the fantastic camera (that I don't really use all that much) and the screen seems very nice.I'll be returning to the cheaper Chinese phones for my next phone as I genuinely preferred my OnePlus 7t but it unfortunately developed a charging fault"
        },
        {
            "title": "Excellence",
            "rating": "5.0 out of 5 stars",
            "body": "Firstly,premium feel,great sound from 2speakers great quality cameras ,back and front ,easy setup transferring data from iPhone took 40 minutes that’s 90 GB of music plus 500 MB photos and all contacts,and immediately sorted out duplicates,this is definitely the best android phone I’ve ever used, I’m an Apple person,but this phone is a dream superior call quality thanks to the 3G,option,if you want a great phone for 50% less than Apple iPhone go out and buy one,you won’t regret it.5 stars honestly."
        },
        {
            "title": "Biometric does not work",
            "rating": "1.0 out of 5 stars",
            "body": "Known issue in pixel 7. For heavy usage with work apps that need fingerprint or face scan for access, this is not the right phone. You'll have to enter your pin manually each time. Returned!"
        },
        {
            "title": "Very good phone!",
            "rating": "5.0 out of 5 stars",
            "body": "Very impressed with the Google Pixel 7. Excellent camera and cool features, much better value than those new iPhones!"
        },
        {
            "title": "Good phone",
            "rating": "4.0 out of 5 stars",
            "body": "I like this phone. Wery good cameras, working fast and without issue. But if you want to use phone all day. You need by power bank because battery in this phone wery weak."
        },
        {
            "title": "Great.",
            "rating": "5.0 out of 5 stars",
            "body": "Great."
        },
        {
            "title": "Fingerprint scanner is horrible and just normal battery.",
            "rating": "3.0 out of 5 stars",
            "body": "The camera is good but the finger print sensor rarely works. The battery life doesn't last whole day you will need to charge it around in the evening if you use social media. There are a few bugs as well in the software side"
        }
    ]
]