[
    [
        {
            "title": "Such an epic camera",
            "rating": "5.0 out of 5 stars",
            "body": "The G9 has been a revelation. I bought it as a cheaper way into birding photography. Used with the Panasonic 100-300 II. Absolutely stunning. Then decided to try the G9 for more things. So bought the 12-60 for landscapes, using the 100-300 for tighter crops. Absolutely love it for landscapes. The high Res mode works well for 40mp and 80mp images. Added the Olympus 45mm for portraits. And the Panasonic 20mm II for street and general walk about photography. Stopped using my Sony A7R II, just enjoy using the Panasonic system far more.Worth noting that the G9 is not a small camera. Quite a bit larger than the A7 body. But the G9 is perfect in the hand. With epic controls, stunning EVF, great LCD, awesome stabilisation. Knocks spots of the Sony."
        },
        {
            "title": "Excellent camera",
            "rating": "5.0 out of 5 stars",
            "body": "Bought this as a second camera to go alongside my GH5 but I find this is so good for stills it's become my primary photo camera. Video features are excellent too"
        },
        {
            "title": "I love it so much",
            "rating": "5.0 out of 5 stars",
            "body": "It’s probably not healthy to love a device as much as I love this camera right now! I have owned a handful of pro and semi-pro Canons over the years and still have a 5D in my possession. If all you care about is still image quality maybe your money is better spent on a used 5D with a 24-105L (though the Panny has a bigger dynamic range, more megapix, marginally better high ISO, not to mention lighter, the still images from the canon are so natural and beautiful, it’s not incomparable but the canon takes consistently more beautiful pictures so far, it’s a classic magical combination) but if you care about video or ergonomics at all, the Panny will blow your mind. The images are good enough, not sure I’ll sell the 5D ever but the Lumix photos are good enough considering everything else you get. With the EF Speedbooster I can use my existing Canon lenses at roughly the same focal length and aperture as I’m used to which further blurs any difference between the two systems. The ergonomics are a revelation - I have set it up so that in full manual mode I have literally everything I want right under my fingertips. Every time I learn something else you can do I am just squealing with glee - this evening I figured out how to set the manual white balance on the dial buttons which gives you manual WB with two quick presses of the same button - so awesome! And the video - I recommend you do budget the extra for the VLOG-L upgrade, the waveform is worth it alone IMO - 150MB 4k 10 bit 4:2:2 MOV files… it’s just an incredible machine. I love it more every time I use it! If I have any criticism at all, and I know it’s the way these cameras are and makes the video and a lot of other features possible (zebras, waveform, focus peaking, focus assist and everything, all super useful things that are probably worth the trade-off), but I still prefer a real glass viewfinder. My ideal would be this back panel with a real glass viewfinder. Out in the snow the other day the viewfinder wasn’t rendering the image well, very flat and lifeless in the contrasty situation, not showing the golden light riding across the snow contours at all where the Canon of course was showing me exactly what my eyes could see. But the metering is accurate and the photos come out looking good, it’s just the live viewfinder is a bit flat."
        },
        {
            "title": "feature packed camera, beautifully engineered, huge variety of compatible lenses",
            "rating": "5.0 out of 5 stars",
            "body": "This is my 4th Micro4/3rds camera (GF5 (backup body), G5 (now my daughter's), G6 (now surplus)) in quite a few years. I also have a variety of lenses from 3D (rubbish!), macro, superzoom and tele, so you can tell I'm a fan.The G9 is definitely the best yet, but will take some learning. Luckily there's a great Lumix USA youtube channel covering all the key features and demonstrates them in use.The only feature is lacks is integrated flash, but the ones on my G5 ad G6 weren't that great, they cause red-eye and are eclipsed by any larger lens."
        },
        {
            "title": ".",
            "rating": "5.0 out of 5 stars",
            "body": "Great product, having used Panasonic previously I found the upgrade easier than I thought.Overall good performance straight from the box. Highly recommend"
        },
        {
            "title": "My 2nd G9",
            "rating": "5.0 out of 5 stars",
            "body": "I have been using lumix cameras for a long time and love them. I had one G9 but more than one lens so for ease I bought a 2nd G9 so the two lens I use the most are on my cameras ready to shoot"
        },
        {
            "title": "Great Camera",
            "rating": "5.0 out of 5 stars",
            "body": "Bought this as the other models on the market now are more aimed at V-Blogging and I wanted something that would specialise in stills. It's got so many features, including video, that it would take me all year to try them and review them but it's a lovely camera and dies take the most amazing stills. It's well thought out to the point of being a little too well thought out. They could get rid of some of the buttons and just have a toggle switch which would tidy the job up.Seller delivered almost a week early so very pleased with that. The only down side to the camera is the price as with all cameras and things to do with cameras they are expensive."
        },
        {
            "title": "Nice camera to start doing more videos without investing too much",
            "rating": "5.0 out of 5 stars",
            "body": "Got this after checking different options. Love the easy buttons to use and the menu is very friendly. Im a Canon user but wanted a more accesible (prize wise) camera to start doing more videos for my clients. Very happy so far :D"
        }
    ],
    [
        {
            "title": "Best camera I have used",
            "rating": "5.0 out of 5 stars",
            "body": "Forget its ability to let you set several instant personal program modes. Forget the easily to use lumix lenses of high quality. Just look at the images and for the PRICE find better.Face and eye recognition are almost perfect.Nikon, Canon and Sony are good certainly but at what price."
        },
        {
            "title": "Would buy again",
            "rating": "5.0 out of 5 stars",
            "body": "Excellent camera would highly recommend"
        },
        {
            "title": "Great camera for the price",
            "rating": "5.0 out of 5 stars",
            "body": "The G9 is a big improvement over its predecessor the G8. I use it for wildlife photography to a large extent and the lack of delay, great focusing and excellent stabilisation features provide some good shots when coupled with the Lumix 100 - 400mm lens. I highly recommend."
        },
        {
            "title": "Great camera, especially with a Warehouse deal",
            "rating": "5.0 out of 5 stars",
            "body": "We bought this from Amazon Warehouse for about 60% of the current full price, and the quality is fantastic. Coming from Olympus OM-D EM5 (Mark 1), the image and video quality of the G9 is a step up. It's quite a large body, but the grip makes it easier to handle. Autofocus is much faster, and improved a lot more when we updated the firmware. It's interesting to compare this to my phone camera. It still doesn't do as well in low light as my Pixel, due to the processing that phones use. But if you're shooting with good lighting, the results are much better."
        },
        {
            "title": "Fantastic camera.",
            "rating": "5.0 out of 5 stars",
            "body": "A really great camera, I'm new to photography and able to use its function's well, great pictures, and a lot of lens available."
        },
        {
            "title": "I'm not an expert but I appreciate class",
            "rating": "5.0 out of 5 stars",
            "body": "Great camera. I have used Sony and fujifilms before but this tops them all in both picture quality and build.I think Panasonic Lumix is very understated and surprised they are not used by more professional photographers. I have even used some Leicas in the past but this was better."
        },
        {
            "title": "Great intuitive camera",
            "rating": "5.0 out of 5 stars",
            "body": "Although this camera is quite large for M43, in fact larger than some FF camera bodies, it never feels cumbersome, and it's ergonomics are second to none! It's a real shame that other camera manufacturers don't put the same effort into ergonomics that Panasonic do. The tactile controls and the simple UI make driving this camera an absolute pleasure.The bundled Leica 12-60 is also a great optic and has pretty much replaced my Lumix 14-140 as my all rounder lens, working great for landscape, street, and portrait photography.I regularly use the camera body with larger tele lenses of the M43 catalogue and the balance that it offers with them is fantastic. I would say if you err on the side of smaller lenses there are probably better options, but for my wildlife and travel photography, this really is a Goldilocks camera/system, a powerhouse of a body, combined with a great catalogue of comparatively small, light and affordable lenses.In summary this is a great camera, sure it won't be the answer for everyone, but I think every system is about compromise. For me this ticks the boxes for usability, affordability and image quality."
        },
        {
            "title": "Worth the money",
            "rating": "5.0 out of 5 stars",
            "body": "Not sure why I have to rate it by warmth and thickness, but this is a very fast, highly adaptable camera. Loads of functions, superb image quality. Good autofocus. I bought this after years of having a G3 which was very slow with an erratic autofocus, but I had lots of M4/3 lenses I didn't want to get rid of. This has given me hopefully years more M4/3 use"
        }
    ],
    [
        {
            "title": "Superb camera for photo and video",
            "rating": "5.0 out of 5 stars",
            "body": "What to say... I shoot mainly photos, but some video. I have a Panasonic G7 and GX80 and a small collection of lenses, and I was looking to upgrade the G7 to a beefier dslr style camera. Both are great cameras in their own right, but in particular the G7 was missing a few features I wanted, such as in-body stabilisation. I always worried whether the G9 was more camera (and money) than I needed. I agonised for ages whether to go for the G9 or the G90 which has some great video features. I even considered the Nikon Z50, as I have had, and loved, a Nikon in the past So this came up on a special and I took the plunge.I really regret not having jumped at it before. It takes everything up a notch. Higher resolution, better colour science, faster everything. It's photo focused, but has nearly the same video capability of the GH5. It's a wonderful camera to use, and feels great in the hand. It's so customisable, I'm still trying to work it all out. I won't list the specs, as if you're looking at this camera you'll do your own research, but it is loaded with pretty much everything you could need, and will perform excellently in anything but extreme low light, and even then it does pretty good. Battery life is very good.I'm keeping the GX80 as a pocketable solution, but the G7 will be finding a new home..."
        },
        {
            "title": "Absolutely Beast of a Camera",
            "rating": "5.0 out of 5 stars",
            "body": "Although I have returned my G9 due to finical reasons, this camera when I tested it out was incredible and well worth the price even brand new. If you can get it used even better, but it’s still a massive bargain for £899.99. 10Bit 4K24p Looks beautiful 😍 and the 4K 60fps is a slow motion beast. So much accessibility aswell with putting on monitors or microphones etc, you could even put an atmos ninja on there and get 10bit 4K60p if you wanted to"
        },
        {
            "title": "Great feature and very good in camera stabilization.",
            "rating": "5.0 out of 5 stars",
            "body": "MFT also has a fantastic and wide array of lens choices. If you can't get results with this camera body..."
        },
        {
            "title": "Great camera",
            "rating": "5.0 out of 5 stars",
            "body": "Great camera good quality pictures and video in normal conditions. Video can be a bit less sharp in low light conditions, best to not use higher than ISO 1600 in low light video shooting to get maximum video quality"
        },
        {
            "title": "Fantasic camera & lens combo.",
            "rating": "5.0 out of 5 stars",
            "body": "This is a terrific m43 camera, my first one. I have a canon 700d dslr which I love. It's a mid range beginner/enthusiast camera. but the downside for me is the ttl viewfinder does not give you a lot of information and you rely on going backwards and forwards to the monitor display. The evf on the g9 is excellent (evfs have come a long way). You get to set information displayed how you like it. And once taking photos, you can review in the evf so saving battery juice. The supplied battery is pretty good, but once I start to use camera for longer periods (I've only had it for about a week). I will get some more. There are so many features on the camera, It can be daunting, and It will take me a while to start getting the best out of the camera and lens. But as it's digital and the beauty of the digital age we live in, you can go out for a few hours and test out a few scenarios, and any duff shots ( and I will take a few of them for a while!). you just delete them and try again. I've installed the latest firmware which has added a few more features to enhance camera functions even more, and for a two year old model, It's still one of the best and still comes highly recommended from a lot of serious photographers who make a living out of taking photos. and the best thing I like about the g9 is while your learning about the camera, is the i.a. modes are really good, much improved over the years. So if your out for a day and not quite confident enough to delve into the p.a.s.m. modes, don't be embarrassed to use i.a. or i.a.+, just shoot in raw and you can tweak shots in your photo editor software (I use gimp). And I should also mention you can shoot excellent video with the g9. There are many tutorial videos on you tube for the g9 to help you learn and use g9 and get the best out of it. I'm very happy with camera, and I can recommend it with out hesitation."
        },
        {
            "title": "Shutter is far too sensitive.",
            "rating": "3.0 out of 5 stars",
            "body": "This is a heavy camera for what it is although it does produce some nice sharp colourful images especially with the 100-400 lens.Unfortunately several shots are lost simply because the shutter button if far too sensitive and will fire the camera at the slightest touch. Not easy to focus the camera without firing it.Panasonic need to address this problem on the G9 and future models. My GH4 and GH5 are far better in this respect."
        },
        {
            "title": "Love this camera",
            "rating": "5.0 out of 5 stars",
            "body": "I bought it for wildlife photography and it's amazing, so pleased."
        }
    ],
    [
        {
            "title": "Excellent camera for stills and video",
            "rating": "5.0 out of 5 stars",
            "body": "Very extensive menu, it will take a while to work your way through it. The Leica 12/60 lens is superb and it's worth investing in the battery grip which make it much more comfortable to hold and double your shooting time. Youtube tutorials are well worth a look too."
        },
        {
            "title": "Excellent step from my GX8",
            "rating": "5.0 out of 5 stars",
            "body": "I loved my GX8, however the new features of the G9 plus the improved video performance with Panasonic’s latest firmware update now provides a very high end product."
        },
        {
            "title": "Great pro camera in smaller size.",
            "rating": "5.0 out of 5 stars",
            "body": "Brilliant product, a perfect piece of kit for enthusiasts and professionals"
        },
        {
            "title": "Improved images with Panasonic G9",
            "rating": "5.0 out of 5 stars",
            "body": "I delayed buying this camera because I thought that it might be too heavy for regular use but in the event my fears were unfounded. The camera handles very well & produces good pictures.I would have preferred a tilt LCD rather than the side opening LCD but this has the virtue of being able to be reversed to fully protect the glass surface from possible damage in a camera bag. The camera is more stable & comfortable to use with larger lenses."
        },
        {
            "title": "Just brilliant",
            "rating": "5.0 out of 5 stars",
            "body": "If you’ve done enough research you’ll already know this is just brilliant. With the firmware upgrade it’s amazing for video, if you work in 10 minute edits."
        },
        {
            "title": "Is it the ultimate camera? (Firmware 2.0)",
            "rating": "5.0 out of 5 stars",
            "body": "I'm going to compare my new G9 against my shortly owned Fujifilm X-T3 and X-T30. If you're in the business for a compact setup for enthusiast photography, those 3 will certainly be on your list. I'm skipping the Sony A6x00, simply because they have horrible ergonomics and only stand out in the autofocus department. The A6600 is particularly overpriced for that matter...Body:To put it mildly, the Fujis bodies are horrible: the grip is tiny, the ISO and Shutter speed dials have to be operated with your eye away from the viewfinder, the exposure compensation dial is hard to rotate on both the X-T3 and the X-T30. I did find the X-T30 actually easier to hold, especially when coupled to a light 18-55 kit lens, as I found myself holding it just fine with 2 fingers on the grip. The X-T3 was another story, with the pinky not being able to grab onto the body, and when used with a heavier lens like the 16-80 or the 16-55, it becomes ridiculously front-heavy and totally uncomfortable. All in all, the Fujis are just a rounded box: it's compact, but not comfortable to hold for several hours out and about, and buttons simply don't fall right under your fingers. Another problem: whenever I pick up either of the Fujis, I often end up rotating dials and pressing buttons by mistake, simply because they're either located in odd places (X-T3/30) or because the dials are too easily rotated (X-T30).Now, the Panasonic: I'd say it's a dream to hold thanks to its deep grip and little ridge for the fingers. The shutter, the joystick, the several dials are easy to access, easy to rotate, even with gloves. The only downside would be that the joystick can only do up, down, left and right, it can't go diagonally. It adds a few more steps to set the autofocus area.On top of this, you get weather sealing (like on the X-T3), it's built like a tank and should last forever, unlike the X-T30 thas feels cheap, with buttons and dials that don't inspire confidence. Finally, the flippy screen on the G9 is certainly a massive advantage over the clunky system on the Fujis.Another negative for the G9 would be that the function buttons feel a bit mushy: this might be just due to the weather sealing, making them more rubbery. However, the X-T3 is weather-sealed and does have nicer clicky buttons.The shutter release button feels radically different on the Fujis and the G9: the Fujis have a hard click, and the Panasonic has a very soft shutter. I like both. There is no doubt that the very light shutter of the G9 can be a joy in low light to avoid any unwanted camera shake, yet you'll certainly often find yourself taking many photos inadvertently...Menus:I didn't like the Fujis menus, I found them a bit ambiguous with subcategories (with a dedicated marker on the left tabs), but also sub-pages sometimes that are not identified in a similar way (rather with an X/Y page system). I did really like the Q-menu however, a very quick way to put loads of controls in a simple and quick grid. That system is especially important on the X-T30 because it has fewer dials and buttons, however, the Q-Menu button can be touched by mistake, especially when grabbing the camera. The G9 also has a quick menu, fully customizable, but fewer controls can be crammed into the monitor at once. I must admit I just need quick access to the AF styles and metering.A great thing about the Panasonic is that it remembers absolutely everything when shut down and restarted, even the previous position of the AF box.Image quality and AF:I did test the X-T30 18-55 vs the G9 with Leica 12-60 and on my handheld test, the G9 was noticeably sharper and had a nicer noise reproduction than the X-T30. I did, however, limit the max ISO to 1600! I'm aware the Fuji sensor is supposed to have less noise at higher ISO, but I simply wanted to compare both cameras at the same ISO.The Fuji also gave less details in low light areas, with a very blotchy/smudged look, whereas the G9 had a noisier yet more detailed look. Does it come down to the lens? I do not know: the Fujinon 18-55 is considered to be a great kit lens, and the Leica 12-60 too. All in all, I wasn't that impressed with the Fuji sensor, I would have expected a clear advantage, but my test, at similar ISO, favored the G9. The G9 did have a slightly lower shutter speed in those tests, however. And speaking of shutter speed, I must say the image stabilization with the G9+Leica 12-60 is absolutely phenomenal: in theory 6.5 stops! I was able to get sharp images at 60mm (120mm equivalent on full-frame) at 1 sec of exposure. I even manage a few sharp 1.4s shots at wider angles. On the other hand, the Fuji 18-55 would give up quickly beyond half a second. I did also test the 16-80 on the X-T3 and this was actually a great performer: 1 sec was achievable at times, however, remember it is only an f/4 lens! Another issue is that because these 2 Fuj bodies don't have IBIS, you'll certainly be more limited than with a G9 in low light, with a similar fast prime. Indeed, a non-stabilized Fuji system with a non-stabilized f/1.4 lens will require a much faster shutter speed than a G9 with a similar lens, when handheld! This allows the G9 to keep a lower ISO in low light and bypass the whole \"Micro 4/3 are bad in low light\" polemic.Regarding the AF, I noticed the X-T30 would sometimes struggle on very low contrast areas, in a similar way to the G9, especially in low light, so I was a bit disappointed given it's a phase-detect AF system. Other than this, I couldn't fault either system for stills. The G9 also just got machine-learning AF (face detect, but also animals) and it works great: I was able to track fish in a little pond! It also works on horses and sheep.So yes, the Fujis have great film simulations, however, I found the G9 produces great Jpegs too (I would stick to the Natural profile) and the Cinelike-D profile is the perfect starting point for grading your RAWs (and also reducing clamping in JPEGs).Video:I don't shoot videos, so I cannot comment. But you should know that the latest firmware v2.0 for the G9 basically attempts to bridge the gap with the amazing GH5, with a few limitations like short recording time and the omission of 1080 24p (4K 24p is there though). I read the Fujis should be better for videos due to their phase-detect AF system, however. The Panas surely have the reputation to not be great for video footage, due to hunting issues (however a lot seems to be related to the lens used). Nonetheless, the latest firmware update for the G9 does reduce the hunting a bit. The big problem is that the YouTubers out there do rely a lot on an AF system that can track them, so they're totally biased. And same goes for the flippy screen: as a photographer, I don't really care about being able to flip the screen forward, because I'm always behind the camera; that's why Fuji bodies are often marked down, because their screen doesn't flip forward. For many video shoots not involving people tracking, you'll most likely manual focus and therefore totally avoid this hunting issue on the Panasonic bodies.Value for Money:The G9 was initially launched above £2000 with the Leica lens, and I got mine for £1200, I must say it's an absolute steal compared to the X-T30 that is currently roughly at £1100 and the X-T3 at £1500 or more depending on the lens. The Fujis do have some cashback offers at the moment though (until early Jan 2020), so you can probably shave 100 quid or more from the Amazon price. Still, the G9 offers all you could want in a great still camera:- total weather sealing when combined with the Leica 12-60 (and the new Leica 25mm f/1.4 II) and top construction overall- the absolute best EVF in this category: detailed, 120fps, and absolutely huge- amazing, probably the best, ergonomics for crop sensors- great weight/performance ratio- 2 memory card slots (ultra-high speed)- 6k mode with pre-buffering- massive catalog of lenses (all Leica lenses are top-notch, Olympus lenses are great, most Panasonic are fine, and the new Sigma DC DN are excellent too)- heavily discounted at the momentThe only caveat would be: is the G9 too big for you? in that case, the X-T30 is great, or why not a GX9 or an OMD-EM5?And finally, the ultimate myth: is the Micro Four Third format dead? obviously, not: Olympus just released the OMD-EM5 Mark III (a decent camera) and more lenses are coming to the catalog as well. I wouldn't be surprised if Oly and Pana announce a new higher megapixel sensor in 2020. Though, is it really needed, if it doesn't improve low light performance?TLDR: go buy the G9, if you're an enthusiast and shoot stills mainly (but don't mind having great video features too), and upgrade to the latest firmware!"
        },
        {
            "title": "Quite possibly the best value, most versatile, best camera on the market today...",
            "rating": "5.0 out of 5 stars",
            "body": "Firstly, to get it out the way, some photographers do need a larger sensor, for ultimate image quality or very low light work. But I think for a huge number of photographers, the Lumix G9 and the MicroFourThirds system is the very best way to go.The Lumix G9 is a vastly capable camera, hugely versatile (especially with the latest, free, v2.0 firmware upgrade). The image quality is outstanding (anyone who doesn't get sharp photos, see previous review, is really getting their own technique all wrong!). I use the G9 professionally, alongside full frame and crop sensor DSLRs, and there is very little real world difference in image quality for my work which is published in magazines. I've shot sport, and cropped into the image, for newspapers, and the sharpness is still great.The killer point about MFT kit, like the G9, is the huge reduction in size and weight of the gear, which makes using the G9 a real pleasure (anyone who yearns for a couple of pro DSLRs and 'big' lenses is more than welcome to carry mine for a 6 hour job...). I really appreciate the freedom the G9 gives me, the unobtrusive size while working, and the lack of aching neck or shoulders.Face/eye detection autofocus is marvellous (now with animal detect AF too) and the image stabilisation is astounding, especially for video.At the new lower price, I think the G9 is simply unbeatable, for value and as a camera.*the photo is the Museum of the Moon art installation at Gloucester Cathedral, G9 with 7-14mm lens, copyright me!!"
        },
        {
            "title": "Impressing quality, easy to use",
            "rating": "5.0 out of 5 stars",
            "body": "Amazing camera! Easy to use, pictures quality is brilliant. It does beautifull night sky shots and macros."
        }
    ],
    [
        {
            "title": "Very good for that price.",
            "rating": "5.0 out of 5 stars",
            "body": "A good camera with a huge amount of options."
        },
        {
            "title": "Wonderful camera- UPDATED Just got a lot better",
            "rating": "5.0 out of 5 stars",
            "body": "Wow, I bought this as I wanted to move up a notch in both my stills and videography- I do roughly 50/50 of each.This is an amazing camera for both.I did think twice about spending the money, but just Youtube 'Panasonic G9 cinematic' to see what can be done with this baby.It is also beautifully constructed - it seems bomb proof.I am very happy with my purchase.I like to use Snapseed for editing photos (hard to beat if you don't want to spend hours in Photoshop etc) and use Lumafusion for editing 4k 60fps on an iPad pro (my iMac couldn't cope, an iPad 6 or Pro will crunch it no problem).Edit- the camera has just had a significant upgrade. The new firmware 2 has given it many new features, not least 10 bit video like the G5, making the G5 almost redundant. The autofocus is also improved yet again. A phenomenal camera, just buy. Serious video editors can also now buy and install the VLog profile, for about £80- again just like teh G5. This gives a very flat image with high dynamic range in post."
        },
        {
            "title": "The best value 4K60 camera on the market",
            "rating": "4.0 out of 5 stars",
            "body": "For video I needed absolutely to use the \"unlimited recording hack\" (which you can find on YouTube), because the 10 minute limit for 4K60 is unacceptable and I am using the Japanese/Hong Kong import (a US import would have done too) to also not have a 30 minute limit (which there is on every European version of the G9) which also would have been unusable for me. So with that hack this camera has better autofocusing (slightly) than the Panasonic GH5, it has better IBIS (slightly) than the GH5, and it's a bit cheaper than the GH5, it's better designed and more usable in terms of buttons and handling than the GH5.The GH5 has some video functions that I don't need now like 6K30 video (requiring an anamorphic lens or anamorphic lens adaptor because that 6K30 mode is only filmed in in 4:3), 4K30 with 10bit HLG in H265 (I definitely want 4K60) and the 4K30 10bit internally mode (I need 4K60 more than I need 10bit).So with that unlimited recording hack this camera for me is perfect, I have already filmed hundreds of 4K60 videos longer than 10 minutes and many longer than 30 minutes too.The only major flaw of this camera is the video autofocusing performance is nowhere near good enough in many situations you will see background lights pulsating which means that the focus point is constantly moving in and out on the face or on the object that you are trying to track with autofocus mode, you will often have slightly soft faces when filming especially when the lighting conditions are not optimal in cases when the contrast on the face or object is not clear enough for the camera to stay put. Autofocus is the major missing feature that I hope Panasonic will definitely fix with the future GH6 camera that one can expect, perhaps a G10 too (although I hope the GH6 will include all \"photo features\" of any eventual G10 so no G10 may be needed). For Panasonic to fix autofocus they need to adopt phase detect hybrid autofocus technology, preferably with reliable and stable video Eye AF functionality too, just as in the new Sony A7Rmark4. Sadly in the Panasonic S1/S1H Panasonic still hasn't fixed their autofocus technology so it is really unsure if Panasonic can fix that in the GH6 whenever (if) they decide to release that one. You may not think of the autofocus to be as big an issue as it is for me, and to be honest my videos do in general look quite awesome \"generally\" with this camera, but just I am sure that the quality of my videos would be up a significant notch if the autofocus really was not an issue. So better autofocus is the main reason I am looking forward to upgrade from this camera at some point in the future, when there might be another 4K60 camera out there with all the features of the G9 (un-cropped 4K60, flippy display, decent battery, good audio mini jack, dual SD UHS-2 slots, decent 150mbit/s 4K60 (preferably smaller YouTube-compatible H265 bitrate optionally) + significantly better autofocus performance.I think perhaps another issue with this camera but it is slightly less of an issue but still might be an issue, is that it doesn't seem to have a reliable automatic de-flickering mode in video. It does have it in photo mode. But in video, sometimes, it flickers more or less badly if there might be some flickering lights or TV or something like that in the background of the video somehow. This is only a small issue though, the autofocus is the only major major issue with this camera I think."
        },
        {
            "title": "Just the beginning",
            "rating": "4.0 out of 5 stars",
            "body": "I bought this during the £300 cashback so im getting it for 1.4kI was questioning myself for the first month i bought it as i have been looking for the perfect camera and didnt know if it was what i was looking for.I dont want to make this long.-The ibis- in body image stabilization is great-It has a crisp sharp full of colour flippy screen-The leica 12-60 is maybe the best kit lens ever as it gives you wide vlogging range and you can zoom in alot. Great lens and extremely sharp.-the battery i think is good, it lasted me the night of recording and sometimes having it idle-does well in low light, but nothing special. The moment there is some light source, it catches clean images such as a street light on a dark road,.It fits confortably in my hand and most buttons are in a good spot.-customisation options for different buttons-the autofous in video is pretty good but fails in really low light. So be smart, record in the daylight but manual focus is good as it has focus peaking (blueish outline on whatever is on focus so you know where you are with that). So use manual focus in low light. Besides that, af in video follow consistently.-this is a stills camera with great video quality-and the stills quality is great too.Im a novice so ive got alot to learn and this camera will teach me soooooo much. V happy with this cam. Ive tried to be strict with my review.Unless u got a faulty camera, this is a really good buy. Maybe most underrated camera yet."
        },
        {
            "title": "Such a bargain.",
            "rating": "5.0 out of 5 stars",
            "body": "This must be the best camera deal out there, price and performance.Feels great in hand, very good grip. Can do just about anything photographic.I don't have anything negative to say about camera or dealer."
        },
        {
            "title": "Amazing",
            "rating": "5.0 out of 5 stars",
            "body": "For the price amazing. Is not full frame but for £1069 after Panasonic cash back, 4k 60fps and not big lenses perfect. Easy to travel with. But if you take a lot if night time pics and videos, go for Sony a7 mk3. I do 80 % of my work during day time and honestly amazed with it. Love fully articulated screen as well"
        },
        {
            "title": "Superb camera",
            "rating": "5.0 out of 5 stars",
            "body": "The only fault I can find with this camera is that it's a bit big compared to many other Micro 4/3rds models. However, the larger size provides excellent handling. Otherwise the camera excels in every respect."
        }
    ],
    [
        {
            "title": "Picture quality",
            "rating": "5.0 out of 5 stars",
            "body": "Excellent camera and lens combination"
        },
        {
            "title": "Versatile camera for all your media needs",
            "rating": "5.0 out of 5 stars",
            "body": "I have owned this since release, it's the most versatile camera to date. It takes Great photos and with in body and lens stabilization you can hand hold a 1.3 sec shutter speed, the ergonomics are perfect. Lens choice is vast with options with sigma Panasonic and Olympus. I use this with my 14-140 and 100-400mm and it's wonderful to use, 4k video is perfect and ta 300-400 you have stabilised video silky smooth. Also has a high Res mode"
        },
        {
            "title": "The bad stuff first",
            "rating": "1.0 out of 5 stars",
            "body": "The bad stuff first:1. Unusable as a photo camera for me, with the 12-60 Leica, the images don't have any detail, even at 200 ISO. It is really absolutely terrible. Even my old Nikon D5300 with the crappy kit lens produces images with more detail.2. Video is OK, like it more than my Sony A7 III.3. Ergonomics and functions are really top.Conclusion: Very nice and ergonomically awesome equipment, but not usable in photos.Have to return it."
        },
        {
            "title": "Easy use but with full control if required",
            "rating": "5.0 out of 5 stars",
            "body": "Great little camera especially with the cash back offer"
        },
        {
            "title": "Seriously good camera.",
            "rating": "5.0 out of 5 stars",
            "body": "Great camera and lens combo. You can build a micro 4/3 system with much less weight than full frame etc. That was my priority. It takes great photos, the only downside is the menu system which takes a bit of getting used to."
        },
        {
            "title": "Not perfect, but very good",
            "rating": "5.0 out of 5 stars",
            "body": "Great camera. Have a G7 and it's better than that, far more features.Love having two SD cardsIf there is one thing, well two actually, against it, then those areThe battery charger is USB not mainsThe 60FPS in 4K is only for 10 minutes max. The 4K limit at 30FPS remains at 30 minutes, the same as the G7.Going to test it to death next week in -30C up in the Arctic. If it survives that it's 5 star.Despite the cons, it's great.PS - The third con is no flash built in, need to carry an external around even for those casual shots that need a flash, eg in backlighting situationPPS - the fourth con is they have removed the panoramic shot setting :-(PPPS - the last con is the weight, quite a bit heavier than the G7Still love it though..."
        }
    ]
]