[
    [
        {
            "title": "Very happy",
            "rating": "5.0 out of 5 stars",
            "body": "Upgraded to this from the iPhone X! Love it"
        },
        {
            "title": "camera is amazing",
            "rating": "5.0 out of 5 stars",
            "body": "like always video and camera are top notch on iPhones literally! the battery is ok not great but not bad I would say its good.photos turn out phenomenal videos are very stable the speakers pack a punch and are really excellent in sound very high quality!"
        },
        {
            "title": "amazing",
            "rating": "5.0 out of 5 stars",
            "body": "was so glad i purchased this, was a bit sceptical buying this since it said the box may be damaged, but buying from amazon warehouse was the best thing i’ve ever done. saved almost £200 on the brand new phone from apple, and the only thing different was the original box was slightly damaged"
        },
        {
            "title": "Phone",
            "rating": "5.0 out of 5 stars",
            "body": "Very nice thanks"
        },
        {
            "title": "Nice white",
            "rating": "5.0 out of 5 stars",
            "body": "iPhone is what it is. Always had them but only upgrade every few years. My last one was an XR. Choose the white and very happy with it."
        },
        {
            "title": "Really bad quality",
            "rating": "1.0 out of 5 stars",
            "body": "bought the iPhone14 two months ago and it has been nothing but a headache. The phone constantly lags, it's slow to respond to commands, and it frequently turns on and off by itself.The touch screen is unresponsive and it's frustrating to use. To make matters worse, the phone gets warm super easily, which makes it uncomfortable to hold for extended periods of time. Overall, I'm very disappointed with this Amazon product and regret purchasing the iPhone 14. I wouldn't recommend this phone to anyone looking for a reliable and high-performance device.\""
        },
        {
            "title": "Excellent phone",
            "rating": "5.0 out of 5 stars",
            "body": "Great saving on price compared to other outlets"
        },
        {
            "title": "Excellent",
            "rating": "5.0 out of 5 stars",
            "body": "A great upgrade from the SE (2020). The battery is excellent, and the cameras certainly make this phone worth it."
        }
    ],
    [
        {
            "title": "Excellent phone",
            "rating": "5.0 out of 5 stars",
            "body": "Item was as expected for iPhone"
        },
        {
            "title": "Randomly Opens Apps",
            "rating": "2.0 out of 5 stars",
            "body": "This replaced my XS which wasn’t very good either. My husband has the same phone and these issues are prevalent with both: screen judders when scrolling; poor photo quality compared to the 11 (which he had previously), randomly opens apps which suggests touch screen super sensitivity. It’s fast though and the battery lasts about 14 hours."
        },
        {
            "title": "Lovely phone",
            "rating": "4.0 out of 5 stars",
            "body": "Bought for my daughter afer he hand me down IPhone SE gen1 gave up. It was old! It is a nice phone. It is lighter than my IPhone 14 Pro Max which I do like. The camera is of good quality but the Pro/Pro Max cameras are a lot better. Ideal for the younger members of the family. I personally would recommend the Pro/Pro Max if you like taking pictures."
        },
        {
            "title": "Good phone",
            "rating": "5.0 out of 5 stars",
            "body": "I’ve had iPhones since the iPhone 4 was released still love them!"
        },
        {
            "title": "Ipnone",
            "rating": "5.0 out of 5 stars",
            "body": "Disappointing looks . Expensive for what it is"
        },
        {
            "title": "Nice phone",
            "rating": "5.0 out of 5 stars",
            "body": "As expected and for great price"
        },
        {
            "title": "It's an IPhone",
            "rating": "5.0 out of 5 stars",
            "body": "I can't complain. It's an upgrade from the IPhone SE, so I can't be happier. Battery life is good (about 24hs if you don't binge watch series on it), sounds good and feels good"
        },
        {
            "title": "Apple rule!",
            "rating": "5.0 out of 5 stars",
            "body": "Years of devotion to Samsung but for 4 years now have converted to Apple. NEVER GOING BACK."
        }
    ]
]