[{"text": "I had my doubts about buying a phone online but all doubt was removed 2 weeks ago.It came unlocked but i was kind of weary on if it would work with verizon.  Glad i was wrong. As soon as i put the sim card in, it was off to the races.This phone runs so smooth , the camera is excellent!!!!Ths s22 ultra is the best phone I've owned.", "title": "Very happy with my phone purchase!", "rating": "5.0"},
{"text": "No problems. Outstanding camera. Large hard drive.  Had a problem with texting, but I think that had more to do with the cell company.  But that was resolved.", "title": "Nice Phone", "rating": "4.0"},
{"text": "El teléfono es muy bueno, cumple con todo lo que se le pide. La cámara, audio y pantalla definitivamente los puntos fuertes. Lo malo es que el procesador tiende a calentarse un poco tareas muy exigentes. Aunque en el día a día no se nota.", "title": "Excelente, pero...", "rating": "4.0"},
{"text": "First phone with S pen that I get... The fingerprint works fine (I still have to get accostumed to have it under the screen and not on the side if the phone) and it's quick.", "title": "Beautiful desing", "rating": "4.0"},
{"text": "This one i bought is for my wife. I owned a s21 ultra already so i knew what to expect. This is the first time buying a phone from amazon tho so i was a little skeptical cause im used to getting my phones directly from Samsung. Im happy to say the phone is brand new tho, its in perfect condition and comes in the original packaging with everything but a charging brick  but thats the direction these phone companies are going in now. Anyway 5 stars for me", "title": "Brand new as ut should be", "rating": "5.0"},
{"text": "I'm a fan of the Galaxy Note series. I'm coming from a 4 year old Note 9. This is way better and it's pictures and videos are awesome. I love the moon shots and the amount of editing options available. It works great, it's fast and powerful. I'm pretty satisfied with it.", "title": "Great phone", "rating": "4.0"},
{"text": "This phone is effectively a version of the note series that samsung discontinued, with the exception of being more powerful than ever. Idle battery lets the phone stay in performance setting for 24 hours and the battery is persistent even when you are running heavy graphic games. The most stunning part of this phone is the camera that captures up to 100 times resolution. This means you can literally make something that is smaller than the size of a tennis ball far away fit the entirety of the camera screen. This is on par if not more powerful than military grade binoculars. 100 times camera pointed to the moon makes it effectively a low resolution telescope.Small downside for those who like to leave their phone running apps for hours, every once in a while (I have experienced this three times since buying the phone Sep 2022) when running large apps the phone may heat up. Since earlier models were known to have caused fires under extreme use, you may want to turn off the phone for a few minutes to let it cool off.", "title": "Just an amazing phone. Samsung users know what I am talking about", "rating": "5.0"},
{"text": "Works like it should expect one issue I had was the fact that when I matched it up to my other s22 ultra the factory stuff was different somethings (factory) that my other phone had this one didn't not sure if this was a first version or something made no sense but worked", "title": "Samsung", "rating": "4.0"},
{"text": "The phone itself works fine however, Samsung will see the device has been registered back in March of 2022 and you will not be able to get Samsung Care+ no matter how many 'customer service' reps and managers you deal with, make sure when purchasing this device if you want insure you'll have to go somewhere else.", "title": "If you want insurance you can't get Samsung Care+", "rating": "4.0"},
{"text": "My phone was awesome. Quality and everything was nice. Recently Disappointed. Even that far off the ground and now the internet plus my data service doesn't even work. Dissappointed.", "title": "Good until I accidently dropped it", "rating": "3.0"},
{"text": "I said I'd never pay this much for a phone but this one should last me the rest of my days. It has a fantastic camera that takes Great photos near and far with the 100x zoom.I live miles away from town and having Wi-Fi calling is a great feature that my S8 didn't have.  All around good phone", "title": "Great Phone", "rating": "5.0"},
{"text": "Samsung devices have been my goto since the note 2.Flip flopping on sdcard vs no sdcard is irritating.I purchased this after my wife purchased hers. I was that impressed with the camera. Aside from that, there isn't much of an upgrade over my Note 10+.The Note 10+ is going on 3 years old, and rumors say the next device will have all rounded corners. I don't like that design, and that was reason I chose to buy this.The glass seems more fragile than previous versions. My wife had hers for a week before dropping it less than 2 feet, while using a protective case and the screen cracked, looking like a spider web.The buttons moving to the right, and s pen moving to the left, isn't a problem, though I'd like to know the why behind it.I have no opinion on battery life, as charging phones is so easy, I just don't care.There is something different in the charging design though. My note 10+ with thick cases could still fast charge in my charging stand. The 22 ultra, using the same charging stand, and same brand and style of thick case will not.I have had no issues with camera lag, overheating, fingerprint scanner, or any of the other complaints I've read about.", "title": "The new Samsung note.", "rating": "5.0"},
{"text": "If you put a screen shield on - which I would not think of leaving off on this expensive a phone, the finger print reader is useless.  Face recognition is scary good.The battery life is fair - I sure wish it was replaceable which it eventually goes.The cameras are really first class - and compete AMAZINGLY with a typical pocket camera, leaving those to be useless now.I ended up giving up my LG V20 which I loved - and had a replaceable battery - because LG went out of the phone business - and not support or updates.  It had a great finger print reader because it was on the back - exposed - and where you  want one anyway. The front is a DUMP place and only used by the manufacturers to save them money.", "title": "Great phone - good to have unlocked and no phone company garbage", "rating": "5.0"},
{"text": "This phone is a powerhouse and stops at nothing. I'm a web developer and I need a snappy phone that runs the latest and greatest, as well as provides me with mobile internet access all the time, and this phone does not disappoint.  The cameras are also amazing, even compared to my old s20 FE. A great addition that I didn't expect to be so handy is the S-pen. It's great for jotting down quick notes, doodling at random, editing screenshots, etc. It even has music controls so that you can take the pen and control your music if you are one to plug your phone into a hi-fi away from your desk and such. If that's not your thing, it's nice to have extra tools sometimes when you need them, even if you don't use them often. The screen is also stunning even in comparison to my S20 FE, much brighter, sharper, and overall very color-accurate.  Battery life is also great, and if I needed to I feel like I could get 2 days of power out of the battery without needing to plug in again. Hats off Samsung! Good job on this one.", "title": "Can't go wrong with this phone", "rating": "5.0"},
{"text": "Very good phone, very fast, and also very expensive.  Came in 2 days which was very nice, cause my other phone was broke.  Unlocked model works great with Verizon.  Camera is very good.  Fingerprint reader works but I have not installed the screen protector yet.  I mostly use the pin, iv never had good luck with fingerprints cause mine get beat up.  Battery charges really fast, I like that alot.  Battery seems to last pretty good depending on how hard your working it. Last me all day and then some, and only takes like an hour to charge.  Gave it 4 stars only cause it's soo expensive.  But I'm happy I got it.", "title": "Samsung s22ultra", "rating": "4.0"},
{"text": "I love this phone so far. I had been using an S9 and it was starting to act up. There really is no comparison. The S22 Ultra is so much better all around. It's bigger and somewhat bulky though by the time you put it in a case. Supposed to have super fast charging but no wall or car charger comes with it. Just a cable with a C port on each end that I can't use yet because all my wall and car chargers have USB ports. Even my cars built in charging ports take USB cables and it's a Subaru Crosstrek bought brand new in 2019. Seems petty on Samsung's part to not include a charger to fit the included cable. Shame on you Samsung! These phones are expensive  and you're acting like a cheapskate!! And that's why 4 🌟 review.", "title": "So far so good! Except NO charger included!", "rating": "4.0"},
{"text": "I've been using Samsung Note devices for some years now, starting with the Note 4 and moving onto the Note 8, I tend to keep my smartphones for a long time without switching. The S22 Ultra delivers the quality and performance I expect from these flagship devices and I am confident that I may carry on with my tradition after having the S22 Ultra in hand for just over a month now.It comes with all the bells and whistles you'd expect, including a fantastic battery life and then some. One of Samsung's most underrated features, Samsung Dex is a joy to use with this phone. It's quick and snappy through the multitasking capabilities and certainly has been a time saver during some situatuions of technical difficulties. I do hope Samsung continues to build and improve Dex and I hope that more people and developers recognize it's potential.", "title": "Fantastic device", "rating": "5.0"},
{"text": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n     I ordered this phone and sent it to a friend overseas to bring it home for me so I don't have the box to do an unboxing. It can't without the pin to open the sim tray but had the original USB in the original box. My friend thought it had scratches around the rim since I bought it used- very good, but the plastic hadn't even been taken off yet to my delight. The battery was low when she got it and dead when I got it and took about 10 minutes to boot up while being charged on a powerbank. The camera quality is unmatched and I'm coming from an s20 ultra. Phone is unlocked as quoted as you can see in the video and comes with advertised storage. Spen works flawlessly and speakers are good, the same as my s20 ultra. I haven't written a review on this website for so long, but I had to write one for this sweet purchase!", "title": "The best deal for the best phone ever!", "rating": "5.0"},
{"text": "I got the 256 gb and it was much cheaper on here than with at&t. I was worried it would be a rip off since it was reasonably cheaper but that is not the case. Came in an unopened box and unlocked for any provider, easy to set up.One thing I noticed is that it does seem to take longer to charge over my galaxy s9 plus but without aggressive usage thought out the day it ended on 65-70%", "title": "Great deal!", "rating": "5.0"},
{"text": "I'd like to first note that the transaction was amazing, received in under 24 hrs after ordering, came in perfect condition.5 star phone▪︎Amazing cameras,100x zoom,8k24 compatible▪︎Amazing display , 1440p 120fps(can go all the way down from 1hx to a max of 120hz, I must say the display is so beautiful especially when watching UHD HDR videos!▪︎S pen, I personally haven't used it too much but it can be very useful for artists, writing signatures,  taking pictures along with many other tasks.▪︎fast chip!! It uses the snapdragon 8 gen 1 which appears to work perfectly for demanding tasks such as hard-core gaming , multi tasking or even multi windows running simultaneously,  I personally haven't experienced 0 lags or stutters.▪︎security is top tier !! It's secured by Samsung Knox, has a secured folder, fingerprint reader(in screen) and facial recognition (along with all the other standard security options) the fingerprint works perfectly no issues.There's much more to mention but that's what came to mind, over all if you're looking for a premium phone and want a high-quality device , this phone definitely gets the job done by far with no issues, I'd highly advise a phone case as this phone is not cheap.Love it!", "title": "love it.", "rating": "5.0"},
{"text": "I had my galaxy note 9 for 5 years and it ran great every step of the way. Highly customizeable user interface. Tons of awesome features. And the best cameras on the market. I highly recommend the galaxy s 22. Its a phenomenal phone.", "title": "Samsung is the only phone to get", "rating": "5.0"},
{"text": "Just like the title says. I wish it had expandable memory and a fast charging brick in the box but other than that, EXCELLENT product.Never struggled to game, no lag doing daily tasks, S-Pen is surprisingly convenient since I am an artist and didn't think I could sketch on the small form factor but ended up sketching more comfortably than some tablets I've used in the past. The bluetooth freatures on the S-Pen are super convenient as well. Camera is a good camera I mean most flagships have great cameras nowadays you're good. Dex is great, brightness and screen is great, Biometrics is great, call quality is great etc etc I mean its just a great phone plus the Pen funtions.", "title": "Best phone I have ever had.", "rating": "5.0"},
{"text": "This was a present for my girlfriend and she likes it a lot, especially the quality of pictures it takes, and Amazon offers this product at a reasonable price by comparison, thank you.", "title": "Yesi's Phone", "rating": "5.0"},
{"text": "I have used this phone for a month now, and heating problems is too much, specially when charging, one day I just shake phone and realised that it has a loose part inside ,I have no idea what it is , it's common or something else, but there is a shaking noise that you can feel something is loose inside.Other then that phone is good , working good, camera is so better then others.Rest still exploring", "title": "Heating, phone has loose part inside", "rating": "3.0"},
{"text": "Es en mi primer smartphone de gama alta, siempre me he mantenido con la linea de teléfonos conocidos como los calidad precio, siempre en la gama media. vi muchos Reviews pero el S23 Ultra fue la mejor elección", "title": "Mi primer gama alta", "rating": "5.0"},
{"text": "The phone is everything Samsung says it is and I would highly recommend it, but I have a bone to pick with Amazon.  I pay an exorbitant annual fee for Aazon Prime which includes 2 DAY SHIPPING.  ARE YOU LISTENING AMAZON, 2 DAY SHIPPING!  Yet, this was listed as Amazon Prime sold by Amazon and took a week to get to me.  I don't want to hear about Covid crap.  If you can't ship everything in 2 days like you promised, you should give annual fee rebates instead of raising the subscription fee every year.  Wise up Amazon!", "title": "Good phone but why do they have to be so expensive", "rating": "4.0"},
{"text": "I owned the first 4 Samsung S phones and I`ve always felt like the devices were not very good. And after the S4, I bought other brands. This year I decided to give Samsung another try - big mistake. I bought the s22 ultra, after watching numerous youtubers praising the battery life of the phone. After owning the phone for a month, it is clear to me that the Samsung paid a lot of youtubers to lie about the performance of this phone. The phone looks great (besides the curved screen) and it has an awesome OS, with tons of customizations. But the battery life is really, really bad. The 1st phone`s battery was not lasting more than 4, 5 hours, with light usage. It is true that I was using everything, 120ghz refresh rate, always on display, etc. After a few days, I called Samsung support and while on the phone with them, the battery went from 17% to 4% in 7 minutes. They decided that the phone is defective (without running any tests) and told me to ask Amazon for a replacement. Once I got the replacement, I optimized everything on the phone: 60ghz refresh rate, low brightness, no Bluetooth, no 5G,  and pretty much  everything else that I could think of, to make sure I'm getting a better battery life. All this increased the battery life, but not enough. I was not using most of the features of the phone and I was still worried that I need to be close to an outlet.  The fingerprint reader is just not working properly, it failed to recognize my prints all the time ( I didn't have a screen protector). And the phone is running SUPERHOT!!! On a call-hot, watching a video-hot, charging -burning hot, in my pocket-hot. I decided to send it back and I will never buy a Samsung product again.I bought another Android device from a different manufacturer and what a change... not running hot, a day and a half battery, 25 minutes to charge from 1% to 100%.", "title": "I will never buy a Samsung product again", "rating": "2.0"},
{"text": "Believe it or not the phone does not come with a block to charge it and you can not use a usb one! I had to order it special ...that really made me upset. Shame on Samsung. overall a good phone.", "title": "buy a charger for it!!!", "rating": "5.0"},
{"text": "This phone has good specs and good performance and can run multiple apps at the same time without slowing down. For the money it should have a wireless charger (it only comes with a USB A to C cable and no charger of any kind). I also think that for the amount of money you pay it should have 16 gigs of RAM but it has only 8.  It's a toss up between this and the iPhone 13 Pro Max. Both have advantages and disadvantages. The iPhone 13 is more like a box and much thicker while this one is the usual lesser thickness.", "title": "My new favorite phone", "rating": "5.0"},
{"text": "I got a great price from Amazon and am very happy as I haven't upgraded in 5 years.I bought the phone because of the camera and display size. I can honestly say I wish I had bought the s22+, because I do not need or use the stylus, and the stylus adds quite a bit of weight to the phone.The phone is super fast and the display is incredible. The only complaint I would really raise is that it seems it gets worse 4g reception than my s9+, but does well if it can pick up a 5g tower.I never found myself in any dead area when traveling near my phone before, but it's happened twice now, which is very stange.", "title": "Awesome phone, but I miss the fingerprint reader on the back.", "rating": "5.0"},
{"text": "Three days after buying a S21 FE direct from Samsung and experiencing many problems and terrible service, I sent it back and bought this S22. I just got this unlocked phone yesterday, but this one was up and running in an hour. In my opinion it is far superior to the S21.Only four stars for value is because no cell phone in this caliber and price range  should ever be shipped without a charger. Especially when they tell you to not use an off brand charger.", "title": "The best phone I have ever owned, so far!", "rating": "5.0"},
{"text": "Great deal you get 2 times the storage for the price of one. Price is better than tmobile or any carriers. steel deal indeed!You wont go wrong!", "title": "Amazing", "rating": "5.0"},
{"text": "Great phone, great Features but has a few minor issues that I find irritating but I love this phone.Cons:*Face reader is great until you put on a pair of glasses.*Fingerprint reader only works if you rest entire surface of finger on it.*Battery dies quickly if your a heavy user. watch alot of streaming apps, tiktok etc.*Camera is great but is difficult to master you need a master class in how to take a good picture with it.Pros:It's a Samsung Flagship phone. More features than you probably need but can do it all.", "title": "Love It But...", "rating": "4.0"},
{"text": "I purchase this phone a few weeks ago and it's working really well. Everything that was mentioned came in the box and it was really fast to be delivered (less than 3 days and I don't have amazon prime). Had some doubts because I have brought one a few years ago and it didn't arrive and they charge me (not Samsung another brand) When they deliver somebody must sing, consider that. Have a really good camera and it's similar to the S20 Ultra I had for the last 2 years!", "title": "Good Purchase", "rating": "4.0"},
{"text": "Poor battery", "title": "Terrible battery", "rating": "3.0"},
{"text": "The latest S series does not disappoint. The battery lasts so much longer than the S6 it replaced. I really like the pen and note feature.", "title": "Fast processor and long battery life", "rating": "5.0"},
{"text": "I like the interface with Samsung devices and the overall viewing from the display.  Very clean cut.  Would like easier functioning for camera and lights, other than that I am good.", "title": "More versatile than IPhone", "rating": "5.0"},
{"text": "For the price we pay they should have included a charger and made a better battery usage ratio (lasts less than a day). However except those 2 well knows issues, the phone is great and super fast !", "title": "Poor battery life and no charger", "rating": "4.0"},
{"text": "This seems to be the fastest phone I have ever used, and that means it is faster than my wife's iPhone 13 Pro Max.  The screen and the cameras were a huge step up from the Galaxy Note 9 that I have been using before getting this phone.  The only down-side I have found so far is the in-screen fingerprint reader.  The one on the back of my Note 9 was more convenient, and I have not yet found a screen protector that works well with the fingerprint reader on the S22.", "title": "Excellent Smart Phone", "rating": "5.0"},
{"text": "Great phone. But disappointing to pay this much for a phone and receive it with stickers cut and packaging clearly having been opened before.", "title": "Good phone,but had been opened before", "rating": "3.0"},
{"text": "I've been using this product for about 3 weeks no problems except connecting to services Worth your money 10 out of 10 recommend", "title": "Had minor problems with cell service  , camera is great speed is phenomenal Is worth the money", "rating": "4.0"},
{"text": "Very expensive works well so far fingerprint reader is in the screen and not on the back so fancy. I'm 22 and technologically  has never been my Forte this is. Pretty simple easy to use phone", "title": "Expensive  but arrives  earlier than expected", "rating": "4.0"},
{"text": "Well made and high functioning. It has met or exceeded all my expectations except for speech to text and fingerprint reader. The reader has problems with screen covers, even after calibration. Speech to text is not exactly Star Trek but that could also be the online engine.I had a Samsung S21 FE and hated it. Returned after 2 months with the gracious complicity of Amazon. Even when manufacturers and distributors fail, Amazon always goes above and beyond.~JSmith", "title": "An Elite Phone", "rating": "5.0"},
{"text": "I love my new phone, specially the quality of the camera/photos", "title": "In love", "rating": "5.0"},
{"text": "I love the phone and the speed of the apps loading.  However, for a phone that costs $1,000 or more, not having a charger is disappointing.  If it would have been included, I would have given a 5 star rating.", "title": "Wonderful Phone, Apps load very fast.  (No Charger?)", "rating": "4.0"},
{"text": "Shipping was fast. I anticipated receiving  a two(2) sim phone instead I got a phone that supports one(1) physical sim only and an Esim which is not supported in my country.😪😪😨😫😩", "title": "Did not met my expectation", "rating": "2.0"},
{"text": "I ordered this Samsung s22 ultra 256 gb to replace my iPhone 11 Pro Max because of water damaged . The phone was used liked new from Amazon warehouse . It came with no scratches, everything  works and functions like new . No complaints ! I recommend the Amazon warehouse deals and maker sure it works before 30 day period is up to return if something is wrong .", "title": "A brand new phone !!", "rating": "5.0"},
{"text": "Nice phone with great camera.", "title": "Great camera phone", "rating": "5.0"},
{"text": "The price was a lot but quality was a a good deal. Would have been better of it came with a physical manual and a wall wart to charge phone.", "title": "Great phone", "rating": "4.0"},
{"text": "The battery life is very disappointing. The battery lasts even less than my 3 year old phone, under the same use conditions. For the hundreds of dollars that I paid for the S22 Ultra, sure I was expecting a better battery life than a 3 year old phone (LG V60), that has older tech and lost of battery wear. But in fact the battery in the S22 Ultra was lasting less than in the 3 year old phone! This was very disappointing, I am returning it.", "title": "Disappointing battery life, amazingly worst than my 3yr old phone!", "rating": "2.0"},
{"text": "Esta genial y libre de operadora en mi pais Ecuador", "title": "Celular muy bueno", "rating": "5.0"},
{"text": "Bought this S22 Ultra 256GB phone to replace my S10+, which is still a great phone, but wanted the better camera and video, and the notepad functionality is cool.  No issues so far.  Still need to learn how to use all the options the stylus provides,  but the phone is solid.  I hope to keep this bad boy for a few years, until the ones that have VR capability that syncs with your brain waves.. LOL.  Ha, ha.", "title": "Great phone, best from Samsung in 2022", "rating": "5.0"},
{"text": "Really disappointed with this phone runs a lot slower than the s21 and doesn't work well with multiple apps open and the battery life isnt very good honestly want to switch back to my s21fe 😩", "title": "Not for me", "rating": "2.0"},
{"text": "I limit my comments to the use my limited vision permitts.  A large, bright. high quality screen. The Samsung accessability settings offer a number of very helpful features including large bold print  a special keyboard. and . Talk Back. The phone also permits answering a phone call by pressing to up volume key. Depending on use. battery has always lasted the day and then some. It has been a good purchase continually offering useful surprises as I fumble along.", "title": "It fit my needs", "rating": "5.0"},
{"text": "It's a really nice phone however, I am disappointed with the accessories that came with it. The package doesn't even have an adapter. Just a USB, how am I supposed to charge my phone? The phone is also quite slow. I am surprised at how slow the phone is. The phone didn't come with the pin to open the sim card slot, how am I supposed to get my sim card in or out of the slot. Just so much I am disappointed in. I've been a loyal Samsung client for over 8 years and I've never been more disappointed 😞", "title": "Nice phone, poor packaging and way slower than expected", "rating": "3.0"},
{"text": "Loving this phone- cameras are amazing & the screen is largeee- the stylus is super handy as well. :)", "title": "Love love love", "rating": "5.0"},
{"text": "Me esperaba  mejor el rendimiento  pero esta bien", "title": "Excelente  el envío", "rating": "4.0"},
{"text": "Just out of the blue product stopped working.  One minute it worked the next it didn't.  Nothing functioned, would not start, plugging it in also had no effect.  Cell phone was only 5 weeks old", "title": "What's Wrong", "rating": "3.0"},
{"text": "Phone came on time look and works great", "title": "Great phone loving it.", "rating": "4.0"},
{"text": "I've been using this phone for a week or two now. Very satisfied with my purchase. I used the note 9 (which I enjoyed quite a bit) and an s20ultra (which I did not enjoy as it was plagued with software issues, mainly issues with Bluetooth and the cameras) and finally ended up on this phone. This phone is actually very solid in terms of performance and stability. The screen is very sharp and bright, the inscreen fingerprint reader is quick, the battery life is average on 75% brightness, the camera is great and the spen is back and as good as ever.", "title": "Great overall phone.", "rating": "5.0"},
{"text": "Luv the camera. Not user friendly. Try n take a screen shot...laughable", "title": "Camera is awesome", "rating": "4.0"},
{"text": "It's ok device", "title": "It's ok device", "rating": "4.0"},
{"text": "It's a great improvement from the s9 very sensitive fingerprint sensor and great battery life", "title": "Upgrade", "rating": "5.0"},
{"text": "I upgraded from a s9 which I loved to the s22,totally awesome phone even better than I expected,finger print reader very responsive battery life is about 2 days strong as it was said to be I'm very happy with my purchase", "title": "Galaxy s22 ultra 5G", "rating": "5.0"},
{"text": "The Galaxy S22 Ultra is an excellent phone with everything, plus the kitchen sink. The phone feels great in my hands (I probably have average man hands), and the fingerprint sensor works faster than my old S20+. The screen refresh rate is at a default of 120 hertz and does drain the battery a tad bit more quickly. The phone can get to 25% by 6 pm with a full charge. If you are a fan of Galaxy or looking for something different from Apple, the S22 Ultra is the way to go.", "title": "Amazing phone!", "rating": "5.0"},
{"text": "Very Nice Phone. Love the S pen", "title": "Very Nice Phone. Love the S pen.", "rating": "3.0"},
{"text": "Camera system is great on this phone. Finferprint sensor is fast and easy to use. I play a lot of games on mobile and they look great and phone battery is very respectable while gaming for hours. Just great performance overall!", "title": "Great Phone", "rating": "5.0"},
{"text": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n     pretty good phone all around. amazing speaker,graphics..", "title": "great phone", "rating": "4.0"},
{"text": "Honestly the face recognition is not bad at all, in fact its very good, but the fingerprint scanner is so very very bad. I have to try 5 to 7 times to unlock my phone even after I update the software.  On top of all that, the sound quality is horrible, I have a Samsung S9+  My S9+  sound quality is way better than S22 Ultra!!!Aside from all these which I could understand, and wait for a software update and hope for the best for me was the battery which was getting too hot even for day to day tasks, so I sent it back, I expected the best from Samsung specially when you pay almost  $1500.", "title": "Fingerprint Scanner and battery", "rating": "3.0"},
{"text": "This phone (s22 ultra) is not dual SIM. Things like this needs to be front page description. Its not enough for me to return but I would imagine its needed for others. Otherwise its OK so far. Early to say for sure. Prob will adjust rating after a month of use.", "title": "good camera but...", "rating": "3.0"},
{"text": "I got this for my bf and he is totally satisfied. He still familiarises himself with the features. Seems to get 2 days of full battery life!", "title": "Ultraly Happy", "rating": "5.0"},
{"text": "just get it. Cameras are awesome, stylus is awsome, its fast and works great.", "title": "its a beast. Get it", "rating": "5.0"},
{"text": "Awesome phone, but I don't like how settings are hidden behind a console. There are basic settings available on my S7 that are non-existent on the S22, unless you download some software and practically hack into it. But all-in-all a good phone.", "title": "Hidden settings from previous years", "rating": "3.0"},
{"text": "Samsung customer service sucks.They sold a lemon phone.Camera is not working properly and takes blurry pictures and does not connect to a computer.Took it to a repair shop that I was sent to by samsung.They said there is an issue with a motherboard, and phone will need to be sent to samsung for repairs, which take on average 11 days.  As a part of their policy, they do not offer replacement phones.Per samsung rep, there is nothing they can do.  I guess it could be a good phone, when they dont sell you a lemon.", "title": "samsung sold a lemon phone, they dont offer replacements.", "rating": "1.0"},
{"text": "Phone was packaged good and is very nice no problem putting in my Sim card or working.  Very clear pictures.  5G is considerably fast on TMobile .  Awesome phone.", "title": "Awesome 5G phone", "rating": "5.0"},
{"text": "As I Galaxy Note fan since the Note 2, I finally decided to upgrade from my beloved Note 8 to the Ultra 22. I am sooooo glad I did not trade my phone! The Ultra 22 started out promising with zest and a premium feel. I spent at least $200 trying to find the perfect case and screen protector for my 4-5 year, $1271 investment only to have it give me the black screen of death on day 29. I called Samsung who sent me to UbreakIfixit. They pronounced my phone d.o.a. Samsung then played hot potato after telling me it would cost me to have them service the phone. I then called Amazon only for them to try to shift it to Samsung. Samsung had already told me about the 30 day Amazon money back guarantee. The Amazon rep tried to say it had been more than 30 days when I called them on day 30. Now I am stuck waiting for UPS to pick up the dead phone to process a full refund. It has been 3 days now. My local UPS driver did not have the shipping label on day 1. They didn't bother to show on day 2. What a world!I have never been let down by Samsung before. By far my worst experience with any phone! I am even thinking of switching to Apple now. As much of a Note/Android/Samsung fanatic I have been over the years, I am not sure what to do next. But I am sure that I will hold to my fully functional Note 8 until it dies. It surely has lasted me for more than 29 days!", "title": "Phone Bricked in Less Than 30 days!", "rating": "1.0"},
{"text": "I have used a Galaxy S series for the last 7 or 8 years.. I always got the top of the line every year.This Phone has the worst battery life I have ever seen. To me it was such a problem I returned it, spent $500 to replace the motherboard on my S21 ultra and will use it again. SORRY", "title": "Great phone, to expensive & the worst battery life.", "rating": "3.0"},
{"text": "Battery life sucks. I don't like the one side only controls nor the Bluetooth only headset option. Pictures are much nicer than my older version and videos are nice. But if the phone is dead or dying most of the time, having all the extras is pointless because you can't enjoy them without worrying your phone will die.", "title": "Over-rated", "rating": "3.0"},
{"text": "Great phone. Nothing negative to say. Phone arrived on time, new and unblemished. Very happy with it.", "title": "Thumbs up", "rating": "5.0"},
{"text": "It feels so nice while holding it, the phone feels prenium again. It doesn't get sticky or doesn't get fingerprints all over.", "title": "It's amazing!!!", "rating": "5.0"},
{"text": "DO NOT BUY IF YOU USE TMOBILE IN USA - Unlocked phones are not compatible with T-Mobile. I have dropped calls, people cant call me but I can call out, my hotspot is now 0.60/mbps down, my data is getting 500/mbps but I am having so many connection issues with my hotspot,  before it was closer to 60/mbps, unlocked phones are not configured for the TMobile network so they're not 100% compatible. I am running 2 phones next to each other, my note 8 from Tmobile is getting 75mbps on hotspot but the unlocked s22 is getting 0.60/mbps, upgraded sim, checked settings, restarted, checked account settings, its been escalated, but theyre telling me its because its an UNLOCKED phone not configured specially for Tmobile. I uploaded 2 speed test, one with my old note 8 and one with the s22 unlocked ultra, using the same pc and wifi, same tmobile network, SAME ACCOUNT, I have 4 lines with T-mobile. All 4 lines have unlimited hotspot and same speeds.", "title": "Unlocked phones are not compatible with T-mobile", "rating": "1.0"},
{"text": "this phone if you can keep it in pristine condition all your life; is a great phone. But for me, its way too heavy for me to enjoy it. It makes my pants sag, and worst of all i dropped it and it just instantly shattered and got a line on it... might I add WITH a OTTERBOX case on it. edges a bit sharp, but a case can fix that. its an OK phone", "title": "not durable", "rating": "2.0"},
{"text": "Got mine around a year ago. Wake up six months ago and go to take a picture and the camera does not work. Hardware used in this is so cheap. Here I am in 2023 with a cameraless phone now...", "title": "D'ont buy this!", "rating": "2.0"},
{"text": "Finally decided to make the switch from iOS to Android. Very happy with the decision. Obviously a bit of a learning curve but other than occasional issues with the fingerprint reader, this has been an awesome phone.", "title": "Great Phone!!", "rating": "5.0"},
{"text": "I upgraded from my OnePlus 7 Pro, and the only upgrade was the larger screen and the stylus.Samsung locks down far too much of the system and add too much bloatware. I had to rip most of it out.The battery life is subpar... It barely lasts a day even with added Bixby routines to reduce resolution, enable power saving, and turn off features.I hated Samsung's launcher and navigation with this phone. I ditched the launcher since it was behind in customization compared to oxygenos. I especially hate having to use Samsung's app store to download additional apps that COULD HAVE BEEN BAKED INTO THE SETTINGS AND OS... I shouldn't have to download an app to make a specific theme or lock screen. Even to change the sound menu and drop down menu is in an app to change it.I know I won't be getting the s23 or any Samsung device again.", "title": "Form-factor is nice, but software and hardware are not worth the price. Samsung ruined it.", "rating": "1.0"},
{"text": "I must commend this supplier. The phone was packaged excellently, very secured and came as ordered, factory sealed. Will definitely do business with them again.", "title": "Completely satisfied with purchase from OE USA", "rating": "5.0"},
{"text": "This phone is definitely the ultimate  Android phone. Best screen, best cameras, latest processor, and the S-Pen. I absolutely love this phone. I have no regrets whatsoever.", "title": "The Absolute Android Device", "rating": "5.0"},
{"text": "Samsung claims 45W charging on the S22 Ultra, but using a USB C test meter, I've never seen more than 30 W. Maybe there's some point in the charger cycle where it hits 45W for a few minutes, but it's definitely not a sustained charging rate. You can find videos online showing that using a 25W charger vs using a 45W charger barely makes any difference. Don't waste your money buying a high power charging brick. You won't benefit from anything over 25W.", "title": "45W charging is a lie", "rating": "3.0"},
{"text": "La batería dura bastante si no lo usas,  pero el uso regular que le doy al celular consume mucho la batería,  pero de todo lo demás me encantó el celular", "title": "Me fascina el S22 ultra", "rating": "5.0"},
{"text": "Very good phone. Love the quality of the pictures, much better than IPhone.", "title": "Great phone!", "rating": "5.0"},
{"text": "The picture quality from the camera is amazing. The screen is crystal clear and the birghtess I've ever used. The refresh rate is second to none. And being an avid Note owner, I love the stylis being included. It is truly a Note worthy device.", "title": "Great phone. Awesome camera. It's an S series and Note combined. Love it!", "rating": "5.0"},
{"text": "What I do not like, have to hold volume down button and of button same time to get to power down", "title": "Great phone", "rating": "3.0"},
{"text": "I came from a Note 8...so this phone is just fabulous and fast!", "title": "Love It", "rating": "5.0"},
{"text": "Simply the best camera phone. 🤳  👍 zoom 10x  and 100x. Can even capture the moon", "title": "Simply the best camera phone. 🤳  👍", "rating": "5.0"},
{"text": "The camera using the flash light is terrible.Worst than S10.Generally speaking,  S22 ultra compare with old models is worse", "title": "S22 ultra , the camera worse camera ever !", "rating": "2.0"},
{"text": "When im trying to sign documents the pen doesn't work on certain parts of the screen", "title": "S Pen does not write on certain parts of the screen", "rating": "3.0"},
{"text": "It's not much diferent than my previous Note 10+, only hw upgraded, with the latest software upgrades both are almost identical, but it's an excelent phone, i'm very satisfied.", "title": "Best Android Phone. so far.", "rating": "5.0"},
{"text": "Una buena compra y un 10 de 10", "title": "El teleno perfecto 👌", "rating": "5.0"},
{"text": "Excelente choice no regrets", "title": "Great cellphone", "rating": "5.0"},
{"text": "Everything about this phone is awesome.  I upgraded from a Samsung note 10+", "title": "Best phone out there.", "rating": "5.0"},
{"text": "Red flashing dot appears on screen and blinks. There is no registered 5g service anywhere. Asked for a replacement since I paid in full for this product and it was expensive and supposedly brand new. Amazon said they would replace and I send old device back.I then received and email explaining that the phone was a high value item and could not be replaced. I could purchase another. However the new one cost $100 more currently and would not reach me in time for the data transfer from phone to phone. Amazon states I need to return the phone within 3 days. However a new device through Amazon would not reach me for weeks. I stated that's not really fair. Amazon states that's too bad and proceeds to hang up because there is nothing else to be done. Bad phone, bad service, bad all around. Still waiting over a month for refund and they won't give it back. Still fighting with them.Update: still fighting 30 days later for a refund. They received the item back Sept 16th and refuse to examine it or update file so that I may get refund. 30 day minimum wait for them to even look at it.", "title": "Poor product and worse service", "rating": "1.0"},
{"text": "I didn't get a chance to try it out .  Would not work with xfinity system.", "title": "This phone does not work with the xfinity network.", "rating": "3.0"},
{"text": "This replaced a Note 10.  Loving this phone.", "title": "Great phone", "rating": "5.0"},
{"text": "The screen should have privacy features and the charger cord is too short.and for that price throw in some ear bugs OK (Lol)", "title": "All the features are good and navigation is perfect. This will be a perfect phone for my wife’s", "rating": "5.0"},
{"text": "Phone box was not sealed both security stickers were missing phone seems to be good", "title": "Phone box was not sealed both stickers were missing phone seems to be ok", "rating": "3.0"},
{"text": "This is worth the money", "title": "This is worth the money", "rating": "5.0"},
{"text": "Me encanta, se siente muy bien. Todo funciona de maravilla. Super recomendado.", "title": "Excelente", "rating": "5.0"},
{"text": "Todo bien en tiempo y forma", "title": "Todo bien en tiempo y forma", "rating": "5.0"},
{"text": "Fue lo mejorExcelente servicio", "title": "Muy buen servicio", "rating": "5.0"},
{"text": "All I can say is, WOW! This is by far the best phone I have ever owned. Only complaint I have is the phone gets a little warm when I wireless charge it.", "title": "The one to rule them all!", "rating": "5.0"},
{"text": "Red flashing dot appears on screen and blinks. There is no registered 5g service anywhere. Asked for a replacement since I paid in full for this product and it was expensive and supposedly brand new. Amazon said they would replace and I send old device back.I then received and email explaining that the phone was a high value item and could not be replaced. I could purchase another. However the new one cost $100 more currently and would not reach me in time for the data transfer from phone to phone. Amazon states I need to return the phone within 3 days. However a new device through Amazon would not reach me for weeks. I stated that's not really fair. Amazon states that's too bad and proceeds to hang up because there is nothing else to be done. Bad phone, bad service, bad all around. Still waiting over a month for refund and they won't give it back. Still fighting with them.Update: still fighting 30 days later for a refund. They received the item back Sept 16th and refuse to examine it or update file so that I may get refund. 30 day minimum wait for them to even look at it.", "title": "Poor product and worse service", "rating": "1.0"},
{"text": "I didn't get a chance to try it out .  Would not work with xfinity system.", "title": "This phone does not work with the xfinity network.", "rating": "3.0"},
{"text": "This replaced a Note 10.  Loving this phone.", "title": "Great phone", "rating": "5.0"},
{"text": "The screen should have privacy features and the charger cord is too short.and for that price throw in some ear bugs OK (Lol)", "title": "All the features are good and navigation is perfect. This will be a perfect phone for my wife’s", "rating": "5.0"},
{"text": "Phone box was not sealed both security stickers were missing phone seems to be good", "title": "Phone box was not sealed both stickers were missing phone seems to be ok", "rating": "3.0"},
{"text": "This is worth the money", "title": "This is worth the money", "rating": "5.0"},
{"text": "Me encanta, se siente muy bien. Todo funciona de maravilla. Super recomendado.", "title": "Excelente", "rating": "5.0"},
{"text": "Todo bien en tiempo y forma", "title": "Todo bien en tiempo y forma", "rating": "5.0"},
{"text": "Fue lo mejorExcelente servicio", "title": "Muy buen servicio", "rating": "5.0"},
{"text": "All I can say is, WOW! This is by far the best phone I have ever owned. Only complaint I have is the phone gets a little warm when I wireless charge it.", "title": "The one to rule them all!", "rating": "5.0"},
{"text": "Red flashing dot appears on screen and blinks. There is no registered 5g service anywhere. Asked for a replacement since I paid in full for this product and it was expensive and supposedly brand new. Amazon said they would replace and I send old device back.I then received and email explaining that the phone was a high value item and could not be replaced. I could purchase another. However the new one cost $100 more currently and would not reach me in time for the data transfer from phone to phone. Amazon states I need to return the phone within 3 days. However a new device through Amazon would not reach me for weeks. I stated that's not really fair. Amazon states that's too bad and proceeds to hang up because there is nothing else to be done. Bad phone, bad service, bad all around. Still waiting over a month for refund and they won't give it back. Still fighting with them.Update: still fighting 30 days later for a refund. They received the item back Sept 16th and refuse to examine it or update file so that I may get refund. 30 day minimum wait for them to even look at it.", "title": "Poor product and worse service", "rating": "1.0"},
{"text": "I didn't get a chance to try it out .  Would not work with xfinity system.", "title": "This phone does not work with the xfinity network.", "rating": "3.0"},
{"text": "This replaced a Note 10.  Loving this phone.", "title": "Great phone", "rating": "5.0"},
{"text": "The screen should have privacy features and the charger cord is too short.and for that price throw in some ear bugs OK (Lol)", "title": "All the features are good and navigation is perfect. This will be a perfect phone for my wife’s", "rating": "5.0"},
{"text": "Phone box was not sealed both security stickers were missing phone seems to be good", "title": "Phone box was not sealed both stickers were missing phone seems to be ok", "rating": "3.0"},
{"text": "This is worth the money", "title": "This is worth the money", "rating": "5.0"},
{"text": "Me encanta, se siente muy bien. Todo funciona de maravilla. Super recomendado.", "title": "Excelente", "rating": "5.0"},
{"text": "Todo bien en tiempo y forma", "title": "Todo bien en tiempo y forma", "rating": "5.0"},
{"text": "Fue lo mejorExcelente servicio", "title": "Muy buen servicio", "rating": "5.0"},
{"text": "All I can say is, WOW! This is by far the best phone I have ever owned. Only complaint I have is the phone gets a little warm when I wireless charge it.", "title": "The one to rule them all!", "rating": "5.0"},
{"text": "Red flashing dot appears on screen and blinks. There is no registered 5g service anywhere. Asked for a replacement since I paid in full for this product and it was expensive and supposedly brand new. Amazon said they would replace and I send old device back.I then received and email explaining that the phone was a high value item and could not be replaced. I could purchase another. However the new one cost $100 more currently and would not reach me in time for the data transfer from phone to phone. Amazon states I need to return the phone within 3 days. However a new device through Amazon would not reach me for weeks. I stated that's not really fair. Amazon states that's too bad and proceeds to hang up because there is nothing else to be done. Bad phone, bad service, bad all around. Still waiting over a month for refund and they won't give it back. Still fighting with them.Update: still fighting 30 days later for a refund. They received the item back Sept 16th and refuse to examine it or update file so that I may get refund. 30 day minimum wait for them to even look at it.", "title": "Poor product and worse service", "rating": "1.0"},
{"text": "I didn't get a chance to try it out .  Would not work with xfinity system.", "title": "This phone does not work with the xfinity network.", "rating": "3.0"},
{"text": "This replaced a Note 10.  Loving this phone.", "title": "Great phone", "rating": "5.0"},
{"text": "The screen should have privacy features and the charger cord is too short.and for that price throw in some ear bugs OK (Lol)", "title": "All the features are good and navigation is perfect. This will be a perfect phone for my wife’s", "rating": "5.0"},
{"text": "Phone box was not sealed both security stickers were missing phone seems to be good", "title": "Phone box was not sealed both stickers were missing phone seems to be ok", "rating": "3.0"},
{"text": "This is worth the money", "title": "This is worth the money", "rating": "5.0"},
{"text": "Me encanta, se siente muy bien. Todo funciona de maravilla. Super recomendado.", "title": "Excelente", "rating": "5.0"},
{"text": "Todo bien en tiempo y forma", "title": "Todo bien en tiempo y forma", "rating": "5.0"},
{"text": "Fue lo mejorExcelente servicio", "title": "Muy buen servicio", "rating": "5.0"},
{"text": "All I can say is, WOW! This is by far the best phone I have ever owned. Only complaint I have is the phone gets a little warm when I wireless charge it.", "title": "The one to rule them all!", "rating": "5.0"}
]