[
    [
        {
            "title": "Such an epic camera",
            "rating": "5.0 out of 5 stars",
            "body": "I purchased this phone and I think this phone has a lot of great potential going for it. My daily phone I use a lot is a pixel 4A and it's useful it gets the job done the form factor is perfect for my hands. So after I got the pixel 7 for two days, I immediately liked it a lot the camera is awesome everything is smooth it runs fast but the more I held it it's just to big.. I'm one with a pixel 4A where I can reach my thumb to pull down the notification easily. The pixel 7 you have to use two hands to pull down the notifications ?!!, I'm sure there is a option in the settings with one thumb functions but I didn't find it. There is a lot of Pluses for the pixel 7 but I just think when you have your right thumb trying to reach the other side of the phone its really annoying. Bigger is not always better. I just like smaller phones easy to hold easier to put into your pocket... And lastly this phones back is so slippery placing it anywhere couch, table this dang thing slides so much you'll think it has the cheapest back cover brakes known to man. And lastly...The sides of this phone is so very slippery too.. Yo it's like a small child about to eat an ice cream cone as he grabs it lightly then suddenly the top of the vanilla ice cream pops out of his hands. Idk if it's just to coating on it just felt heavy one handed use."
        },
        {
            "title": "Excellent camera",
            "rating": "5.0 out of 5 stars",
            "body": "this phone is great. very apple-like OS experience, everything is fluid, simple and just works. simply the best android phone I have ever tested. unfortunately not everything is perfect and the fingerprint sensor takes a few weeks to get the hang of and is far from the best in the marked. battery is decent. no native app lock for sensitive data like banks, pics, whatsapp. nevertheless, for the price, it is BY FAR the best you could purchase."
        },
        {
            "title": "I love it so much",
            "rating": "5.0 out of 5 stars",
            "body": "Battery life is incredible. Haven't charged my phone in 4 days Lol I barely use the camera but my little nephew likes it always taking selfies in the mirror LMAO the Google Pixel is super smart. I feel like I'm on my computer half of the time do the world a favor and throw away your iPhones and get your family a Google Pixel 7"
        },
        {
            "title": "I love it so much",
            "rating": "5.0 out of 5 stars",
            "body": "The reception is really good, my previous phone would get H+ where i live, this one gets LTE and it is fast. Face unlock works great, finger print sensor works great. The battery is all day easy. the screen is nice and bright in the sun. The phone fits nice in the hand and feels awesome. Wireless charging works good. It is not that heavy at all. You get updates the day they come out for android, unlike the other android phones. You have WAY more freedom with the phone compared to apple. Extremely happy with the value for my dollar."
        },
        {
            "title": "I love it so much",
            "rating": "5.0 out of 5 stars",
            "body": "I will delay a full review until I have more information. The single adapter cord doesn't adapt to standard A type female end found on most plug in chargers (You will need to order a two ended male A cord connected to the single included adaptor.) Next you may find that the SIM card holder doesn't release enough to remove it from the phone by inserting the key which is included. Even after using tweezers and exacto knife I was unable to pull it out. Finally, by inserting the key and holding it an angle, I was able to prey the holder out (This isn't the way its' supposed to be)"
        },
        {
            "title": "I love it so much",
            "rating": "5.0 out of 5 stars",
            "body": "-The screen on this device is really poorly calibrated. It has a very yellow tint that is very noticeable when watching video, it can't display true white (looks creamy) or sky blue (has a greenish hue). The background looks pixelated after unlocking until you scroll, not sure what that's about. If it's attempting to save battery, it's not doing much. It burns thru battery like the 3 year old phone it was meant to replace. It gets hot in hand even thru the case just while web browsing. The fingerprint sensor is basically useless. I haven't tested the camera, can't trust the colors on the screen anyway. I would say this is more comparable to a budget phone than it is to a premium device. My previous 2 devices were Moto G variants that I paid significantly less for and was much more satisfied with right out of the box. My wife loves her 4a which is what led me to the Pixel but aside from having a larger screen and a more upscale exterior, the 7 isn't a better device in practice from what I can tell."
        },
        {
            "title": "I love it so much",
            "rating": "5.0 out of 5 stars",
            "body": "Used the phone for less than 24 hours before it stopped working. When it did work I lost service constantly then the phone suddenly could not read my sim card and I no longer had service. Turned out the IMEI! number disappeared from the phone and nothing could be done due a corrupted operating system. It really sucked as I did not have a backup phone and I really liked the feel of the Pixel. I had to buy another phone and sim card. I am returning this phone and do not think I will be getting another one. It was too much of a hassle and very stressful. Cost me an extra $50 to get the phone looked at by my service provider." 
        },
        {
            "title": "I love it so much",
            "rating": "5.0 out of 5 stars",
            "body": "It is a nice phone, but doesn't feel like an upgrade from my 5a, so I returned it. Yeah it is faster, but it also runs hotter and seemed to last 1/2 as long. I get 2+ days on a charge on my 5a - the 7 only lasted 24 hrs or so. Couldn't see any difference in the photo quality. Fingerprint reader on 5a works like 90% of the time. I was getting maybe 75% of the time with the in-screen reader on the 7 and the face recognition was useless as far as I could tell. 90hz refresh doesn't do anything for me - would never notice a difference. The 7 has wireless charging, but I would never use that because I prefer a wallet case so I guess if that is important to you. Google is practically giving them away now - reduced to 450 and then they were giving me 250 on trade-in, so I took a shot. meh"
        }
    ]
]