[{"text": "I like the kit.  It's a good quality and I can use it at different types of events. I just needed to add some extra tools to make it a full bartender's kit. But I am really happy with the purchase.", "title": "Good quality kit", "rating": "5", "source": "wallmart"},
{"text": "i have constantly wanted a bar set & sooner or later it right here. This bar set is general size and the holder is small (this is a superb factor) while all gadgets are area inside, it nicely put together & functional. now not to mention if you have a small bar or confined counter top area, this set is perfect for you.", "title": "lovable & functional for a bar", "rating": "5", "source": "wallmart"},
{"text": "This set has the whole thing which you want to make and drink you could think of that is not frozen. the whole thing is very strong and well made. The recipe cards are good enough however now not really proposing any liquids that are not already widely known.", "title": "splendid set and nicely made", "rating": "5", "source": "wallmart"},
{"text": "I couldn't decide between the black or silver set, however ended up going with the traditional silver set and i am so satisfied I did! as it turns out the silver is rust proof and can be located within the dishwasher. that could be a definite win in my ebook.", "title": "first-class Shaker Set", "rating": "5", "source": "wallmart"},
{"text": "This package has the whole thing! i have been trying a boston shaker and the one included is best. we've got used every device on this kit. the whole thing is excessive excellent and clean to easy. The gear fit nicely in the base, making it clean to transport around with out pieces falling out. terrific present for any domestic bartender, beginner or seasoned.", "title": "Perfection", "rating": "5", "source": "wallmart"},
{"text": "My husband and i've a basement bar we built to entertain friends inside the bloodless months, but we did not have a shot shaker set so we got this. it is the whole lot you want for an at home bartender set. Love this set and its so clean to use. I see masses of pictures in our future.", "title": "ideal addition to our bar.", "rating": "5", "source": "wallmart"},
{"text": "This bar tending kit is very excellent looking and has all of the basic equipment you want for bartending (even domestic bars), you've got the whole lot right to hand. The stand is satisfactory looking but additionally smooth to hold. thus far the items from it that i've used all paintings as they should. this is a pleasant upgrade to my bar.", "title": "lovely and sensible", "rating": "5", "source": "wallmart"},
{"text": "I got this as a housewarming present for my bf and he made us more than one liquids that . He loved it!! expert, easy set to clean, simply so cute to add to the kitchen. I additionally purchased the ingesting sheet and a cocktailbook. I could be buying this once more as a marriage present", "title": "purchase this!!!!", "rating": "5", "source": "wallmart"},
{"text": "i bought this for my son whilst he became deployed. We set him up a bar and it had the whole thing he needed for it whilst he back. this is a sharp looking set, and the fee was exquisite. He cherished it. i would suggest shopping. He become also pleasantly amazed together with his bar.", "title": "VERY high-quality", "rating": "5", "source": "wallmart"},
{"text": "you may need to upgrade in some unspecified time in the future due to the fact these aren't very long lasting. they will however do the task! It comes with the entirety you need to start making beverages and the stand it comes with may be very satisfactory to store the gadgets on.", "title": "fine Starter Set", "rating": "3", "source": "wallmart"},
{"text": "i am a amateur at mixing cocktails but this set offers you the entirety you need to make tasty grownup beverages. the whole thing works as it's speculated to and everything is made out of top notch materials. if you want something that is practical and is constructed to remaining that is it!", "title": "Cocktail necessities!", "rating": "5", "source": "wallmart"},
{"text": "i've been a bartender for over 20 years, so I know ninety five% of people might not use all of the items on here. For me it just looks neat and funky. And in case you use it, it's going to make you appear to be a real bartender or at least state-of-the-art hahaha. really adds a pleasing accessory to your counter or bar pinnacle.", "title": "high-quality little cocktail package", "rating": "5", "source": "wallmart"},
{"text": "This bar set is lovely and practical. it's smooth to use and easy to clean, and i get compliments on it whenever a person comes over. The muddler is the excessive point — it's miles wonderful. It also comes with two strainers which i really like for cocktails with pulp.", "title": "wonderful bar set", "rating": "5", "source": "wallmart"},
{"text": "this is a really perfect bar package for a birthday gift, residence warming, or only for making wonderful cocktails at home. You genuinely get what you pay for and it is ideal excellent. handy stand keeps everything in location and now not just lost in a drawer. I incredibly propose this package.", "title": "exquisite package for cocktails at domestic", "rating": "5", "source": "wallmart"},
{"text": "This set is top notch ! It brings recipe cards to get commenced and comes with the whole thing inside the picture (besides for the drinks of direction!) I can't even start to inform you how inspired our pals are whilst they come over and request a drink. You appear like a complete seasoned shaking up and serving drinks. you may have a brilliant time using this.", "title": "seem like a total seasoned subsequent time you have company", "rating": "5", "source": "wallmart"},
{"text": "i am a budding domestic mixologist and changed into looking for a quality set that wouldn't break the bank. I suppose that is tremendous fee for money equipment work well and i've been the usage of it for more than three months with constant effects. in case you're building a domestic bar, that is a no-brainer! simply get it", "title": "Shake, rattle and roll !", "rating": "5", "source": "wallmart"},
{"text": "I tested out my Bartender Set as soon as I got it. i bought some dragon fruit to make a dragon fruit mojito. i'd have to mention the bar smooth set is easy to use. simple sufficient for daily use but has all the vital wishes for any drink. i'm absolutely going to strive out a few more liquids this week.", "title": "excessive quality and smooth to apply and smooth", "rating": "5", "source": "wallmart"},
{"text": "This bar set could be very nicely made. i love the layout. It seems so current. The holder is this type of outstanding way to prepare my bar gear and makes crafting cocktails a breeze. And i really like that it's portable! i can take to my pals houses, on holiday, etc. genuinely notable product!", "title": "extraordinary product!", "rating": "5", "source": "wallmart"},
{"text": "bought as a birthday present. stainless-steel is good high-quality and the overall end of gadgets and stand is extraordinary.\nSmall cocktail e-book is reachable for drink options. might had been right to have a slot to save the ebook as properly.\nbasic i might recommend.", "title": "great product, genuine to photograph.", "rating": "5", "source": "wallmart"},
{"text": "I can not get desirable photographs of those chrome steel items due to all of the reflections, but I did take a picture of the little recipe e-book it got here with and an up near photo of the wood to reveal how properly it became constructed and painted. both the stand and real portions to the kit are of a good deal better best than some other I picked up at the same time (each around 35 dollars on the time of this evaluation).", "title": "plenty better excellent than other kit at identical fee", "rating": "5", "source": "wallmart"},
{"text": "I to start with acquired a set with a cracked bamboo stand so I reached out to the manufacturer who replied very directly. as opposed to replacing the original set, they set the apparent set with the identical bamboo rack. I give it five stars for their set off and generous reaction. otherwise, the jet black set appears splendid.", "title": "first rate customer service", "rating": "5", "source": "wallmart"},
{"text": "What I without a doubt loved about this cocktail package is that there was no plastic packaging! It simply proves that manufacturers can still give a lot fee to their products at the same time as nonetheless being environmentally aware.\nThe herbal bamboo stand fits my rustic cabin home, it is literally the center piece of my kitchen counter now.\nA should for all people who likes to make cocktails at events!", "title": "in which functionality and beauty collide", "rating": "5", "source": "wallmart"},
{"text": "look ahead to the usage of this product increasingly. super stylish and nicely made. the only component that I surely like are the distinctive add-ons that come within the set. The pour spouts and excellent strainer are the extra pieces with a view to raise your cocktails to the subsequent level", "title": "fashionable and best", "rating": "5", "source": "wallmart"},
{"text": "i'm impressed with the kit, had been mixing liquids given that Thanksgiving and the whole thing in the package has been useful. one of the portions in the package had a end defect. I contacted the organisation and turned into happy to find out that their customer support is first-rate. They sent out a alternative component right away. My kit is now whole and looking perfect.", "title": "amazing starter kit that has the entirety you want", "rating": "5", "source": "wallmart"},
{"text": "I think the stand itself accounts for greater value and the producers placed less cash on the products themself. therefore, I suppose the products themself aren't really worth the cash. as an instance, the metal cups appearance too thin and no longer excessive first-class.", "title": "need to enhance the excellent", "rating": "3", "source": "wallmart"},
{"text": "i used to be amazed by means of its best specially the rate. I ordered 2 unique makers earlier than with better price however i stopped up returning because of poor first-rate of the immaculate. but i'm able to hold this set for positive, I liked them loads.", "title": "Wow! i really like it", "rating": "5", "source": "wallmart"},
{"text": "that is one of the great units for the money for any home bartender.\nThe tins are tremendous, proper size, and i really like how they nest collectively.\nThe muddler is stable steel, so no worries about mould.\nThe strainer is high first-class and just the right mesh size.\nThe jigger is strong and properly weighted, even though I do wish there has been a 1/4oz mark however that's a non-public desire.", "title": "high-quality bang for your greenback", "rating": "5", "source": "wallmart"},
{"text": "apparently a stunning set. hopefully it will ultimate with wear. simply unpacked, washed and set it up nowadays. disillusioned that the spoon stop would not match in the specified hollow slot. became truly not cut as it should be for the right length. Love the herbal appearance of the bamboo. could admire a replacement with proper sized spoon fit in identical material. thank you", "title": "appears simply proper but mixing spoon would not fit in bamboo round cut out area", "rating": "3", "source": "wallmart"},
{"text": "super package for making all varieties of cocktails. brilliant nice and excellent customer support. also got here with guarantee that's exceptional. i am excited for all of the cocktails i will be making.", "title": "terrific bartender kit", "rating": "5", "source": "wallmart"},
{"text": "I were given this for my boyfriends birthday and he cherished that it got here with certainly the whole thing he wished and a cute little recipe book. It looks high-quality within the kitchen as nicely", "title": "fantastic present for bartender", "rating": "5", "source": "wallmart"},
{"text": "This element is as proven. Does the job. excessive excellent product with excessive excellent materials and a complicated appearance. The cocktail e-book became an brought plus which made me get this one over the others.", "title": "What greater ought to you ask for?", "rating": "5", "source": "wallmart"},
{"text": "This set is of very high exceptional! this is ideal for all people seeking to upgrade or start their cocktail making at home. i might clearly buy this as a present. The black set is what I were given and looks incredible!", "title": "quality Bartending Set!", "rating": "5", "source": "wallmart"},
{"text": "i really like this set. It has the entirety had to conjure up any fashion of beverages the wife or lady friend needs to get over each other. don't go away your bedroom with out it.", "title": "For the start or experienced Bartender", "rating": "3", "source": "wallmart"},
{"text": "sturdy product, excessive pleasant chrome steel, plus it comes with a 30 drink recipe book. The bamboo stand is a pleasant contact. I need to paintings on getting all of the right glassware subsequent. what's a high ball glass, for example?", "title": "It would not get a good deal higher than this one.", "rating": "5", "source": "wallmart"},
{"text": "The satisfactory bartender kit! Comes with the entirety you could possibly need. I loved the recipe ebook that got here with the package, such a lot of a laugh new recipes to strive. this kind of brilliant addition to my bar cart!", "title": "You need it!", "rating": "5", "source": "wallmart"},
{"text": "got it for my wife and she or he thinks it is the Bee's Knees! very complete set and to this point has now not imploded into it a microscopic black hole, she has spent the pandemic turning into a Hipster mixologist, so there's that...", "title": "gift to the wife, she loves it!", "rating": "5", "source": "wallmart"},
{"text": "We ordered this set based totally on evaluations. Upon arrival we were in no way disenchanted. The exceptional changed into beyond our expectations. So satisfied we were given this set. this is our first set and so happy we sold this one.", "title": "thoroughly made!", "rating": "5", "source": "wallmart"},
{"text": "The barware is first-rate. The holder arrived in 1.2 million pieces. The glue joints all failed and the grain failed everywhere there was a hollow. now not even worth seeking to glue returned collectively, Tiny pieces anywhere.", "title": "Holder desires paintings, barware is exceptional.", "rating": "3", "source": "wallmart"},
{"text": "This product is cute! looks fantastic on my bar cart and i like that every one the pieces are dishwasher secure. It comes with everything you need and looks so fashionable.", "title": "Dishwasher pleasant!", "rating": "5", "source": "wallmart"},
{"text": "After reviewing many brands, I selected this set. I just obtained it and am so impressed with the nice!!!! you will no longer be disenchanted should you make a decision to order.", "title": "first-class bar set", "rating": "5", "source": "wallmart"},
{"text": "I experience analyzing articles on making cocktails and become given this bartender package as a gift. i was quite impressed with the numerous portions and look ahead to making my very own very quickly.", "title": "great bartender package for beginners.", "rating": "5", "source": "wallmart"},
{"text": "Took of venture with none reviews posted to read... very glad with what arrived today! everything was precisely as described & looked much like the listing. We aren't any professional on those bar kits, but we're impressed with the whole lot!", "title": "Very satisfied with our buy!", "rating": "5", "source": "wallmart"},
{"text": "Gave to my nephew as a present and he absolutely likes it. He stated he wishes to discover ways to make a gaggle of different types of beverages considering that he has the device now. The lifestyles of a university student.", "title": "Nephew cherished it!", "rating": "5", "source": "wallmart"},
{"text": "suitable set for the charge. the entirety seems well made. Jigger is .5 and 1 ounce. Plan on shopping a everyday size one. If jigger become ordinary length this would be 5 stars.", "title": "correct set but plan on buying a full length jigger", "rating": "3", "source": "wallmart"},
{"text": "First the darkish chrome steel finish is splendid and compliments kitchen home equipment well. The bartending package comes with the whole lot had to make the ideal cocktail for you or your visitors.", "title": "Bartending package", "rating": "5", "source": "wallmart"},
{"text": "everything came as promised. I truly love the shaker because it mixes liquids extremely properly while additionally making them fantastic cold. The lime squeezer could be very sturdy and awesome addition as well!", "title": "exceptional Bar set", "rating": "5", "source": "wallmart"},
{"text": "The set is lovely and nicely made and has all of the crucial cocktail drink making tools and love that it has a e book with recipes. appears exquisite sitting on my bar. love it.", "title": "beautiful Set", "rating": "5", "source": "wallmart"},
{"text": "I idea this will be a nice compliment to my domestic bar, truly till now, I had constantly wanted a hard and fast. So after getting to know many of them obtainable I determined to buy this unit. whilst arrived it became a very best whole set with a bamboo mild wood base and mid gauge stainless-steel accessories.", "title": "just mix it actual precise", "rating": "5", "source": "wallmart"},
{"text": "The shaker in the % isn't always the one that got here with it. I just choose the only I already had simply due to the fact I thought the black pinnacle broke up all the stainless steel. all the gadgets are made relatively nicely and all and sundry that has seen it has commented on how pleasant it looks!", "title": "Love the whole lot", "rating": "5", "source": "wallmart"},
{"text": "superb fee. i am inspired with the quality of the gadgets as well as the stable construct of the bottom. The way it's miles packaged makes for an excellent gift. I also respect the recipe cards which are blanketed. great starter package for a person looking for the simple equipment essential to create craft cocktails at domestic.", "title": "Very excessive quality package", "rating": "5", "source": "wallmart"},
{"text": "i purchased this as a housewarming gift for my patron, however once I noticed how lovable the field changed into while it arrived, I just couldn't forestall myself from commencing the package deal. Lo and behold, the items covered on this set are lovely and certainly feel durable!", "title": "if you're giving this as a gift, I endorse you buy one for yourself too!", "rating": "5", "source": "wallmart"},
{"text": "that is worth each penny! i like the quality of this bartending kit and it is perfect starter set for home bars! i love making cocktails at domestic and this allows make the proper one! Love the customer service, guarantee, and options if to be had. ideal present!!", "title": "Very high excellent bartending package", "rating": "5", "source": "wallmart"},
{"text": "i discovered the blanketed recipes smooth to make. i really like this set because it also comes with a further strainer besides the Hawthorne strainer. i am not a fan of the cobbler shakers in general, they generally tend to leak. i've now and that they each act the same.", "title": "exquisite cobbler shaker set", "rating": "5", "source": "wallmart"},
{"text": "Fellow bartender right here, & can confidently say you might not be dissatisfied. I consider all the utensils are proper exceptional materials & i'm very inspired. got this for the marriage occasions i have scheduled coming up. This offers everything i will want & will look manner extra professional with the stand.", "title": "you can purchase!", "rating": "5", "source": "wallmart"},
{"text": "This became a present for my boyfriend and he cherished it. we've got simplest used it once to this point and we loved the usage of the set. The most effective negative he had to say about the set became that he needs the liquor poures healthy a little tighter in of the bottle of Bulleit though. i might have to say I should agree with him. aside from that, the set may be very appealing and handy to apply!", "title": "quality set!", "rating": "5", "source": "wallmart"},
{"text": "i'm so excited to use this for our Christmas party. From the shaker, to the citrus juicer, to the olive selections, this set has the whole thing you want and more! cherished the tiny brushes to smooth the whole thing too. Giving 4 stars for now until we actually use it and notice the way it all holds up.", "title": "This set has the whole thing", "rating": "3", "source": "wallmart"},
{"text": "What a a laugh, versatile, chic barware set! the whole lot could be very excessive nice and fits into the stand really nicely. i like how all of the special equipment allow me to make quite tons something i can dream up! The stand is a pleasing manner to display this set at home, however I suppose it will additionally make the set tour pleasant.", "title": "An first rate excessive excellent set!", "rating": "5", "source": "wallmart"},
{"text": "i purchased this to give as a present for a few amazing friends at their house warming celebration. I watched because it turned into unboxed, it got here in a nice container that stored the entirety safe in transit, and was very impressed at how every piece had its very own 'domestic' within the base as have been they. i might now not hesitate to buy this set again...plus, you cant beat the truth that the seller consists of a 3 yr anti rust assurance!", "title": "first rate for a gift!", "rating": "5", "source": "wallmart"},
{"text": "The bartender package became sincerely satisfactory. It got here with manner greater portions than I anticipated and it all appears surely nice. we have now not used it but however i am sure it will likely be a great help as we discover ways to make cocktails at home, especially since it came with recipe playing cards for cocktails as nicely!", "title": "Bartender package", "rating": "1", "source": "wallmart"},
{"text": "this is a tremendous gift. the bottom is nice and robust and the entirety has an area. It looks top notch!", "title": "best gift and properly Made.", "rating": "5", "source": "wallmart"},
{"text": "i used to be very inspired by way of the high-quality of this product. It become also packaged thoroughly.", "title": "exquisite first-class!", "rating": "5", "source": "wallmart"},
{"text": "stunning looking bartender package. Makes making cocktails extra fun for us and fancier. Arrived quickly, great great, and love the appearance.", "title": "easy way to make fancy liquids", "rating": "5", "source": "wallmart"},
{"text": "this is a lovely set! sturdy, all the tools. appears suitable at the bar!! ideal present for the home bartender", "title": "lovely", "rating": "5", "source": "wallmart"},
{"text": "i bought as a present for my man and that i use the mixology set extra frequently than him. i was pleasantly amazed with the aid of how first-class the whole lot suit at the bamboo show and the more details that make this set a terrific fee.", "title": "wonderful gift", "rating": "5", "source": "wallmart"},
{"text": "got this as a present. all of us loves it. in case you spend to much cash going out to drink i advise getting this. Recipe book is high-quality and it's stand is excellent cute and clean looking.", "title": "perfect present, fun", "rating": "5", "source": "wallmart"},
{"text": "This set is certainly ideal for our domestic bar! The nice is splendid and all of the objects in the set is ideal for what we need. tremendously suggest this set for your self or as a present.", "title": "beautiful barware set!", "rating": "5", "source": "wallmart"},
{"text": "Husband loved his gift. He used this mixology kit to make wonderful combined liquids for circle of relatives contributors and friends! exquisite celebration and a laugh enjoyment. He failed to dislike no longer one object from this set!!!!", "title": "Husband loves his present!", "rating": "5", "source": "wallmart"},
{"text": "top notch product, professional grade searching. customer support out of this world … cannot wait to shop for extra merchandise from them inside the destiny!!", "title": "professional Grade", "rating": "5", "source": "wallmart"},
{"text": "sold this as a gift for a friend. He loved it. It looks brilliant, is of high-quality exceptional. The available cocktail publication is icing on the cake.", "title": "first rate best product", "rating": "5", "source": "wallmart"},
{"text": "This set is without a doubt gorgeous on display, and being a person that has awful success with cobblers, I didn't experience any leakage! might endorse for every person searching out a great fine and complete set.", "title": "complete and delightful set!", "rating": "5", "source": "wallmart"},
{"text": "i like this bar kit! it's so sleek and is going with my decor. i love how there are so many different equipment to make the ideal drink. And i love the drink playing cards so i'm able to whip up any drink! you'll no longer be disillusioned", "title": "brilliant glossy bartender kit", "rating": "5", "source": "wallmart"},
{"text": "i used to be impressed by way of the excellent of the package and how nicely and well the whole lot fits into it's base. The layout was very first-rate. The kit has the entirety you need for domestic bartending and looks excellent on a bar cart.", "title": "exceptional bar kit", "rating": "5", "source": "wallmart"},
{"text": "i love this package so very a lot. I got it to begin making higher cocktails, especially martinis. it's far exactly how it is described inside the customer description. the whole lot is of respectable best, cleans nicely. i'm a huge fan!", "title": "actually exquisite for beginners", "rating": "5", "source": "wallmart"},
{"text": "This bar kit comes work clearly the entirety you need to create the perfect cocktail for visitors or for yourself. All objects are fantastic fine and you can inform they'll closing.", "title": "the whole thing you need", "rating": "5", "source": "wallmart"},
{"text": "i have gotten into mixing extended beverages and while my spouse got this for me as a present, it was an on the spot hit!! It has the whole thing from the mixer to garnish picks and it all pairs well!", "title": "amazing buy!", "rating": "5", "source": "wallmart"},
{"text": "first rate kit that we use routinely! the immaculate still paired with the black stand really adds an tremendous sleek accessory to our bae. The portions were great and easy to smooth, superb for parties or blending your favourite evening cocktail.", "title": "great package!", "rating": "5", "source": "wallmart"},
{"text": "I were given this for my brother for his birthday. He loves it. it is first-class exceptional and works extremely good. The few recipes it comes with also are a outstanding bonus!", "title": "the whole thing I wanted and anticipated", "rating": "5", "source": "wallmart"},
{"text": "stable heavy properly great. well packed. really worth it.", "title": "top notch object", "rating": "5", "source": "wallmart"},
{"text": "amazing set. this is literally all you want. completed.", "title": "In house Bartender", "rating": "5", "source": "wallmart"},
{"text": "the whole lot you need on your at home bar", "title": "Love the shade", "rating": "5", "source": "wallmart"},
{"text": "desirable product first-rate, notably encouraged.", "title": "correct product first-rate, exceptionally advocated", "rating": "5", "source": "wallmart"},
{"text": "amazing set, looks correct and works flawlessly.", "title": "incredible best", "rating": "5", "source": "wallmart"},
{"text": "Very giftable, and stunning show. I surely advise.", "title": "fun addition to any kitchen", "rating": "5", "source": "wallmart"},
{"text": "I just like the drink menus", "title": "best Set", "rating": "5", "source": "wallmart"},
{"text": "Love this set. i'm making cocktails just like the execs now.", "title": "splendid fee", "rating": "5", "source": "wallmart"},
{"text": "super to use at a fish fry or every time.", "title": "Versatility", "rating": "5", "source": "wallmart"},
{"text": "Having all the gear I need right at the shelf with my liquor makes it all appearance very classy", "title": "ideal in your liquor display", "rating": "5", "source": "wallmart"},
{"text": "this is the high-quality. it's far a ought to purchase.", "title": "one of the high-quality units i have ever owned. i really like it. it is a should purchase.", "rating": "5", "source": "wallmart"},
{"text": "exceptional starter package for making drinks, and incredible cost for the rate", "title": "best starter kit", "rating": "5", "source": "wallmart"},
{"text": "surely top notch, the whole thing is best and looks so cool!!", "title": "truely purchase!!", "rating": "5", "source": "wallmart"},
{"text": "excellent home set with all wanted objects", "title": "permit the bar begin", "rating": "5", "source": "wallmart"},
{"text": "that's exactly what we bought this for. We gave it at Christmas and our buddies love it!", "title": "super as a present!!!", "rating": "3", "source": "wallmart"},
{"text": "I truly LOVE this bar set! perfect for a home bar or the bar you work at! distinctly suggest!!!", "title": "extremely good bar tools!!!", "rating": "5", "source": "wallmart"},
{"text": "Been the usage of this set for some domestic made cocktails and It has everything I wished!", "title": "A entire set for almost all cocktails for a decent charge!", "rating": "3", "source": "wallmart"},
{"text": "lovely set! I can't wait to make all my delicious cocktails with it!!", "title": "beautiful set!", "rating": "5", "source": "wallmart"},
{"text": "is going with my bar so well! I definitely suggest", "title": "amazing product", "rating": "5", "source": "wallmart"},
{"text": "it's a totally first-rate set and the it additionally seems to be of excellent fine", "title": "this type of lovely package!", "rating": "5", "source": "wallmart"},
{"text": "easy to apply and easy and a lovely addition to any bar setup! and comes with the whole lot!", "title": "one of the exceptional!", "rating": "5", "source": "wallmart"},
{"text": "the entirety you need for a home bar is include. good fee . portions feel stable", "title": "appropriate cost", "rating": "5", "source": "wallmart"},
{"text": "This was a gift to my step son and turned into thoroughly received. He truely loved it.", "title": "fantastic nice!", "rating": "3", "source": "wallmart"},
{"text": "i bought the rose gold set and it is so stunning on my bar. it's far very durable and of good best!!", "title": "lovely!", "rating": "5", "source": "wallmart"},
{"text": "Shake, stress and pour. it's constantly happy hour here at my home. Makes it extra a laugh to entertain guests.", "title": "everything you want to make distinctiveness cocktails", "rating": "5", "source": "wallmart"},
{"text": "Used this for my holiday celebration in December and it was first rate! extremely good easy to smooth and sturdy.", "title": "cherished this Bartender package!", "rating": "4", "source": "wallmart"},
{"text": "all the pieces sense like exceptional. Very strong and well made plus attractive. I think the whole lot a domestic bar cart needs is right here", "title": "Very exceptional!", "rating": "5", "source": "wallmart"},
{"text": "it's excellent! besides i was simply lacking one of the strainers, isn't always a huge deal breaker.", "title": "just lacking a strainer….", "rating": "3", "source": "wallmart"},
{"text": "it is so a whole lot first-class than I expected and excellent customer service. Will purchase for my entire family as a gift.", "title": "excellent", "rating": "5", "source": "wallmart"},
{"text": "I simply received it nowadays and haven't begun to use it however i am inspired through it is pleasant already.", "title": "First influence", "rating": "5", "source": "wallmart"},
{"text": "This bar set is simply what we needed to have handy. It helps keep gear organized instead of chaos in a drawer.", "title": "extremely good bar stand", "rating": "5", "source": "wallmart"},
{"text": "best set, length and quality for us! no longer too huge, not too small and appears exceptional on the counter! Has all of the essential gear!", "title": "ideal set!", "rating": "5", "source": "wallmart"},
{"text": "This issue has quite a few stuff in it and a number of the items are absolutely heavy obligation just like the lime squeezer.", "title": "The lime squeezer is heavy duty and excellent", "rating": "3", "source": "wallmart"},
{"text": "holes were drilled poorly and the needles / selections cannot undergo. come to be throwing them away. The rest portions are cool.", "title": "alternatives can't undergo the hole", "rating": "3", "source": "wallmart"},
{"text": "i've made several beverages with this package already. The portions are all wonderful high-quality and appearance great within the wooden holder. the whole lot fits properly in its domestic and is all saved nicely prepared. I genuinely like this buy.", "title": "looks outstanding", "rating": "5", "source": "wallmart"},
{"text": "This bar device set could be very attractive. It has all the bar equipment you need. The shakers is ideal first-class and excellent of all does no longer leak while you operate it, The wooden holder has an area for each device and makes for an appealing display", "title": "all of the Bar tools you want", "rating": "5", "source": "wallmart"},
{"text": "You can not tell me this does not appearance stunning; aesthetically pleasing and like i've my entire life together!\nI can't wait to have my girlfriends over!\nthese is chrome steel. Comes with a 35 page recipe e book. 15 items listed which includes the stand. The lid for the shaker and the drainer interior the proportion depend as three pieces.\nIt has a three year warranty on it also, if wanted.\nGet this!!", "title": "i love to entertain!", "rating": "5", "source": "wallmart"},
{"text": "just what you need for making combined drinks in particular martinis . very well made nice cocktail set. Rust proof assure and recipes playing cards also blanketed So clean to installation to make drinks, the whole lot you need and all of the tools sit in a single bamboo rack to vicinity on the counter. amazing for enjoyable and would also make a pleasant gift. This set is 5 Stars", "title": "classy Counter Cocktail Set", "rating": "5", "source": "wallmart"},
{"text": "first off allow's talk approximately the rate for everything incredible! at some point I just woke and and thought to myself, I want to start making liquids at domestic permit's discover a package. I checked the reviews and became impressed. it's easy to smooth, brilliant to use & the truth it comes with the stand so it doesn't take up a whole lot area. I genuinely adore it. I will be buying this set for the vacations as a gift.", "title": "LOVE!", "rating": "5", "source": "wallmart"},
{"text": "I got a bit bar cart and it simply did not appear entire without a bartender kit. This package comes packaged so well and that i sense like they notion of the whole lot, they even give you a hard and fast of cards with drink recipes on them! Such a pleasant contact.", "title": "awesome set, very giftable!", "rating": "5", "source": "wallmart"},
{"text": "i am so happy I ordered this bar set! it is very sleek & notable fine for it's cost! Love that the base has a gap for each piece and the internal base has a cutout for every of them to stay in vicinity. i love that it comes with recipe cards. we can be making many, many cocktails with this set. It additionally makes a really perfect present set.", "title": "beautiful bar set that comes with the entirety you want!", "rating": "5", "source": "wallmart"},
{"text": "This set is without a doubt lovely and has the whole lot you need to make a scrumptious drink! i really like that it comes with a stand so i can show it on my home bar. I also genuinely love that the jigger is marked on the inner for accurate measuring when blending beverages.", "title": "beautiful Rose Gold Set", "rating": "5", "source": "wallmart"},
{"text": "We were given this gift from my mother for Christmas and we adore it! we adore the drink card books and it definitely has the whole thing you would want in a starter kit for a little bar. i love the stand due to the fact we do not have a variety of space but the stand continues it all properly together.", "title": "best gift for Christmas", "rating": "5", "source": "wallmart"},
{"text": "This product is nicely thought out and built! Has the entirety one will want. Craftsmanship is stunning and has a three year warranty. The holder is strong and maintains the whole lot in their place. The recipe e book is on point. mistakes evidence beverages, that tastes like a professional made them for you. buy and experience!!", "title": "the whole thing you need", "rating": "5", "source": "wallmart"},
{"text": "i love my new at domestic bartender package! i like how every unmarried piece is stored in a timber stand. The quality of the metallic utilized in each piece is of high standard! it's just the proper length and does not sense bulky at all! fantastically endorse!!!", "title": "top notch pleasant AND PRODUCT!!!", "rating": "5", "source": "wallmart"},
{"text": "worth every penny. i purchased this and the everyday strainer arrived broken and the shaker had a few rust on the lid, the vendor changed it quickly and for the cash, you actually cannot get higher. i might endorse to absolutely everyone trying to entertain at home.", "title": "nice set for the cash", "rating": "3", "source": "wallmart"},
{"text": "i really like this bartender package for myself however it's far a outstanding choice for the holidays or a house warming gift, or just someone who enjoys making cocktails at home. It was tough to choose the end I wanted due to the fact they had been all so terrific. Comes with so many high-quality tools that allows you to take your property cocktail making to the next degree.", "title": "looks first rate, excessive quality! Packaged surely well.", "rating": "5", "source": "wallmart"},
{"text": "truely loved this bartending kit. I used it at the back of the bar for a few hours and it is incredible long lasting. It seems really lovely in my living room region by the bar and is a terrific statement piece. Coming from an industry expert I particularly advocate for any home bartender. It has all the pieces you can occasionally be missing and people little information certainly rely!", "title": "top notch Bartending package", "rating": "5", "source": "wallmart"},
{"text": "It came packaged thoroughly. The equipment have been without a doubt fine and good quality and underneath a three year guarantee. A without a doubt top notch set to make honestly any cocktail you want. The recipe playing cards are wonderful to have on hand, they move over some terrific recipes for traditional cocktails.\nfairly suggest the logo and the product. cannot pass incorrect!", "title": "top notch excessive nice", "rating": "5", "source": "wallmart"},
{"text": "this is my 1/3 cocktail shaker set and by way of a long way my favourite. it's far very heavy obligation I observed as soon as I unboxed it. i have the bamboo/silver Boston Shaker set, and the shaker is the first-class i've used (and that includes restaurant bartending). It creates a outstanding tight seal.", "title": "extremely good set!", "rating": "5", "source": "wallmart"},
{"text": "first-rate set with masses of portions. I a lot prefer the Boston fashion shaker over a cobbler shaker as this fashion does not get stuck. i like that the stand organizes all of the portions within the set making it easy to pick out the item I need. The chrome steel feels properly made and that i respect that every one the pieces are dishwasher secure.", "title": "quality set multi use", "rating": "5", "source": "wallmart"},
{"text": "this is ideal for a domestic bar. The materials are appropriate fine and the package simply looks good. also, the little cocktail recipes e-book is a totally pleasant more.\nThe ice tongs may be higher, i have a tough time conserving the ice with them, especially bigger cubes.", "title": "desirable package", "rating": "5", "source": "wallmart"},
{"text": "splendid best & had everything you can want for an at home bar!", "title": "top notch nice!", "rating": "5", "source": "wallmart"},
{"text": "that is the perfect set. It has the whole thing I want and washed well.", "title": "Prefect!", "rating": "3", "source": "wallmart"},
{"text": "I assume it is a nice set. The shaker isn't a heavy or thick one but it makes a pleasant martini", "title": "Bar Set", "rating": "5", "source": "wallmart"},
{"text": "The product become so much nicer in character! virtually advocate", "title": "great", "rating": "5", "source": "wallmart"},
{"text": "excessive exceptional and really easy to smooth", "title": "excessive satisfactory", "rating": "5", "source": "wallmart"},
{"text": "We got this for my mother in law and she loves it! a lot for a good rate!!", "title": "ideal present!", "rating": "5", "source": "wallmart"},
{"text": "This set appears correct on my counter. i have been the use of it to exercise my mixology abilities", "title": "first-rate set", "rating": "5", "source": "wallmart"},
{"text": "this is an excellent present. Has everything you want to create the precise drink", "title": "totally really worth it", "rating": "5", "source": "wallmart"},
{"text": "Very cool set for the fee!", "title": "pleasant set!", "rating": "5", "source": "wallmart"},
{"text": "My husband did not used this but but he loved it as a gift. first-rate quality", "title": "have not used but", "rating": "5", "source": "wallmart"},
{"text": "Very useful for making my beverages. The stand comes in on hand also. i love it", "title": "first actual Bartender kit!", "rating": "5", "source": "wallmart"},
{"text": "It turned into a gift for my nephew, he enjoy lots and it have a lot stuff", "title": "extraordinary", "rating": "5", "source": "wallmart"},
{"text": "love it a lot i'll be the use of it offen for every event i'm able to.", "title": "Cocktail special", "rating": "5", "source": "wallmart"},
{"text": "sturdy, clean to smooth, easy to apply", "title": "sturdy", "rating": "5", "source": "wallmart"},
{"text": "easy to use & works excellent. Like that it wasn't highly-priced & easy to clean.", "title": "fantastic", "rating": "5", "source": "wallmart"},
{"text": "It became well worth it to me hasn't were given rusty or any of that tremendously advocate it", "title": "nicely spent", "rating": "5", "source": "wallmart"},
{"text": "exquisite gift, all the tools a novice like me needs.", "title": "i like this set", "rating": "5", "source": "wallmart"},
{"text": "Loooove this and such excellent excellent!", "title": "SO first-class!", "rating": "5", "source": "wallmart"},
{"text": "This changed into a great Christmas present", "title": "top gift", "rating": "3", "source": "wallmart"},
{"text": "correct fee for money & giftable", "title": "satisfied with my purchase", "rating": "5", "source": "wallmart"},
{"text": "accurate product and high-quality. superb rate for this package deal. No complaints.", "title": "correct product", "rating": "5", "source": "wallmart"},
{"text": "actually love this set!!", "title": "adore it!!!", "rating": "5", "source": "wallmart"},
{"text": "Love this gift up to now", "title": "super gift", "rating": "5", "source": "wallmart"},
{"text": "the entirety you need in a single package deal. I particularly like this kind of shaker. it's far certainly impossible to get stuck while shaking. all the pieces are well made and beneficial.", "title": "Shaker doesn't get frozen", "rating": "5", "source": "wallmart"},
{"text": "This bartender package is critically the best one ive had. it's sleek, best and even comes with cocktail playing cards. subsequent I need the all black set!", "title": "My new favorite!", "rating": "5", "source": "wallmart"},
{"text": "I had examine different opinions pointing out the item arrived broken or with portions lacking. I cautiously ordered, questioning i might be returning the item, but ours arrived in ideal circumstance.", "title": "best!", "rating": "5", "source": "wallmart"},
{"text": "that is the most complete set I may want to find! The great is likewise wonderful. The juicer by myself is heavy enough to bash some dudes head in. Very happy with my buy, might no longer change it for a one-of-a-kind set", "title": "first rate quality", "rating": "5", "source": "wallmart"},
{"text": "My husband were given this for Father's Day and changed into blown away...the nice is wonderful all of the pieces had been accounted for and loves the timber stand....made Amaretto sour right now", "title": "awesome excellent Product", "rating": "5", "source": "wallmart"},
{"text": "I were given this for my boyfriends birthday and he loves it! The great is simply superb, and it comes with a recipe for special liquids! fairly endorse !", "title": "high-quality!! like it!", "rating": "5", "source": "wallmart"},
{"text": "I honestly love this set, it has all of the basics! The exclusive colors and verities are so amusing. i bought the rose gold set and could not be happier, clean to smooth, super best, stunning, and fast transport! Will/ would buy again!", "title": "beautiful set", "rating": "5", "source": "wallmart"},
{"text": "This turned into a present for my daughter for her new condo and she loved it! everything you need to set up a home bar. beautiful to display and on every occasion is excessive satisfactory. cherished it!", "title": "remarkable bar package and present", "rating": "5", "source": "wallmart"},
{"text": "This set could be very elegant and properly made. The wooden block that holds all the portions may be very strong and properly made with a good amount of weight to it.", "title": "great searching and nicely made!", "rating": "5", "source": "wallmart"},
{"text": "This bartender set is tremendous! it's exceptional long lasting and properly put together! i'll be the usage of this set for a long time and will advise to all my peeps!", "title": "top notch!", "rating": "5", "source": "wallmart"},
{"text": "i like this new bar package! I took it to my first private bartending occasion, finally, and it had the whole thing I wanted! incredible first-rate and lots of gear for a wonderful charge", "title": "Love my new bar kit!", "rating": "5", "source": "wallmart"},
{"text": "i am new to making mixed liquids and cocktails. but this set appeared like it had the entirety i might want to get started and to this point it is best!", "title": "Had the entirety I wanted.", "rating": "5", "source": "wallmart"},
{"text": "brilliant quality looking set, but the wooden stand became splintering a lot when it arrived. still precise value for charge, simply want the stand was higher first-class.", "title": "Splintered base", "rating": "3", "source": "wallmart"},
{"text": "It has all of the needed tools to be an amazing bartender. We use it at domestic and make our cocktails less complicated, specially the mojitos. I always wash it through hand however I believe is dishwasher secure. I rather propose it.", "title": "accurate first-class", "rating": "5", "source": "wallmart"},
{"text": "Such an first-rate product! Love how it's so organized having it at my bar, making it so handy to have my bartending equipment when ever i'm equipped to shake up a cocktail. definitely a bar set that everyone with a domestic bar must have!", "title": "display enterprise", "rating": "5", "source": "wallmart"},
{"text": "i would recommend this set to everyone that wants to start making beverages or take their competencies to a brand new stage. This package is a awesome value and comes with truely the entirety you want to make any drink imaginable.", "title": "brilliant cost Bartender package!", "rating": "5", "source": "wallmart"},
{"text": "Packaged beautifully\nVery giftable\ntimber feels solid\nAll portions that include the set also are of excellent first-rate\ni really like the engraving on the cocktail shaker. It become finished tastefully.\nusual, i'm very pleased!", "title": "high nice", "rating": "5", "source": "wallmart"},
{"text": "Love this set, it has the whole lot I want. fantastic high-quality chrome steel, sharp looking storage for the bar gadgets. i bought for myself however plan on purchasing as a housewarming present. really appropriate quality first rate price", "title": "proper great appears sharp", "rating": "5", "source": "wallmart"},
{"text": "remarkable fee for the sort of entire set and the recipe cards protected are a pleasant bonus. appears great on a bar cart, and appears even nicer than in the image.", "title": "fantastically made", "rating": "5", "source": "wallmart"},
{"text": "superb assortment", "title": "bar objects", "rating": "5", "source": "wallmart"},
{"text": "Love this bar accessory package! It has the whole lot you want and a place to position the whole lot.", "title": "first-rate present concept", "rating": "5", "source": "wallmart"},
{"text": "were given proficient this set and could not be more satisfied, this type of terrific kit and such first-class device!", "title": "brilliant", "rating": "5", "source": "wallmart"},
{"text": "the entirety seems wonderful. My buddies have been inspired, the seal is awesome. i'd recommend to a chum.", "title": "excellent first bartending set", "rating": "5", "source": "wallmart"},
{"text": "Very first-class setup. Comes with the entirety you need and more. fun to apply and without a doubt well worth your cash.", "title": "Dope set", "rating": "5", "source": "wallmart"},
{"text": "extremely good gift, makes extraordinary display whilst now not in use. Arrived amazingly fast as well.", "title": "fantastic present", "rating": "5", "source": "wallmart"},
{"text": "Very entire set this is nicely made, and the wood stand looks first rate. a pleasant version to the bar with the whole lot you want.", "title": "beautiful Set", "rating": "5", "source": "wallmart"},
{"text": "ideal package for everything you may need for a starter bar. the whole thing is durable and the stand it is available in is perfect!", "title": "first-rate buy", "rating": "5", "source": "wallmart"},
{"text": "The product become usual truly correct simply lacking the combination spoon can also have been from delivery but as container was closely damaged", "title": "lacking mixing spoon", "rating": "3", "source": "wallmart"},
{"text": "the whole thing approximately it's miles nice, the only thing i'd whinge about is the jigger would not hold the perfect amount (it is too small).", "title": "superb for the charge", "rating": "5", "source": "wallmart"},
{"text": "we are pleased with this set. perfect for the house bartender. looking ahead to the usage of it increasingly more.", "title": "notable set", "rating": "5", "source": "wallmart"},
{"text": "If I have been to solely judge this product based off of seems, it has 5 stars. It seems simply good.", "title": "haven't used but", "rating": "5", "source": "wallmart"},
{"text": "MY HUSBAND is very unique approximately HIS presents but HE definitely FELL IN LOVE WITH THIS CHRISTMAS present. WE pretty endorse THIS item!", "title": "great great!", "rating": "5", "source": "wallmart"},
{"text": "This set helped me make all my well-known bar beverages, so handy it comes with the entirety you want .", "title": "top notch", "rating": "5", "source": "wallmart"},
{"text": "we adore this set for all our sober beverages. a nice looking set that works flawlessly for our wishes.", "title": "it is perfect for the sober & alchey mixologist", "rating": "5", "source": "wallmart"},
{"text": "it's a splendid Cocktail Shaker package! check my video evaluation to peer and listen greater information surrounding the kit!\nrather endorsed!", "title": "What a brilliant Shaker SET!", "rating": "5", "source": "wallmart"},
{"text": "My pal cherished the variety it provided and the way superb the entirety appears and the fact it comes with its a stand . honestly terrific", "title": "extremely good", "rating": "5", "source": "wallmart"},
{"text": "wonderful set given to me for Valentines Day. stunning and purposeful. I sense like a pro with my Boston Shaker.", "title": "beautiful set with all you need for cocktails", "rating": "5", "source": "wallmart"},
{"text": "I liked the fee and the practicality.", "title": "practical", "rating": "3", "source": "wallmart"},
{"text": "Soooo i am making an investment in my buddy's alcoholic peruse. I think she will adore it!!", "title": "gift for a pal", "rating": "3", "source": "wallmart"},
{"text": "Love them, so long lasting and chicb", "title": "cute set", "rating": "5", "source": "wallmart"},
{"text": "got it as a gift! love it", "title": "wonderful bar set!", "rating": "5", "source": "wallmart"},
{"text": "this is an top notch set for the charge. i use it all of the time.", "title": "exceptional little set on your bar.", "rating": "5", "source": "wallmart"},
{"text": "the entirety approximately this product is exceptional. properly made product.", "title": "stunning!", "rating": "5", "source": "wallmart"},
{"text": "all of the bar gear wished for home entertainments. And 35 new drink recipes to attempt.", "title": "elegant and sleek", "rating": "5", "source": "wallmart"},
{"text": "precise great comes with drink recipes NO RUST and to pinnacle it off fairly priced\n10 outta 10", "title": "first-class of the nice", "rating": "5", "source": "wallmart"},
{"text": "remarkable bar set for the money! worth every penny!", "title": "best for domestic bar", "rating": "5", "source": "wallmart"},
{"text": "truely excellent package for our bar at home, my husband loves it and the metallic does not rust.", "title": "really exceptional kit.", "rating": "5", "source": "wallmart"},
{"text": "changed into a huge hit with the man or woman i bought it for.", "title": "changed into a gift", "rating": "2", "source": "wallmart"},
{"text": "i purchased this as a gift for my granddaughter and he or she loves it", "title": "whole bar smooth", "rating": "5", "source": "wallmart"},
{"text": "surely a remarkable excellent bar set for the rate.", "title": "remarkable nice well worth the fee!", "rating": "5", "source": "wallmart"},
{"text": "desire it got here with a case or small duffel bag", "title": "Has what's need", "rating": "3", "source": "wallmart"},
{"text": "Has the whole thing you need for your private home bar", "title": "perfect for the house bartender", "rating": "5", "source": "wallmart"},
{"text": "excellent set for the money via a ways!", "title": "wonderful!", "rating": "5", "source": "wallmart"},
{"text": "wonderful bar set! matches are bar so i'm happy with it!", "title": "No lawsuits to date!", "rating": "5", "source": "wallmart"},
{"text": "So useful and compact for all mixing needs in place of looking in cabinet drawers.", "title": "Compact!", "rating": "5", "source": "wallmart"},
{"text": "I revel in making my own cocktails at home. This set makes it smooth.", "title": "fantastic set to begin your own home bar, or use at the job at a bar.", "rating": "5", "source": "wallmart"},
{"text": "just acquired the set and blown away with the first-rate of each piece. this is a good buy!", "title": "Wow! first rate remarkable!", "rating": "5", "source": "wallmart"},
{"text": "I gave this as a present, and it became well acquired. They appear to be happy with it.", "title": "present", "rating": "3", "source": "wallmart"},
{"text": "What a excellent deal and fee for nice portions. absolutely however it! you'll now not regret it!", "title": "amazing!", "rating": "5", "source": "wallmart"},
{"text": "right buy for the rate. the whole lot you could need for a hard and fast!", "title": "exquisite!!", "rating": "5", "source": "wallmart"},
{"text": "precisely what i bought.", "title": "good deal", "rating": "5", "source": "wallmart"},
{"text": "i purchased this as a gift for my granddaughter and he or she loves it", "title": "whole bar smooth", "rating": "5", "source": "wallmart"},
{"text": "surely a remarkable excellent bar set for the rate.", "title": "remarkable nice well worth the fee!", "rating": "5", "source": "wallmart"},
{"text": "desire it got here with a case or small duffel bag", "title": "Has what's need", "rating": "3", "source": "wallmart"},
{"text": "Has the whole thing you need for your private home bar", "title": "perfect for the house bartender", "rating": "5", "source": "wallmart"},
{"text": "excellent set for the money via a ways!", "title": "wonderful!", "rating": "5", "source": "wallmart"},
{"text": "wonderful bar set! matches are bar so i'm happy with it!", "title": "No lawsuits to date!", "rating": "5", "source": "wallmart"},
{"text": "So useful and compact for all mixing needs in place of looking in cabinet drawers.", "title": "Compact!", "rating": "5", "source": "wallmart"},
{"text": "I revel in making my own cocktails at home. This set makes it smooth.", "title": "fantastic set to begin your own home bar, or use at the job at a bar.", "rating": "5", "source": "wallmart"},
{"text": "just acquired the set and blown away with the first-rate of each piece. this is a good buy!", "title": "Wow! first rate remarkable!", "rating": "5", "source": "wallmart"},
{"text": "I gave this as a present, and it became well acquired. They appear to be happy with it.", "title": "present", "rating": "3", "source": "wallmart"},
{"text": "What a excellent deal and fee for nice portions. absolutely however it! you'll now not regret it!", "title": "amazing!", "rating": "5", "source": "wallmart"},
{"text": "right buy for the rate. the whole lot you could need for a hard and fast!", "title": "exquisite!!", "rating": "5", "source": "wallmart"},
{"text": "precisely what i bought.", "title": "good deal", "rating": "5", "source": "wallmart"},
{"text": "i purchased this as a gift for my granddaughter and he or she loves it", "title": "whole bar smooth", "rating": "5", "source": "wallmart"},
{"text": "surely a remarkable excellent bar set for the rate.", "title": "remarkable nice well worth the fee!", "rating": "5", "source": "wallmart"},
{"text": "desire it got here with a case or small duffel bag", "title": "Has what's need", "rating": "3", "source": "wallmart"},
{"text": "Has the whole thing you need for your private home bar", "title": "perfect for the house bartender", "rating": "5", "source": "wallmart"},
{"text": "excellent set for the money via a ways!", "title": "wonderful!", "rating": "5", "source": "wallmart"},
{"text": "wonderful bar set! matches are bar so i'm happy with it!", "title": "No lawsuits to date!", "rating": "5", "source": "wallmart"},
{"text": "So useful and compact for all mixing needs in place of looking in cabinet drawers.", "title": "Compact!", "rating": "5", "source": "wallmart"},
{"text": "I revel in making my own cocktails at home. This set makes it smooth.", "title": "fantastic set to begin your own home bar, or use at the job at a bar.", "rating": "5", "source": "wallmart"},
{"text": "just acquired the set and blown away with the first-rate of each piece. this is a good buy!", "title": "Wow! first rate remarkable!", "rating": "5", "source": "wallmart"},
{"text": "I gave this as a present, and it became well acquired. They appear to be happy with it.", "title": "present", "rating": "3", "source": "wallmart"},
{"text": "What a excellent deal and fee for nice portions. absolutely however it! you'll now not regret it!", "title": "amazing!", "rating": "5", "source": "wallmart"},
{"text": "right buy for the rate. the whole lot you could need for a hard and fast!", "title": "exquisite!!", "rating": "5", "source": "wallmart"},
{"text": "precisely what i bought.", "title": "good deal", "rating": "5", "source": "wallmart"},
{"text": "i purchased this as a gift for my granddaughter and he or she loves it", "title": "whole bar smooth", "rating": "5", "source": "wallmart"},
{"text": "surely a remarkable excellent bar set for the rate.", "title": "remarkable nice well worth the fee!", "rating": "5", "source": "wallmart"},
{"text": "desire it got here with a case or small duffel bag", "title": "Has what's need", "rating": "3", "source": "wallmart"},
{"text": "Has the whole thing you need for your private home bar", "title": "perfect for the house bartender", "rating": "5", "source": "wallmart"},
{"text": "excellent set for the money via a ways!", "title": "wonderful!", "rating": "5", "source": "wallmart"},
{"text": "wonderful bar set! matches are bar so i'm happy with it!", "title": "No lawsuits to date!", "rating": "5", "source": "wallmart"},
{"text": "So useful and compact for all mixing needs in place of looking in cabinet drawers.", "title": "Compact!", "rating": "5", "source": "wallmart"},
{"text": "I revel in making my own cocktails at home. This set makes it smooth.", "title": "fantastic set to begin your own home bar, or use at the job at a bar.", "rating": "5", "source": "wallmart"},
{"text": "just acquired the set and blown away with the first-rate of each piece. this is a good buy!", "title": "Wow! first rate remarkable!", "rating": "5", "source": "wallmart"},
{"text": "I gave this as a present, and it became well acquired. They appear to be happy with it.", "title": "present", "rating": "3", "source": "wallmart"},
{"text": "What a excellent deal and fee for nice portions. absolutely however it! you'll now not regret it!", "title": "amazing!", "rating": "5", "source": "wallmart"},
{"text": "right buy for the rate. the whole lot you could need for a hard and fast!", "title": "exquisite!!", "rating": "5", "source": "wallmart"},
{"text": "precisely what i bought.", "title": "good deal", "rating": "5", "source": "wallmart"}
]